{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes. Use [[Special:ApiFeatureUsage]] to see usage of deprecated features by your application."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"normalized": [{"from": "Bombshell_(DC_Comics)", "to": "Bombshell (DC Comics)"}], "pages": {"7196857": {"pageid": 7196857, "ns": 0, "title": "Bombshell (DC Comics)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Other uses|Bombshell (disambiguation){{!}}Bombshell}}\n{{For|the Marvel Comics characters of the same name|Bombshell (Marvel Comics)}}\n{{Infobox comics character <!--Wikipedia:WikiProject Comics-->\n|image=BombshellTT39.jpg\n|imagesize=150\n|converted=y\n|caption=Bombshell from ''Teen Titans'' vol. 3, #39, artist [[Tony Daniel]].\n|character_name=Bombshell\n|real_name=Amy Sue Allen\n|publisher=[[DC Comics]]\n|debut= (cameo) ''[[Teen Titans]]'' vol. 3, #38; (actual appearance) ''Teen Titans'' vol. 3, #39 (2006)\n|creators=[[Geoff Johns]] (writer)<br>[[Tony Daniel]] (artist)\n|alliances=[[Teen Titans]]<br/>[[Titans East]]\n|aliases=\n|powers=Flight, super strength and durability, energy blasts\n|cat=super\n|subcat=DC Comics\n|hero=y\n|villain=y\n|sortkey=Bombshell\n}} \n\n'''Bombshell''' ('''Amy Allen''') is a [[superheroine]] appearing in [[American comic books]] published by [[DC Comics]]. She first appeared in ''[[Teen Titans]]'' vol. 3, #38, and was created by [[Geoff Johns]] and [[Tony Daniel]].\n\n==Fictional character biography==\nFirst mentioned in ''[[Teen Titans]]'' vol. 3, #38, she was a member of the Teen Titans during the one-year gap after ''[[Infinite Crisis]]''. She has similar powers to [[Captain Atom]] as she underwent the same alien metal skin experiment that Nathaniel Adam did. Prior to this, she was recruited into a rogue military black ops unit when she was arrested for assault and battery and faced jail time. This rogue group made a habit of accepting dubious freelance contracts in addition to their own projects. Using the same extraterrestrial metal that comprises Captain Atom's skin, the group grafted the metal onto her human skin.<ref>''Teen Titans'' vol. 3, #38</ref>\n\nIn #40, Bombshell is revealed to be a traitor to the Titans, as she threatens to kill [[Raven (DC Comics)|Raven]] and attacks several members of the team to get a disc that contains the essence of the deceased Titan [[Jericho (comics)|Jericho]], but is stopped by [[Rose Wilson|Ravager]].<ref>''Teen Titans'' vol. 3 #40</ref> At the end of issue #41, the Titans beat her by shattering her metal skin. Since it is this metal coating that provides her powers, she temporarily lost her abilities.<ref>''Teen Titans'' vol. 3 #41</ref>\n\nIn #43, Cyborg and [[Miss Martian]] visit a depowered Bombshell in jail. After refusing to tell them who she worked for, Miss Martian proceeds to probe her mind. In doing so, she discovers the existence of [[Titans East]] and that Bombshell is a member. Before any additional information is discovered, [[Cassandra Cain|Batgirl]] and [[Risk (comics)|Risk]] break into the cell—but not to save their former teammate. Instead, Batgirl slices Bombshell's throat with a batarang.<ref>''Teen Titans'' vol. 3 #43</ref>\n\nIn #63, it is revealed that Bombshell is alive.<ref>''Teen Titans'' vol. 3 #63</ref> It is also revealed that she was convinced by her father to take part in the procedure instead of serving a prison sentence for assault. When Project: Quantum learns of her survival, they attempt to have her killed. Bombshell learns that her father is the head of the project and sets out to kill him. In #64, Amy's father reveals that her joining the Titans East, and her current predicament, is due to a rogue factor within Project: Quantum.<ref>''Teen Titans'' vol. 3 #64</ref> At his urging, Bombshell agrees to be sheltered by the Titans for the time being. In #65, the one behind the attempts on Amy's life is none other than her own mother, the new head of Project Quantum.<ref>''Teen Titans'' vol. 3 #65</ref>\n\nFurthermore, in ''[[Final Crisis]]'' #3 she is one of the heroes covered by ''Article X'', the mandatory draft introduced by [[Franklin D. Roosevelt|Franklin Delano Roosevelt]] and the [[Justice Society]] to reunite under a single army every non-hostile metahuman or ''mystery man''.<ref>''Final Crisis'' #3</ref>\n\nIn ''Teen Titans'' #71, Ravager's return to the team causes friction between her and Bombshell, as Bombshell had previously tried to frame Ravager as a traitor. The two have an altercation where Ravager forces Bombshell to admit her loyalty to the team. Satisfied with Bombshell's statement, Ravager leaves the team.<ref>''Teen Titans'' vol. 3 #71</ref>\n\nIn ''Teen Titans'' #84, Bombshell and her rival, [[Aquagirl (Lorena Marquez)|Aquagirl]], are swallowed by a demonic [[sea monster]] during a mission to rescue [[Raven (DC Comics)|Raven]] from an extradimensional being called Wyld.<ref>''Teen Titans'' vol. 3 #84</ref> In issue #88, it is learned that after their rescue, both Bombshell and Aquagirl were asked to leave the team by [[Wonder Girl (Cassie Sandsmark)|Wonder Girl]], who had come to believe that it was hazardous to have \"inexperienced\" heroes as a part of the Teen Titans.<ref>''Teen Titans'' vol. 3 #88</ref>\n\nFollowing her dismissal from the Teen Titans, Bombshell appears in ''Batgirl'' #23 as one of the young heroines who helps [[Stephanie Brown (comics)|Batgirl]] in her battle against the Reapers.<ref>''Batgirl'' #23</ref> Alongside Aquagirl and a host of other former Titans, Bombshell later returns in ''Teen Titans'' #99 to aid the Titans during their battle with [[Superboy-Prime]].<ref>''Teen Titans'' vol. 3 #99</ref>\n\n==Powers and abilities==\nBombshell has [[Captain Atom#Dilustel|Dilustel]] (quantum metal) skin like [[Major Force]] and Captain Atom, which was cut from the body of an alien lifeform known as the ''Silver Shield'' after being captured by [[List of government agencies in DC Comics#Project Atom|Project Atom]]. This skin makes her nearly invulnerable and grants her a measure of superhuman strength (enough to throw a car with ease and hurt [[Wonder Girl (Cassie Sandsmark)|Wonder Girl]] and other moderately powered super beings with a punch). She can fly and fire blasts of energy. Bombshell can generate energy waves capable of scrambling the minds of others, and can control electromagnetically powered technology, like the electronic parts of [[Cyborg (comics)|Cyborg]]. \n\nBombshell's origin is different from Captain Atom's and Major Force's in that she was not exposed to a nuclear explosion in the course of acquiring her Dilustel coating; she was merely covered with the alien material. Thus, there is no risk of a radiation hazard if her quantum metal skin is breached: in fact, damaging the metal coating beyond a certain point temporarily negates her powers.\n\n''Teen Titans'' #63 reveals that the metal had managed to bond to her body and she can bring forth a new coating whenever she wants to, with all the powers of the original.\n\n==References==\n{{reflist}}\n\n== External links ==\n* [https://web.archive.org/web/20070217050301/http://www.titanstower.com/source/whoswho/OYG/bombshell.html Bombshell profile at Titans Tower]\n\n[[Category:Comics characters introduced in 2006]]\n[[Category:Female characters in comics]]\n[[Category:Fictional mercenaries in comics]]\n[[Category:Fictional special forces personnel]]\n[[Category:DC Comics characters with superhuman strength]]\n[[Category:DC Comics female superheroes]]\n[[Category:DC Comics metahumans]]\n[[Category:Characters created by Geoff Johns]]\n[[Category:Characters created by Tony S. Daniel]]"}]}}}}