{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes. Use [[Special:ApiFeatureUsage]] to see usage of deprecated features by your application."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"normalized": [{"from": "Daniel_Drumm", "to": "Daniel Drumm"}], "pages": {"27867552": {"pageid": 27867552, "ns": 0, "title": "Daniel Drumm", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{more footnotes|date=June 2010}}\n{{Infobox comics character| <!--Wikipedia:WikiProject Comics-->\n|image=\n|caption=\n|character_name=Daniel Drumm\n|real_name=Daniel Drumm\n|publisher=[[Marvel Comics]]\n|debut=''[[Strange Tales]]'' #169 (1973)\n|creators=[[Gene Colan]] (writer)<br>[[Len Wein]] (artist)\n|species=[[Ghost]]\n|alliances=\n|aliases=Doctor Voodoo\n|powers=\n*[[Spirit possession]]\n*Extensive mystical knowledge\n}}\n'''Daniel Drumm''' is a fictional character appearing in [[American comic book]]s published by [[Marvel Comics]].\n\nThe character appeared in the [[Marvel Cinematic Universe]] film ''[[Doctor Strange (2016 film)|Doctor Strange]]'' (2016), portrayed by Mark Anthony Brighton.\n\n==Publication history==\nDrumm first appeared in ''[[Strange Tales]]'' issue #169, in Sept. 1973. This issue also featured the first appearance of [[Brother Voodoo]]. Drumm went on to star in guest appearances alongside Brother Voodoo in other Marvel titles such as [[Ghost Rider]], [[Doctor Strange]], [[The Tomb of Dracula]], and [[Hulk]]. The character was also featured in the ongoing series Doctor Voodoo: Avenger of the supernatural, written by [[Rick Remender]] which began in 2009 and ended in 2010. The series was cancelled after only five issues. The character has recently been featured in the ''[[Age of Heroes (comics)|Age of Heroes]]'' series.<ref>{{cite web |url=http://www.comicbookdb.com/character_chron.php?ID=15446 |url-status=dead |archive-url=https://web.archive.org/web/20120313211812/http://www.comicbookdb.com/character_chron.php?ID=15446 |archive-date=2012-03-13 |title=Comic Book DB - Daniel Drumm}}</ref>\n\n==Fictional character biography==\nDaniel is the twin brother of Jericho Drumm (who would later become [[Brother Voodoo]]). They were raised by their aunt Matilda, in an impoverished neighborhood in Port-au-Prince, Haiti. Jericho left to pursue an education in the United States, whilst Daniel remained in Haiti and studied magic, eventually earning the title Brother Voodoo. Twelve years later, Jericho learned that Daniel was ill, and returned to Haiti, where he learned that an evil occultist called Damballah had placed a curse on him. At midnight, Damballah used a voodoo doll resembling Daniel to kill him, but not before Jericho promised Daniel that he would stop Damballah. A witch doctor, Papa Jambo, then used magic to link the two brothers' spirits together, and Jericho became the new Brother Voodoo, with his brother's ghost.{{issue|date=December 2014}}\n\nMany years later, when the Eye of Agamotto leaves [[Doctor Strange]] after showing him and the New Avengers nearly thirty candidates who would possibly replace him, Jericho Drumm, due to his mystical power and heritage, and being apparently chosen by the Eye itself, is chosen as the acting Sorcerer Supreme of [[Earth-616]] reality. Due to their shared bond, Daniel Drumm's ghost chooses to stand for his brother and help him in his new role.<ref>''[[The New Avengers (comics)|The New Avengers]]'' #53 (July 2009)</ref> In this capacity, he joins Jericho and the Avengers in a battle on the mystical plane against the entity Agamotto itself, willing to retrieve his Eye and rule Earth. Despite their combined efforts, Strange, the Avengers and Daniel fail, forcing Jericho to sacrifice himself in a mystical explosion, taking out both Agamotto and the Eye. Daniel, however, is able to survive the explosion, and, briefly taking control of [[Luke Cage]]'s body, angrily blames Doctor Strange for Jericho's death, fleeing to parts unknown.<ref>''The New Avengers'' vol. 2 #6 (Jan. 2011)</ref>\n\nDaniel Drumm's ghost later returns, possessing various Avengers and killing other sorcerers (ranging from [[Daimon Hellstrom]], [[Jennifer Kale]], and [[Baron Mordo]]) in preparation for his final assault on Strange (now convinced that Strange set his brother up to fail in his new role). Doctor Strange defeats him by using dark magic (recognizing that Drumm had only killed dark magic specialists while trying to frame Strange), subsequently regaining his position of Sorcerer Supreme as a result.<ref>''The New Avengers'' vol. 2 #31-34</ref>\n\nDuring the ''[[AXIS (comics)|AXIS]]'' storyline, Daniel's spirit later returns after [[Doctor Doom]] resurrects Doctor Voodoo in order to help defeat the inverted [[Scarlet Witch]] before she destroys Latveria. Daniel still expresses hatred for the Avengers and is delighted to be given the opportunity to solve a problem they caused. He starts by possessing Scarlet Witch in an attempt to defeat her.<ref>''AXIS'' #8</ref>\n\nFollowing the ''[[Civil War II]]'' storyline, Daniel Drumm's ghost forms an alliance with the [[The Hand (comics)|Hand]]. As part of the plans to bolster the ranks of the Hand, Daniel has the Hand ninjas abduct [[Hulk|Bruce Banner]]'s body following his funeral.<ref>''Uncanny Avengers'' vol. 3 #14</ref> When the Uncanny Avengers confront the Hand and Daniel Drumm, they are confronted by a revived Hulk in samurai armor.<ref>''Uncanny Avengers'' vol. 3 #15</ref>\n\n==Powers and abilities==\nAs Brother Voodoo, Drumm possessed many magical abilities. He can also merge his soul with his brother's body, which increases his speed, stamina and strength, and can also enter and control other bodies as he pleases.\n\nSomehow surviving Jericho's apparent death, Daniel Drumm lost the abilities tied to Jericho's one: however, he retained the ability to enter and control other bodies, using them as physical mediums.\n\n==Other versions==\n===Earth-Chaos===\nIn the Earth-Chaos timeline, Daniel Drumm performed a dark ceremony with his brother Jericho watching. In the release of the strange energy, Daniel was apparently incinerated. On the day before Halloween 13 years after the Chaos! event, Jack O'Lantern launched a scheme to bring about a hell on Earth and take over the world with the proper alignment of cosmos. Raising dead persons and animating dinosaurs, he looked to gather the remaining heroes of the world for the purpose of eliminating them. However, Brother Voodoo (Jericho Drumm) and the Supernaturals were able to overcome his machinations, sending Jack into another dimension. With Jack gone, his minions disappeared and the world was saved. Jack O'Lantern may still be holding the heroes captured from the first Chaos! event in his wand and plotting another takeover of the Earth.{{issue|date=December 2014}}\n\n==In other media==\n* Daniel Drumm appears in the live-action film ''[[Doctor Strange (2016 film)|Doctor Strange]]'' (2016), portrayed by Mark Anthony Brighton.<ref>{{Cite web|url = http://www.comicbookresources.com/article/doctor-strange-prequel-comic-hints-at-movie-secrets-introduces-another-marvel-villain|title = \"Doctor Strange\" Prequel Comic Hints at Movie Secrets, Introduces Another Marvel Villain|date = 6 July 2016|access-date = 7 July 2016|archive-date = 13 August 2016|archive-url = https://web.archive.org/web/20160813152459/http://www.comicbookresources.com/article/doctor-strange-prequel-comic-hints-at-movie-secrets-introduces-another-marvel-villain|url-status = dead}}</ref> This version is a member of the [[Masters of the Mystic Arts]] and served as the protector the New York [[Sanctum Sanctorum (Marvel Comics)|Sanctum]] before he was mortally wounded by [[Kaecilius]], with whom he had history. He is succeeded by [[Stephen Strange (Marvel Cinematic Universe)|Stephen Strange]] as the protector of the New York Sanctum.\n* Daniel Drumm makes a cameo appearance in the video game ''[[Marvel: Avengers Alliance]]'' as part of [[Doctor Voodoo]]'s Spirit Possession attack.\n\n==References==\n<references />\n\n==External links==\n* [http://marvel.wikia.com/Daniel_Drumm_(Earth-616) Daniel Drumm] at Marvel Wiki\n* [http://www.comicvine.com/daniel-drumm/29-28756/ Daniel Drumm] at Comic Vine\n* [http://www.comicbookdb.com/character_chron.php?ID=15446 Daniel Drumm] at Comic Book Database\n* [http://www.figurerealm.com/ViewCustoms.php?SID=152 Daniel Drumm]{{Dead link|date=October 2022 |bot=InternetArchiveBot |fix-attempted=yes }} at Figurerealm.com\n\n{{Doctor Strange|state=collapsed}}\n{{Marvel Mystic}}\n\n{{DEFAULTSORT:Drumm, Daniel}}\n[[Category:Marvel Comics male superheroes]]\n[[Category:Marvel Comics male supervillains]]\n[[Category:Fictional Haitian people]]\n[[Category:Marvel Comics characters who use magic]]\n[[Category:Characters created by Len Wein]]\n[[Category:Characters created by Gene Colan]]\n[[Category:Twin characters in comics]]"}]}}}}