{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes. Use [[Special:ApiFeatureUsage]] to see usage of deprecated features by your application."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"normalized": [{"from": "Decay_(DC_Comics)", "to": "Decay (DC Comics)"}], "pages": {"6724134": {"pageid": 6724134, "ns": 0, "title": "Decay (DC Comics)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Infobox comics character <!--Wikipedia:WikiProject Comics-->\n|image=Cover of Wonder Woman vol. 2, 4.jpg\n|caption=Decay II on the cover of ''Wonder Woman'' #4.\n|publisher=[[DC Comics]] \n|debut=''Wonder Woman'' #3 (Vol. 2) (April 1987)\n|creators=[[George Pérez]]\n|character_name=Decay\n|real_name=\n|alliances=\n|previous_alliances=\n|aliases=\n|relatives=\n|powers=Flight, invulnerability, touch causes aging and death, breath causes a target to turn to dust.\n}}\n\n'''Decay''' is the name of three [[fictional characters]] owned by [[DC Comics]]. The first was an enemy of the pre-Crisis [[Supergirl]], while the second appeared as a villain in the ''[[Wonder Woman]]'' [[comic book]] series.<ref>{{cite book |last1=Jimenez |first1=Phil |last2=Wells |first2=John |title=The Essential Wonder Woman Encyclopedia |date=2010 |publisher=Del Rey |isbn=978-0345501073 |page=108}}</ref> The third version appeared in the New 52 as a enemy of [[Superboy]].\n\n==Fictional character biography==\n\n{{Empty section|date=March 2015}}\n\n==Decay (Daniel Pendergast)==\nA delusional researcher at the Institute for Higher Psychokinetic Study, Daniel Pendergast observed modern society as \"decay\" and manipulated psionic Gayle Marsh into becoming the super-villainess Psi to help him destroy civilization under the ambiguous definition of wiping out \"decay\". Psi would trade blows with [[Supergirl (Kara Zor-El)|Supergirl]] and be defeated, returning to Pendergast. He attempted to kill her for her failure and she instinctively lashed out, turning him into a hulking monster of decay. He set himself upon [[Chicago]] and began to melt and consume matter, battling Supergirl, before Psi would appear and revert him to his human form. He was introduced in ''Daring New Adventures of Supergirl'' #1 (November 1982).\n\n==Decay (Wonder Woman villainess)==\nTo win the approval of his father [[Ares (DC Comics)|Ares]], the minor god [[Children of Ares (comics)|Phobos]] (god of fear) journeyed to the Cavern of the [[Gorgons]] where he molded a statuette from malevolent matter scoured from [[Medusa]]'s heart. He then arranged for the item to be delivered to the residence of [[Julia Kapatelis]], a friend of Wonder Woman. It was here that Wonder Woman, also known as Diana, was rooming as she oriented herself to life off of her island home [[Themyscira (DC Comics)|Themyscira]].<ref>''Wonder Woman'' (vol. 2) #3</ref>\n\nAs Phobos arranged, once the statuette (named '''Decay''') was delivered, it came to life in the hands of [[Vanessa Kapatelis]]. Decay then forcibly aged Vanessa by decades after she had touched her. Decay then destroyed the Kapatelis home in her first attempt to kill Diana. Failing that, Decay gleefully went on the destructive rampage in the city of [[Boston]] with Diana in pursuit. After a dangerous battle which resulted in Wonder Woman being aged as well, Diana realized the proper way to defeat the monster. She snared Decay in her [[Lasso of Truth]], which is also tied to the renewing power of [[Gaia]], Goddess of the Earth. Bombarded with this power, Decay was overwhelmed and she exploded while Diana's youth was restored.<ref>''Wonder Woman'' (vol. 2) #4</ref> A short time later, Diana obtained a magic ointment from Themyscira to restore Vanessa's youth as well.<ref>''Wonder Woman'' (vol. 2) #7</ref>\n\nDecay was resurrected by Dr. Julian Lazarus's Virtual Reanimator, which brought the demon of destruction back to life with its experimental proto-matrix material, Wonder Woman missing the resurrection because she was occupied fighting a duplicate of [[Doomsday (comics)|Doomsday]] that Lazarus's machine had unintentionally created earlier. While Decay's body was merely an artificial effigy, the demon's spirit possessed the copy of her former self as her own. But before Decay could secure the power source needed to maintain her imitation of life, Diana shattered the virtual clone into a million pieces.<ref>''Wonder Woman'' (vol. 2) #112-113</ref>\n\n==Decay (New 52)==\nIn September 2011, [[The New 52]] rebooted DC's continuity. In the new timeline, a third villain named '''Decay''' is introduced as a young girl named Sarah who is captured by the organisation [[H.I.V.E.]] They test individuals with psychic potential to turn those who display metahuman powers into warriors for H.I.V.E. and those who don't into \"drones\", mindless sources of power for H.I.V.E. to use. Decay appears as a manifestation of Sarah's powers and, under the influence of [[Doctor Psycho]], they escape and destroy the H.I.V.E. facility they were in.<ref>''Superboy'' (vol. 4) #24</ref>\n\nMuch later, Sarah is shown living on the streets of [[New York City|New York]] until she is encountered by Doctor Psycho who recognises her, but she doesn't remember him. Decay suddenly appears and attacks, forcing Doctor Psycho to retreat. Sarah is later met in an alley by [[Superboy]] and Doctor Psycho. They take her to a restaurant where she eats until Decay appears again. Doctor Psycho then discovers that \"Decay\" is in fact Sarah. It envelops her and nearly kills everyone present until Superboy telekinetically cuts the blood flow to Sarah's brain for just a second, knocking her out. Doctor Psycho then places Sarah in a coma in which she experiences a dream world in which she is with her family living a normal life. According to Doctor Psycho, as long as Sarah feels safe, \"Decay\" should no longer pose a threat.<ref>''Superboy'' (vol. 4) #21</ref>\n\n==Powers and abilities==\nIn his monstrous form as the first Decay, Daniel Pendergast possessed the ability to melt and consume matter.\n\nThe second Decay was a skilled fighter possessing the powers of flight and invulnerability. Her touch can cause any living thing she comes in contact with to rapidly age, eventually resulting in death. Decay's breath is equally deadly, and can crumble a target to dust.\n\nThe third Decay was a manifestation of Sarah's dormant psychic powers. It appeared is a hulking humanoid shape that was completely black and featureless, save for a skull-like head and bony claws which served as fingers. It could see and attack Doctor Psycho's astral form and displayed the ability to cause a person to rot and decay rapidly until death by touching them.\n\n==References==\n{{reflist|2}}\n\n==External links==\n*[http://dc.wikia.com/wiki/Howard_Pendergast_%28Earth-One%29]\n*[https://web.archive.org/web/20060514115330/http://www.mykey3000.com/cosmicteams/tommorrow/D/Decay.htm Cosmic Team Profile]\n*[http://www.dcuguide.com/who.php?name=decay The Unofficial Decay Biography]\n\n{{Supergirl}}\n{{Wonder Woman}}\n[[Category:Articles about multiple fictional characters]]\n[[Category:Classical mythology in DC Comics]]\n[[Category:Comics characters introduced in 1982]]\n[[Category:Comics characters introduced in 1987]]\n[[Category:Comics characters introduced in 2011]]\n[[Category:DC Comics female supervillains]]\n[[Category:DC Comics male supervillains]]\n[[Category:Characters created by George Pérez]] \n[[Category:Fictional characters with death or rebirth abilities]]\n[[Category:Wonder Woman characters]]"}]}}}}