{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes. Use [[Special:ApiFeatureUsage]] to see usage of deprecated features by your application."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"normalized": [{"from": "Elias_Bogan", "to": "Elias Bogan"}], "pages": {"5396371": {"pageid": 5396371, "ns": 0, "title": "Elias Bogan", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Multiple issues|\n{{Unreferenced|date=December 2009}}\n{{Primary sources|date=April 2008}}\n}}\n\n{{Infobox comics character <!--Wikipedia:WikiProject Comics-->\n|image=Elias Bogan.jpg\n|caption=Bogan's \"eyes of fire\", from ''X-Treme X-Men'' #33.<br>Art by [[Igor Kordey]].\n|character_name=Elias Bogan\n|real_name=\n|species=[[Mutant (Marvel Comics)|Human Mutant]]\n|publisher=[[Marvel Comics]]\n|debut=''[[X-Treme X-Men]]'' #1 (illustration in [[Destiny (Irene Adler)#The Books of Truth|Destiny's Diaries]], July 2001), #20 (mentioned, March 2003), #21 (actual appearance, April 2003)\n|creators=[[Chris Claremont]]<br>[[Salvador Larroca]]\n|alliances=[[Hellfire Club (comics)|Hellfire Club]]\n|aliases=Lord Imperial \n|powers=[[Telepathy]]<br>Mental possession\n}}\n\n'''Elias Bogan''' is a fictional [[Mutant (Marvel Comics)|mutant]] character appearing in [[American comic book]]s published by [[Marvel Comics]].  His first appearance was in ''X-Treme X-Men'' #21 (fully).  He was created by [[Chris Claremont]].\n\n==Fictional character biography==\nThe mutant known as Elias Bogan is a wealthy powerful recluse.  The rumor is that he was the inspiration for the original founding chapter of the Hellfire Club in the 1780s.  He was the first Lord Imperial but held no rank in New York branch of the Club.  Still he was regarded a most formidable member of the Club and in one point there was a wager between the new Black King of the Inner Circle, [[Sebastian Shaw (comics)|Sebastian Shaw]] and Oliver Ryland, pawn of Elias Bogan.  If Bogan had won, [[Emma Frost]], an omega-level telepath and the then-White Queen of the Club, would belong to him, and if Shaw would win, his fortune would be made.  With the help of his advisor [[Sage (comics)|Tessa]], Shaw achieved the impossible and beat Ryland in a poker game.  Bogan honored the wager but held a grudge against Tessa.\n\nYears later, Bogan exacted his revenge on Tessa by capturing her and branding her face with bleeding eyes marks, which is what usually happens to people being possessed by Bogan.  Shaw could have ransomed her, at the cost of everything he owned, but the price was too much for him and Shaw abandoned Tessa.  Surprisingly, Tessa was saved by [[Storm (Marvel Comics)|Storm]] of the [[X-Men]].\n\nFollowing a murder at Bogan's estate in Alaska, he followed the perpetrator [[Jeffrey Garrett]] to the [[Xavier Institute for Higher Learning|Xavier Institute]].  There he took possession of Emma Frost.  He also encountered and captured Tessa, now Sage of the X-Men, along with [[Bishop (comics)|Bishop]] and other students of the school, and held in the [[Danger Room]].  Upon meeting their leader Storm, Bogan tried to take control of her and was unsuccessful.\n\nDuring this incident, Bogan briefly gained full access to the X-Men’s Cerebra, which succeeded with the help of Bogan’s telepath slave, [[Rachel Summers]], a former X-Man herself.  The X-Men didn’t learn about her involvement before coming into conflict with Bogan once again, this time in Valle Soleada, [[California]], which Bogan sought to turn into his own private hunting preserve, believing that no one would ever find him there.  Bogan had a secret base in the catacombs under the local [[X-Corporation]] headquarters.  A century before, the secret home of the [[Los Angeles]] branch of the Hellfire Club, built by Elias Bogan, had stood in its place.  The X-Men confronted lawyers and mercenaries employed by Bogan several times before succeeding in infiltrating his base and gaining the possession of a crystal that held Bogan’s and Rachel’s essences inside it.  Rachel Summers was freed and the crystal shattered, but Bogan managed to escape again.  Bogan attacked again the following day, but the psychic attack made [[Magma (comics)|Magma]], of the X-Corporation, destroy the catacombs and the X-Corporation headquarters with molten lava.\n\n{{DEFAULTSORT:Bogan, Elias}}\n[[Category:Comics characters introduced in 2001]]\n[[Category:Comics characters introduced in 2003]] \n[[Category:Marvel Comics characters who have mental powers]]\n[[Category:Marvel Comics supervillains]]\n[[Category:Marvel Comics mutants]]\n[[Category:Marvel Comics telepaths]]\n[[Category:Fictional businesspeople]]\n[[Category:Fictional characters with spirit possession or body swapping abilities]]\n[[Category:Characters created by Chris Claremont]]\n[[Category:Characters created by Salvador Larroca]]"}]}}}}