{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes. Use [[Special:ApiFeatureUsage]] to see usage of deprecated features by your application."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"2416532": {"pageid": 2416532, "ns": 0, "title": "Genis-Vell", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{redirect|Legacy (Marvel Comics)|the 2017 comic book line|Marvel Legacy}}\n{{Infobox comics character  <!--Wikipedia:WikiProject Comics-->\n|character_name = Genis-Vell\n|image          = Capitanmarvel3.png\n|imagesize      = \n|converted      = y\n|caption        = Genis-Vell as Captain Marvel.<br>Art by [[ChrisCross]] and [[Chris Sotomayor]].<ref>[http://www.comics.org/issue/84902/ Captain Marvel, vol. 3 #1 at Grand Comics Database]</ref>\n|full_name      = Genis-Vell\n|publisher      = [[Marvel Comics]]\n|debut          = '''as Legacy:'''<br />''[[Silver Surfer]]'' Annual #6 (Oct. 1993)<br>'''as Captain Marvel:'''<br />''[[Captain Marvel (Marvel Comics)|Captain Marvel]]'' vol. 3 #1 (Dec. 1995)<br>'''as Photon:'''<br />''[[New Thunderbolts]]'' #6 (May 2005)\n|creators       = [[Ron Marz]]<br>[[Ron Lim]]\n|alliances      = [[Kree|Kree Space Navy]]<br/>[[Thunderbolts (comics)|Thunderbolts]]\n|species= [[Kree]]/[[Eternals (comics)|Titanian]] hybrid\n|aliases        = Legacy<br/>[[Captain Marvel (Marvel Comics)|Captain Marvel]]<br/>[[Photon (comics)|Photon]] \n|powers         = *Super strength, speed, durability\n*Energy blasts, absorption, and manipulation\n*Cosmic awareness granting omniversal level telepathy\n*Dimension transportation\n*Cosmic awareness\n*Illusion castings \n*Force fields\n*Flight\n*Wields Nega-Bands\n|cat            = super  \n|subcat         = Marvel Comics\n|hero           = y\n|sortkey        = Genis-Vell\n}}\n\n'''Genis-Vell''', also known as '''Legacy''', '''[[Captain Marvel (Marvel Comics)|Captain Marvel]]''', and '''[[Photon (comics)|Photon]]''', is a [[fiction]]al [[superhero]] turned [[supervillain]] appearing in [[American comic book]]s published by [[Marvel Comics]]. He is depicted as the son of [[Captain Marvel (Mar-Vell)|Mar-Vell]] of the extraterrestrial [[Kree]] Empire, who was the first character to be known as [[Captain Marvel (Marvel Comics)|Captain Marvel]] in the Marvel Universe. Genis-Vell would become the third to carry the name.\n\n==Publication history==\nGenis-Vell first appeared in ''[[Silver Surfer]]'' vol. 3 Annual #6 (1993) using the codename of \"Legacy.\"<ref>{{cite book |last1=DeFalco |first1=Tom |last2=Sanderson |first2=Peter |last3=Brevoort |first3=Tom |last4=Teitelbaum |first4=Michael |last5=Wallace |first5=Daniel |last6=Darling |first6=Andrew |last7=Forbeck |first7=Matt |last8=Cowsill |first8=Alan |last9=Bray |first9=Adam |title=The Marvel Encyclopedia |date=2019 |publisher=DK Publishing |isbn=978-1-4654-7890-0 |page=270}}</ref><ref>{{Cite web |last=published |first=Michael Doran |date=2022-02-25 |title=Back from the dead, Genis-Vell returns in a new Captain Marvel series |url=https://www.gamesradar.com/genis-vell-captain-marvel/ |access-date=2022-10-26 |website=gamesradar |language=en}}</ref> He appears in various Marvel titles in 1994 and 1995, primarily Silver Surfer and the ''Cosmic Powers'' miniseries. He starred in ''Captain Marvel'' vol. 3 by writer [[Fabian Nicieza]] and artist [[Ed Benes]] with an initial publication date of Dec. 1995. The series was abruptly canceled after only six issues; the unpublished issues #7-12 were later summarised by Nicieza in a fill-in issue (#14) of the next ''Captain Marvel'' (vol. 4) series in 2000.\n\nLegacy appeared in ''[[Avengers Unplugged]]'' #5 (June 1996). After a single appearance in ''Silver Surfer'' later that year Genis-Vell would not appear for another two years, when he was included in a new [[Warlock (comics)|Warlock]] title for four issues. An appearance in the ''[[Avengers Forever]]'' miniseries led to a second ''Captain Marvel'' series featuring Genis-Vell debuting in late 1999. The series would last for 35 issues, until October 2002.\n\nIn 2002 Marvel launched the [[U-Decide]] campaign in an attempt to bolster sales on several comics. ''Captain Marvel'' was canceled, with a new series relaunched with a new debut issue, with [[Peter David]], continuing as writer, taking the book's storyline in a new direction. ''Captain Marvel'' vol. 5 was canceled with issue #25 in 2004 due to low sales.<ref>{{cite web|url=https://www.cbr.com/one-week-until-marvels-u-decide-challenge-quesada-on-the-ideas-behind-the-stunt/|title=One Week Until Marvel's 'U-Decide' Challenge: Quesada on the Ideas Behind the Stunt|last=Yarbrough|first=Beau|website=[[Comic Book Resources]]|date=September 12, 2002|access-date=June 6, 2019|archive-url=https://web.archive.org/web/20170724180935/http://www.cbr.com/one-week-until-marvels-u-decide-challenge-quesada-on-the-ideas-behind-the-stunt/|archive-date=July 24, 2017}}</ref><ref>{{cite web|url=https://www.avclub.com/with-great-power-comes-a-bizarre-lack-of-responsibility-1798284127|title=With great power comes a bizarre lack of responsibility case file #44: Marville|last=Rabin|first=Nathan|website=[[The A.V. Club]]|date=September 10, 2015|access-date=June 6, 2019|archive-url=https://web.archive.org/web/20190223185936/https://www.avclub.com/with-great-power-comes-a-bizarre-lack-of-responsibility-1798284127|archive-date=February 23, 2019}}</ref>\n\nGenis-Vell joined the [[Thunderbolts (comics)|Thunderbolts]] in issue #82 and was killed by Baron Helmut Zemo in issue #100 (May 2006).<ref>{{cite web|url=https://www.newsarama.com/28975-marvel-promises-a-long-awaited-return.html|title=Marvel Promises 'A Long Awaited Return...'|last=Marston|first=George|publisher=[[Newsarama]]|date=April 22, 2016|access-date=June 6, 2019|archive-url=https://web.archive.org/web/20160925091407/http://www.newsarama.com/28975-marvel-promises-a-long-awaited-return.html|archive-date=September 25, 2016}}</ref>\n\n==Fictional character biography==\n\n===Birth and early life===\nAfter the death of [[Captain Marvel (Mar-Vell)|Mar-Vell]] (Captain Marvel), his lover [[Elysius]] decides to have a son. As one of the [[Eternals (comics)|Eternals]] living on [[Titan (Marvel Comics location)|Titan]], she uses the advanced technology of her race to impregnate herself with some of Mar-Vell's genetic material. Elysius seeks to protect her new son, Genis-Vell, from Mar-Vell's powerful enemies by taking him to a distant planet.<ref name=\":0\">{{Cite web |last=Harn |first=Darby |date=2020-04-22 |title=The Kree: The 10 Most Powerful Members Of The Race, Ranked |url=https://www.cbr.com/marvel-the-kree-alien-race-most-powerful/ |access-date=2022-10-26 |website=CBR |language=en-US}}</ref> There, she artificially ages him and implants false memories in his brain,<ref name=\":1\">{{Cite web |last=Allan |first=Scoot |date=2019-05-30 |title=The 13 Strongest Members Of The Thunderbolts, Ranked |url=https://www.cbr.com/thunderbolts-strongest-members-ranked/ |access-date=2022-10-26 |website=CBR |language=en-US}}</ref> making him believe that he had a natural childhood and that he is the son of [[Starfox (comics)|Starfox]].<ref>''Silver Surfer'' vol. 3 Annual #6</ref><ref>{{Cite web |last=Avina |first=Anthony |date=2019-12-09 |title=5 Lesser Known Marvel Comics Heroes Who Deserve A Live-Action Debut (& 5 That Don’t) |url=https://www.cbr.com/marvel-comics-lesser-known-heroes-deserve-live-action/ |access-date=2022-10-26 |website=CBR |language=en-US}}</ref>\n\nElysius like her son was created artificially. Elysius was created by the Titan computer ISAAC which had been corrupted by [[Thanos]].\n\n===Avengers Forever (the Destiny War)===\n[[Image:Ssa6.jpg|Genis-Vell as Legacy. ''Silver Surfer'' Annual #6.<br>Cover art by [[Ron Lim]].|right|180px|thumb]]\n\nWhen the Destiny Force resurfaces in Rick Jones for a second time (the first time occurring during the [[Kree-Skrull War]]<ref>''The Avengers'' #89-97 (June 1971-March 1972)</ref>), it triggers a time-spanning conflict known as the [[Avengers Forever|Destiny War]]. A motley crew of Avengers are gathered. Among them is a future version of Genis, now known as Captain Marvel, eventually revealed to have been selected because of the role his interaction with Rick Jones would play in shaping the final outcome of the storyline. At the climax of the Destiny War and with Rick Jones' life in jeopardy, Genis recreates the Nega-Band connection with Rick in order to save him. After the war, Rick returns to the current day and the Genis of the present finds himself unwillingly bonded with Jones, a process which triggers his latent [[Cosmic Awareness]].<ref>''Avengers Forever'' #1-12 (1999)</ref>\n\n===Bonded===\nRick and Genis spend a considerable time adventuring together, in an arrangement somewhat reminiscent of the one that existed between Genis' father, [[Mar-Vell]], and Rick years before.<ref>''Captain Marvel'' #17</ref> During their time together, Mar-Vell and Rick exchanged places with each other between the regular universe and the [[Negative Zone]] and could hear each other's thoughts unaided.\n\nGenis-Vell and Rick, however, alternate between the [[Microverse]]<ref>''Captain Marvel'' vol. 4 #4</ref> and the regular [[Marvel Universe]] and can not only hear each other's thoughts unaided but can also see each other in reflective surfaces or as red ghostly visions.\n\nWhereas Mar-Vell and Rick formed a strong friendship during their time together, Genis-Vell and Rick have a much harder time getting along. Genis' alien (and immature) perspective make him unfathomable to Rick's jaded-sidekick sensibilities. Their ability to see and hear what the other is experiencing lead to awkward situations with Rick's wife, [[Marlo Chandler]], and Genis' many amorous partners. Eventually, however, they become good friends.<ref>''Captain Marvel'' vol. 4 #1-35</ref>\n\n===Insanity===\nGenis' inability to control his [[omniscience|Cosmic Awareness]] results in insanity. After a string of irrational adventures, Genis destroys the multiverse at the behest of Entropy and Epiphany. The multiverse is recreated with a [[Last Thursdayism]] effect on the universe's population, although with several alterations. No one remembers Genis' insanity, and he has an adult sister named [[Phyla-Vell]]. Although he swears to do good throughout the universe, a hallucination of Epiphany tells him that he is still insane.<ref>''Captain Marvel'' vol. 4 #1-19</ref>\n\nGenis sets up an office for his superhero activities on [[Hyperion (moon)|Hyperion]]. Phyla arrives to mock his efforts, but they are interrupted when a future version of Marlo attacks them. Genis travels through time to find out why Marlo became a villain, and hopefully prevent it. Genis learns that his son '''Ely-Vell''' (who has not yet been born in Genis' timeline) is evil and plans to use both Marlo and Genis to trigger a near-universal extinction event. Unable to overcome his son in battle, Genis defeats Ely by choosing to kill him as an infant (an event still in his future), but faced with his infant son, he instead resolves to simply not have any children. By making the decision, his adult son fades away. Genis returns to the present, suffering great anguish from his choice.<ref>''Captain Marvel'' vol. 5 #20-24</ref>\n \nGenis was separated from Rick by the cosmic entity Expediency.<ref>''Captain Marvel'' vol. 5 #25</ref>\n\n===Photon and the New Thunderbolts===\n[[Image:Thunderbolts100.png|thumb|180px|right|Genis as Photon (upper right) battling [[Baron Zemo]]. Cover to ''Thunderbolts'' #100. Art by [[Tom Grummett]].]]\nGenis travels to Earth and joins [[Abner Jenkins|MACH-IV]]'s new team of [[Thunderbolts (comics)|Thunderbolts]].<ref>''Thunderbolts'' #82</ref> During this time, he develops an interest in [[Songbird (comics)|Songbird]]. The manipulations of the [[Purple Man]] cause [[Erik Josten|Atlas]] to attack Genis in a rage, apparently killing him and throwing his body into the [[Hudson River]]. Though Genis would have recovered on his own, former Thunderbolt [[Baron Zemo#Baron Helmut Zemo|Baron Zemo]] uses a pair of alien [[Moonstone (comics)|moonstones]] to form a cocoon of energy, feeding him energy from the beginning and end of the universe to speed his recovery. When he emerges, he has absorbed the Nega-Bands into his body.<ref>''Thunderbolts'' #88</ref>\n\nGenis' subsequent adoption of the name \"Photon\" causes him to quarrel with [[Monica Rambeau]], who had also called herself \"Photon\" and \"Captain Marvel.\" In the end, Genis is allowed to use the name \"Photon\" and Monica decides to use the codename \"Pulsar\".<ref>''Thunderbolts'' #90</ref>\n\nHowever, Zemo realises that his mistake of siphoning energy from the beginning and end of time created a link between Genis and the universe that threatens to end existence. Zemo explores all future timelines with the moonstones, but fails to find a way to save both Genis and the universe: In every possible future timeline, Genis destroys the universe. Genis is aware of this, but keeps trying to tune his cosmic awareness in order to find a way to prevent this from happening. Finally, in a fight with Zemo, Genis is defeated. Zemo traps Genis in a moment in time. He then uses a combination of Blackout's [[Darkforce]] powers and the moonstones to separate Genis into individual pieces, trapping them in separate, far-off parts of the Darkforce Dimension so that they cannot be reunited.<ref>''Thunderbolts'' #99-100</ref>\n\n== Powers and abilities ==\nGenis-Vell possesses superhuman strength, durability, and speed, being able to exceed the speed of light.<ref>''All-New Official Handbook of the Marvel Universe A to Z'' #8</ref><ref>''Captain Marvel'' Vol 4 #22</ref><ref name=\":0\" /> Due to his [[Eternals (comics)|Titanian Eternal]] mother, Genis is far more powerful than his father,<ref name=\":2\">{{Cite web |last=Harn |first=Darby |date=2021-05-05 |title=15 Most Powerful Versions Of Captain Marvel From The Comics |url=https://screenrant.com/captain-marvel-most-powerful-comic-book-incarnations/ |access-date=2022-10-26 |website=ScreenRant |language=en-US}}</ref> although he still needs the Nega-Bands to make full use of his abilities. His powers were also increased further when he merged with his future self, granting him the capability to kill all the troops of the Shi'ar/Kree/Skrull coalition present in the galaxy with a mere thought, by manipulating the electric energy in their minds.\nHe is capable of manipulating, project and absorb forms of energy such as magic, electric, photonic and atomic, but the full extent of his powers is unknown.\nHis energy projection is so vast that he was able to kill a multiversal incarnate of the cosmic entity Eternity (being that encompasses all the possible universes), destroying all of creation. He was even able to help Eternity's son Entropy in restarting the multiverse.\n\nInitially, he only uses the Nega-Bands for flight, energy siphoning, energy blasts, and transportation to and from the [[Negative Zone]].<ref name=\":3\">{{Cite web |last=Karbank |first=Octavio |date=2017-10-28 |title=Mad Titanfall: 16 Marvel Cosmic Beings Scarier Than Thanos |url=https://www.cbr.com/cosmic-beings-scarier-than-thanos/ |access-date=2022-10-26 |website=CBR |language=en-US}}</ref> He is also able to augment his strength beyond 15 tons to the point where he was able to hurt the Maestro Hulk, King Hyperion or Drax the Destroyer and physically match the Sentry. After bonding with Rick, his latent multiversal [[Omniscience|Cosmic Awareness]], inherited from his father, is activated.<ref>''Avengers: Forever'' #12</ref><ref>{{Cite web |last=Blumberg |first=Arnold T. |date=2019-04-06 |title=Know Your Captain Marvel from Your Captain Mar-Vell |url=https://www.ign.com/articles/2019/04/06/know-your-captain-marvel-from-your-captain-mar-vell |access-date=2022-10-26 |website=IGN |language=en}}</ref><ref>{{Cite web |last=Lealos |first=Shawn S. |date=2018-04-12 |title=The 25 Best Superpowers Of All Time, Ranked |url=https://www.cbr.com/best-superpowers-ranked/ |access-date=2022-10-26 |website=CBR |language=en-US}}</ref> His link to another dimension is redirected from the Negative Zone to the [[Microverse]]. Genis-Vell was able to revive himself from death.<ref>''New Thunderbolts'' #6 </ref><ref name=\":2\" /> He was also able to give the Punisher insight into his future which in turn had Castle in tears, and help King Thor discover the truth about the relationship of the Asgardians and the Ice Giants, making him uncover the lies spread by Odin. It is later revealed that he can exist in the past, present and future of multiple realities at the same time, this allows him to open portals to different timelines.\n\nOriginally, he can focus his cosmic awareness, allowing him to realize exactly what he needs to know at a particular time.<ref>''Captain Marvel'' Vol 5 #1</ref><ref>''Genis-Vell: Captain Marvel'' #2</ref> When his powers grew, however, he is driven mad by the vast scope of his awareness, despite this he was an omniversal level telepath. While insane, he returns from the dead, raises Rick Jones from the dead, controls other dead bodies, creates [[hologram]]s, empowers an alien serial killer, and survives a combined assault from multiple alien spacefleets.\nHe's also shown to be able to manipulate space and time at will, as well as create rifts in space and time, summon past versions of himself and others, teleport himself and others and travel through time.\n\nAfter Zemo accidentally links him to other areas of time, Genis absorbs the Nega-Bands.\n\nDuring the time of the events of House of M, his cosmic awareness could see through the fictitious reality created by Scarlet Witch, revealing the distorted nature of that universe, and as a result Genis inadvertently collapsed and expanded all of reality for a second.\nLater, it is also revealed that Genis could bisect space, dividing everybody and everything in a range of 500&nbsp;km into what is, was and could be.\nBy his conversation with Atlas we learn that he would have been able to undo the events of House of M, but was unwilling to due to his insecurities and his fear of making the wrong choice.\n\nPhoton's fellow Thunderbolt, [[Radioactive Man (comics)|Dr. Chen Lu]], the Radioactive Man, theorises that Genis could control the photons of which everything is composed, implying large scale reality altering powers.\n\n== Reception ==\n\n=== Volumes ===\n\n==== ''Genis-Vell: Captain Marvel'' - 2022 ====\nEvan Valentine of ''[[Comicbook.com]]'' gave ''Genis-Vell: Captain Marvel'' #1 a grade of 4.5 out of 5, writing, \"Early in my comic book reading career, Peter David's Captain Marvel is a series that remained in my head for some time. David returns to the complicated relationship between Rick Jones and Genis-Vell alongside Juanan Ramirez and the new series doesn't miss a beat from the original run of this pair. Captain Marvel does a fantastic job of balancing the old school continuity with the modern events of the day, creating a fun ride for fans new and old. Even if you never got into the original series and have never read about Genis-Vell before, there's plenty here to love.\"<ref>{{Cite web |title=Comic Book Reviews for This Week: 7/27/2022 |url=https://comicbook.com/comics/news/new-comic-reviews-dc-marvel-image-july-27-2022/ |access-date=2022-10-26 |website=Comics |language=en}}</ref>\n\n=== Accolades ===\n\n* In 2017, ''[[CBR.com]]'' ranked Genis-Vell 7th in their \"16 Marvel Cosmic Beings Scarier Than Thanos\" list.<ref name=\":3\" />\n* In 2018, ''[[CBR.com]]'' ranked Genis-Vell's Captain Marvel costume 5th in their \"19 Captain Marvel Costumes\" list.<ref>{{Cite web |last=Staff |first=C. B. R. |date=2018-07-27 |title=Looking Marvelous: 19 Captain Marvel Costumes, Ranked |url=https://www.cbr.com/captain-marvel-costumes-ranked/ |access-date=2022-10-26 |website=CBR |language=en-US}}</ref>\n* In 2019, ''[[CBR.com]]'' ranked Genis-Vell 7th in their \"All The Captain Marvels\" list.<ref>{{Cite web |last=Gramuglia |first=Anthony |date=2019-01-14 |title=All The Captain Marvels, Ranked |url=https://www.cbr.com/all-the-captain-marvels-ranked/ |access-date=2022-10-26 |website=CBR |language=en-US}}</ref>\n* In 2020, ''[[CBR.com]]'' ranked Genis-Vell 6th in their \"The Kree: The 10 Most Powerful Members Of The Race\" list.<ref name=\":0\" />\n* In 2022, ''[[Screen Rant]]'' ranked Genis-Vell 8th in their \"10 Best Cosmic Heroes Not Yet In The MCU\" list<ref>{{Cite web |last=Prom |first=Bradley |date=2022-09-28 |title=10 Best Cosmic Heroes Not Yet In The MCU |url=https://screenrant.com/mcu-missing-cosmic-heroes/ |access-date=2022-10-26 |website=ScreenRant |language=en-US}}</ref> and included him in their \"15 Most Powerful Versions Of Captain Marvel From The Comics\" list,<ref name=\":2\" /> and in their \"10 Best Captain Marvel Comics Characters Not In The MCU\" list.<ref>{{Cite web |last=Harn |first=Darby |date=2022-04-24 |title=10 Best Captain Marvel Comics Characters Not In The MCU |url=https://screenrant.com/best-captain-marvel-comics-characters-not-mcu/ |access-date=2022-10-26 |website=ScreenRant |language=en-US}}</ref>\n* In 2022, ''[[CBR.com]]'' ranked Genis-Vell 2nd in their \"13 Strongest Members Of The Thunderbolts\" list.<ref name=\":1\" />\n\n==In other media==\n\n===Video games===\n* Genis-Vell appears as a [[PlayStation Portable|PSP]] exclusive character in ''[[Marvel: Ultimate Alliance]]'' voiced by [[Roger Rose]].<ref name=\"btva\">{{cite web|url=https://www.behindthevoiceactors.com/characters/Marvel-Universe/Captain-Marvel/|title=Voice Of Genis-Vell – Captain Marvel|website=Behind The Voice Actors|access-date=June 6, 2019|archive-url=https://web.archive.org/web/20190606231308/https://www.behindthevoiceactors.com/characters/Marvel-Universe/Captain-Marvel/|archive-date=June 6, 2019|postscript=. Check marks indicates role has been confirmed using screenshots of closing credits and other reliable sources}}</ref> [[Captain Marvel (Mar-Vell)|Mar-Vell]] serves as an alternate costume.\n\n===Toys===\n* [[Toy Biz]] produced two Genis-Vell variants of the [[Marvel Select]] [[Captain Marvel (Mar-Vell)|Captain Marvel]] [[action figure]], one depicting him in Kree Armor and the other in his Captain Marvel costume.\n* [[Bowen Designs]] produced a full size statue of Genis-Vell (as Captain Marvel): sculpted and designed by the Kucharek Brothers in December 2007 limited to 500 (Website Exclusive) Pieces and a mini-bust: sculpted by Randy Bowen in July 2002 limited to 3500 pieces. Prototype painted by John A Ficchi.\n* Chaos War HeroClix<ref>[http://www.heroclixworld.com/hcw/Articles.aspx?ID=407A&P=6 \"Chaos War HeroClix Spoilers\"]. HeroClix World. March 19, 2012.</ref>\n\n==Collected editions==\n{| class=\"wikitable\"\n|+\n!Title\n!Material collected\n!Published date\n!ISBN\n|-\n|''Captain Marvel: First Contact''\n|''Captain Marvel'' (vol. 4) #0-6\n|August 2001\n|{{ISBNT|978-0785107910}}\n|-\n|''Captain Marvel Vol. 1: Nothing to Lose''\n|''Captain Marvel'' (vol. 5) #1-6\n|June 2003\n|{{ISBNT|978-0785111047}}\n|-\n|''Captain Marvel Vol. 2: Coven''\n|''Captain Marvel'' (vol. 5) #7-12\n|September 2003\n|{{ISBNT|978-0785113065}}\n|-\n|''Captain Marvel Vol. 3: Crazy Like a Fox''\n|''Captain Marvel'' (vol. 5) #13-18\n|May 2004\n|{{ISBNT|978-0785113409}}\n|-\n|''Captain Marvel Vol. 4: Odyssey''\n|''Captain Marvel'' (vol. 5) #19-25\n|November 2004\n|{{ISBNT|978-0785115304}}\n|-\n|''Genis-Vell''\n|''Genis-Vell'' #1-5\n|January 2023\n|{{ISBNT|978-1302946722}}\n|}\n\n== References ==\n{{reflist}}\n\n== External links ==\n* [http://www.comicbookdb.com/character.php?ID=2928 Genis-Vell at the Comicbook Database]\n* [http://www.marveldirectory.com/individuals/c/captainmarveli.htm MarvelDirectory.com's article on his father, and Genis' unnatural conception]\n* [http://www.captainmarvelculture.com Captain Marvel Culture]\n* [https://web.archive.org/web/20081104020156/http://www.geocities.com/mailittomarvell/genis.htm Legacy/Captain Marvel/Photon (Genis-Vell) Appearances in Publication Order]\n* {{Marveldatabase}}\n\n{{Captain Marvel (Marvel Comics)}}\n{{Thunderbolts}}\n[[Category:Captain Marvel (Marvel Comics)]]\n[[Category:Comics characters introduced in 1993]]\n[[Category:Fictional characters who can manipulate reality]]\n[[Category:Fictional characters who can manipulate light]]\n[[Category:Fictional characters who can manipulate time]]\n[[Category:Fictional characters with absorption or parasitic abilities]]\n[[Category:Fictional characters with energy-manipulation abilities]]\n[[Category:Fictional characters with precognition]]\n[[Category:Marvel Comics aliens]]\n[[Category:Marvel Comics characters who can move at superhuman speeds]]\n[[Category:Marvel Comics characters who can teleport]]\n[[Category:Marvel Comics characters with superhuman strength]]\n[[Category:Marvel Comics extraterrestrial superheroes]]\n[[Category:Marvel Comics hybrids]]\n[[Category:Marvel Comics telepaths]]\n[[Category:Kree]]\n[[Category:Eternals (comics)]]\n[[Category:Characters created by Ron Marz]]\n[[Category:Characters created by Ron Lim]]\n[[Category:Marvel Comics supervillains]]"}]}}}}