{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes. Use [[Special:ApiFeatureUsage]] to see usage of deprecated features by your application."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"normalized": [{"from": "Ghost_Rider_2099", "to": "Ghost Rider 2099"}], "pages": {"5395870": {"pageid": 5395870, "ns": 0, "title": "Ghost Rider 2099", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Infobox comic book title <!--Wikipedia:WikiProject Comics-->\n<!-- | title = Ghost Rider 2099 -->\n| image = Ghost Rider 2099 2 cover.jpg\n| caption = Cover to ''Ghost Rider 2099'' #2 (June 1994).<br>Art by [[Mark Buckingham (comic book artist)|Mark Buckingham]].\n| schedule = Monthly\n| format = \n| ongoing = y\n| publisher = [[Marvel Comics]]\n| date = May [[1994 in comics|1994]] – May [[1996 in comics|1996]]\n| issues = 25\n| main_char_team = Kenshiro \"Zero\" Cochrane\n| writers = [[Len Kaminski]]\n| artists = [[Chris Bachalo]]<br>[[Mark Buckingham (comic book artist)|Mark Buckingham]]<br>[[Ashley Wood]]<br>[[Kyle Hotz]]\n| pencillers = \n| inkers = [[Jim Daly (comics)|Jim Daly]]\n| colorists = \n| letterers = [[John Roshell]]\n| creative_team_month = \n| creative_team_year = \n| creators = \n| subcat = Marvel 2099\n| sort = Ghost Rider 2099\n}}\n'''''Ghost Rider 2099''''' is a [[comic book]] [[ongoing series|series]] that was published by [[Marvel Comics]], under the [[Marvel 2099]] imprint, from [[1994 in comics|1994]] to [[1996 in comics|1996]].\n\nThe series is set in the year 2099, in a [[dystopia]]n possible future of the [[Marvel Universe]], and features '''Kenshiro \"Zero\" Cochrane''', a hacker who was killed but resurrected as the '''[[Ghost Rider]]''' — his mind controlling a powerful and well-armed robot. As with most of the Marvel 2099 titles, the protagonist was a futuristic version of a commercially successful [[Marvel Universe]] character. The series was heavily influenced by [[cyberpunk]] science fiction.{{Citation needed|date=October 2011}}\n\n==Publication history==\nThe ''Ghost Rider 2099'' series was not one of the initial titles launched for the 2099 imprint and contained few direct crossovers with the other titles. The series ran for 25 issues, ending in May 1996. The title character's story was concluded in the final issue, but Zero Cochrane did reappear as an important character in the final 2099 story in the [[One-shot (comics)|one-shot]] ''[[2099: Manifest Destiny]]''.\n\n==Fictional character biography==\nHacker Kenshiro \"Zero\" Cochrane was shot and facing death in Transverse City after being hunted down for stealing information from the D/Monix corporation. As the poison from a [[flechette]] coursed through his body, Zero downloaded his mind into [[cyberspace]], thus blocking access to the knowledge he had stolen from his enemies.<ref name=\"issue1\">''Ghost Rider 2099'' #1 (May 1994)</ref>\n\nCochrane's mind is discovered by the artificial intelligence dwelling in a hidden section of cyberspace known as the Ghostworks. The Ghostworks ask Zero to be their avatar in the real world, feeling his brash and rebellious attitude will make him the ideal candidate. Cochrane accepts and is downloaded into a robotic Cybertek 101 body. Due to his similarity to the 20th-century superhero, the robot becomes known as the Ghost Rider.<ref name=\"issue1\"/>\n\nThe Ghost Rider proceeds to avenge his own death and struggles against the plans of the D/Monix corporation,{{issue|date=September 2013}} which leads to a confrontation with Zero's father, Harrison Cochrane.{{issue|date=September 2013}} A loyal corporate servant, Harrison indirectly (but intentionally) caused his son's death.{{issue|date=September 2013}}\n\nZero eventually evolves to become the entirety of humanity's communications network.<ref>''2099: Manifest Destiny'' 1998</ref>\n\n===Unresolved plotlines===\n{{original research inline|date=September 2013}}\n* The series ends with the artificial intelligence L-Cypher free and undetected. Although his enemies believe that he has been destroyed, L-Cypher has been downloaded into a stolen human body and is planning his revenge.\n* Heartbreaker's origin is never revealed.\n* The Ghost Rider plays no part in the subsequent ''[[2099: World of Tomorrow]]'' series, although the last scene of the final issue does show a D/MONIX diver exploring the flooded ruins of Transverse City, recovering what he apparently believes to be an inert Ghost Rider. The Ghost Rider itself is not pictured, however.<ref>''2099: World of Tomorrow'' #8 (April 1997)</ref> ''2099: World of Tomorrow'' was the final Marvel 2099 series and was canceled abruptly, leaving this plotline unresolved and unexplained.\n* At least one issue of the series was unpublished.{{citation needed|date=September 2013}} Titled \"Daddy Dearest\", the issue was written by [[Scott Andrews (author)|Scott Andrews]] and penciled by [[Max Douglas]]. After the 2099 line was canceled, there was no prospect of the issue ever being published. Scott put the final lettered black-and-white version up on his website as part of his portfolio.{{citation needed|date=September 2013}}\n\n==Other versions==\n\nZero Cochrane helps the Wolverine of the modern age explore and travel through a new and different world of 2099 in order to gain the knowledge of both time periods to keep them from merging into each other. As part of this, Zero confronts and fights [[Doctor Doom]], Spider-Man, [[Cerebra]] and the [[Iron Patriot]].<ref>''Timestorm'' #1-4 2009-2099 (June–October 2009)</ref>\n\nDuring Secret Wars event (2015), Zero Cochrane appears in Ghost Racers mini-series.\n\n==Powers, abilities, and equipment==\nGhost Rider 2099 is a Cybertek 101 robot. The reinforced carbon-steel silicon composite robotic body gave Ghost Rider superhuman strength, endurance, and durability. Both hands were capable of transforming, the right hand into a ceramic graphite composite bladed chainsaw that blasted bursts of energy; and the left hand into a polymimetic nanometer alloy claw, able to cut on a submolecular level. The robot also possessed a stealth system rendering Ghost Rider invisible to detection by both electronic systems and the naked eye; in addition, it possesses a \"solid gram\" camouflage system that could allow him to mimic the appearance of any individual (including Zero Cochrane), and create the illusion of his head being engulfed in flames. The robot also had optic lasers and was capable of self-repairing.\n\nDuring the series, the robot body needs to be recharged on a relatively regular basis, especially after draining power to operate its weapons systems (in several stories this is used as a dramatic device, with the Ghost Rider struggling against a foe when his power supply is almost exhausted). However, in the final issue, this becomes less of a problem, as Zero obtains a \"Mr. Fusion\" portable power generator. The same scene explains that the Ghostworks had previously blocked the Ghost Rider from thinking of this solution, as they did not wish to risk him becoming too independent.\n\nZero is an expert computer hacker and cybersurfer, able to force his way both in and out of almost any system. As a digital psyche, Zero could surf cyberspace, access information, and exist without food, water or other sustenance.\n\nGhost Rider rode a modified version of Zero Cochrane's original souped-up motorcycle,<ref name=\"issue1\"/> a Ford Velociraptor 900 with thrusters and anti-gravity propulsion.\n\n==Supporting cast==\n* Kylie Gagarin – Zero Cochrane's girlfriend.\n* Willis Adams – A journalist working for Mainline Media.\n* Anesthesia Jones – Owner of the Bar Code.\n* The Ghostworks – Initially used as a name for the hidden region of cyberspace where the Ghost Rider's creators dwell, later in the series the artificial intelligences themselves are also referred to as the Ghostworks.\n* Doctor Neon (Jimmy Alhazared)\n* Harrison Cochrane\n\n===Villains and antagonists===\n* Coda\n* D/MONIX\n* Dyson Kellerman\n* Heartbreaker\n* Jeter\n* Kabal\n* Harrison Cochrane\n* L-Cypher\n* Vengeance 2099\n* Warewolf\n\n==In other media==\n\n===Video games===\n*Ghost Rider 2099 appears as an alternate costume in the ''[[Ghost Rider (video game)|Ghost Rider]]'' movie tie-in video game.\n*Ghost Rider 2099 appears as an alternate costume for Ghost Rider in ''[[Ultimate Marvel vs Capcom 3]]''.\n*Ghost Rider 2099 appears as a playable character in ''[[Marvel Avengers Academy]]'', voiced by Nicholas Andrew Louie.<ref>{{cite web|url=http://nicholasandrewlouie.com/character-samples/|title=CHARACTER GALLERY — Nicholas Andrew Louie|website=nicholasandrewlouie.com|access-date=February 25, 2018|archive-url=https://web.archive.org/web/20180226211715/https://www.nicholasandrewlouie.com/character-samples/|archive-date=February 26, 2018|url-status=dead}}</ref>\n\n==References==\n{{Reflist}}\n\n==External links==\n*[http://www.salgoodsam.com/comics/ghost-rider-2099-daddy-dearest-unpublished/ \"Daddy Dearest\"] The unpublished Ghost Rider 2099 story\n*[https://web.archive.org/web/20101109035708/http://www.comichron.com/titlespotlights/Ghostrider2099.html Ghost Rider 2099 sales figures for 1994 and 1995] at the Comics Chronicles\n\n{{Ghost Rider}}\n\n[[Category:1994 comics debuts]]\n[[Category:Fictional hackers]]\n[[Category:Marvel 2099 characters]]\n[[Category:Marvel Comics robots]]\n[[Category:Ghost Rider]]\n[[Category:Marvel Comics characters with superhuman strength]]\n[[Category:Marvel Comics superheroes]]\n[[Category:Cyberpunk comics]]\n[[Category:Defunct American comics]]\n[[Category:Virtual reality in fiction]]"}]}}}}