{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes. Use [[Special:ApiFeatureUsage]] to see usage of deprecated features by your application."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"normalized": [{"from": "Glorious_Godfrey", "to": "Glorious Godfrey"}], "pages": {"2157851": {"pageid": 2157851, "ns": 0, "title": "Glorious Godfrey", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Infobox comics character<!--Wikipedia:WikiProject Comics-->\n|image=gloriousgodfreydcu0.jpg\n|image_size=225\n|caption=Glorious Godfrey from ''The Forever People'' #7, artist [[Jack Kirby]].\n|character_name=Glorious Godfrey\n|publisher=[[DC Comics]]\n|debut=''The Forever People'' #3 (June 1971)\n|creators=[[Jack Kirby]] (writer and artist)\n|real_name=Glorious Gordon Godfrey\n|species = [[New Gods|New God]]\n|homeworld = [[Apokolips]]\n|alliances=[[Darkseid's Elite]]<br/>[[Galaxy Communications (comics)|Galaxy Communications]]\n|aliases=G. Gordon Godfrey, Reverend G. Godfrey Goode, Godfrey\n|supports =<!--optional-->\n|powers=\n* Immortality\n* Superhuman physical attributes\n* Limited mind-control\n* Commands the Army called The Justifiers\n|}}\n'''Glorious Godfrey''' is a [[DC Comics]] [[supervillain]] who is part of [[Fourth World (comics)|The Fourth World]] series of [[comic books]] in the early 1970s.<ref>{{cite book |last1=Greenberger |first1=Robert |last2=Pasko |first2=Martin |title=The Essential Superman Encyclopedia |date=2010 |publisher=Del Rey |isbn=978-0-345-50108-0 |page=107}}</ref>\n\n==Publication history==\nGlorious Godfrey first appeared in ''The [[Forever People]]'' #3 (June 1971) and was created by [[Jack Kirby]].<ref name=\"dc-ency\">{{Citation | last = Wallace | first = Dan | contribution = Glorious Godfrey | editor-last = Dougall | editor-first = Alastair | title = The DC Comics Encyclopedia | pages = 138 | publisher = [[Dorling Kindersley]] | place = New York | year = 2008 | isbn = 978-0-7566-4119-1 | oclc = 213309017}}</ref>\n\nIn 1971, an article in ''[[The New York Times Magazine]]'' about \"relevant comics\" described \"a handsome toothy character named Glorious Godfrey, a revivalist. Godfrey is drawn to look like an actor playing [[Billy Graham]] in a Hollywood film biography of [[Richard Nixon]] starring [[George Hamilton (actor)|George Hamilton]]\".<ref>{{cite news |last1=Braun |first1=Saul |title=Shazam! Here Comes Captain Relevant |url=https://timesmachine.nytimes.com/timesmachine/1971/05/02/170499242.html?pageNumber=424 |access-date=30 March 2020 |work=[[The New York Times Magazine]] |date=May 2, 1971 |page=55}}</ref> The character was intended to embody the powerful, charismatic speaker who could talk people into justifying violence and evil.<ref>{{cite book |last1=Sacks |first1=Jason |last2=Dallas |first2=Keith |title=American Comic Book Chronicles: The 1970s |date=2014 |publisher=TwoMorrows Publishing |isbn=978-1605490564 |page=40}}</ref>\n\n==Fictional character biography==\nGodfrey has a sister named [[Amazing Grace (comics)|Amazing Grace]] who is also a member of [[Darkseid]]'s Elite. The siblings have similar powers. Whereas Amazing Grace's specialty is manipulation, Godfrey's is persuasion.<ref name=Guide>{{cite book |last1=Cowsill |first1=Alan |last2=Irvine |first2=Alex |last3=Korte |first3=Steve |last4=Manning |first4=Matt |last5=Wiacek |first5=Win |last6=Wilson |first6=Sven |title=The DC Comics Encyclopedia: The Definitive Guide to the Characters of the DC Universe |date=2016 |publisher=DK Publishing |isbn=978-1-4654-5357-0 |page=120}}</ref>\n\nIn his first appearance he confronts the [[Forever People]], who had stumbled upon a recruitment program for Earth-based warriors for Darkseid. He personally leads an attack of Justifiers that almost kills the young warrior Serafin. Despite the efforts of the Forever People's semi-sentient Super-Cycle, Godfrey's attack would have succeeded in killing Serafin; however, Highfather chose at that moment to recall all his people (and the cycle) home via teleportation.<ref>''The Forever People'' #6-7 (February-March 1972)</ref>\n\nGodfrey remained a relatively unimportant character until 1986 (he had a total of three appearances over a decade and a half), when ''[[Legends (comics)|Legends]]'' (the first crossover since the ''[[Crisis on Infinite Earths]]'') was published. In it, [[Darkseid]] attempts to deprive the world of its heroes, not only so that they would be ineffective against Darkseid, but also in the hopes that the people of Earth would more willingly surrender to his rule.\n\n[[Image:GloriousGodfrey.png|thumb|left|150px|G. Gordon Godfrey, artist [[John Byrne (comics)|John Byrne]].]]\nThe first phase of the plan consists simply of creating immense amounts of collateral damage by sending creatures to Earth to fight the [[superhero]]es. The public begins to resent the heroes in their midst, and therefore Darkseid starts the second phase of his plan by sending the master manipulator Glorious Godfrey to Earth.\n\nAssuming the identity of G. Gordon Godfrey (a reference to [[G. Gordon Liddy]]), he starts a hate campaign against the superheroes that proves to be very effective, riling the public and ultimately leading to a presidential decision to outlaw any super-heroic activity. The final phase of the plan consists of the Apokoliptian warhounds, cybernetic creatures that are bonded to human hosts, for which Godfrey is able to find an ample number of 'volunteers' among his hypnotized public. He leads his charges to Washington D.C., only to be confronted by a cadre of assembled heroes.<ref name=\"dc-ency\"/>\n\nThe heroes are able to defeat the Warhounds and separate them from their human hosts, with Godfrey jeopardising his image when he strikes a little girl who had been standing between the heroes and Godfrey's group of adults. After his initial weak attempt to justify his attack fails, Godfrey makes one last ploy by putting on the helmet of [[Doctor Fate]] in the hopes of obtaining his awesome might. Instead, the helmet [[mindwipe]]s Godfrey, leaving him nothing more than an empty shell. He is sent to Belle Reve sanitarium, which he would later be broken out of by the [[Female Furies]] under the order of Darkseid.\n\nGodfrey has subsequently made brief appearances among assemblages of all the Apokoliptian Gods.\n\n===''Final Crisis''===\nIn ''Final Crisis'' #1, Reverend Godfrey Good appears on a TV news report, decrying the situation in [[Blüdhaven]] and the lack of government aid and assistance in dealing with the crisis in the ruined city.<ref>''Final Crisis'' #1</ref> In between ''Final Crisis'' #1 and #2, Good is captured and transformed into a host for the essence of Glorious Godfrey. Godfrey taunts Dan Turpin and Batman, as Batman is imprisoned and Turpin transformed into the final host body for Darkseid.\n\nIn ''Final Crisis'' #4, Godfrey is present when Darkseid takes control over Turpin's body. However, in ''Final Crisis'' #5, Darkseid responds to his minion's impending death (presumably due to the fact that Godfrey's host body was not modified to successfully contain Godfrey's dark essence) by watching them die in front of him.<ref>''Final Crisis'' #5 (2008)</ref>\n\nA one-shot revealed that Godfrey had been chosen by Darkseid to be the secretive, personal assistant to the Earth-based villain [[Libra (DC Comics)|Libra]]. The man is given generic technology to support him throughout the years because Darkseid believed the man had potential for greatness. Godfrey's assistance turns out to be invaluable, as Libra is the key to Darkseid's defeat of Earth.<ref>''Final Crisis: Secret Files and Origins'' (December 2008)</ref>\n\n===''The New 52''===\nIn ''[[The New 52]]'' (a 2011 reboot of the DC Comics universe), Glorious Godfrey makes his first appearance by giving greetings to Batman and [[Ra's al Ghul]] from Apokolips. He has a new look, sporting a beard and an all-black uniform with red gloves and belt.<ref>''Batman and Ra's al Ghul'' #32 (2014)</ref> Glorious Godfrey's reason for coming to Earth is to retrieve the Chaos Shard, a powerful crystal which once belonged to Darkseid which Ra's al Ghul revealed was hidden inside the sarcophagus he crafted for Damian. After detecting a trace signature of the shard coming from inside Damian's body, and despite the assistance of the Justice League, Glorious Godfrey escapes with the corpse back to Apokolips, with Batman vowing to get Damian Wayne's corpse back.<ref>''Batman and Ra's al Ghul'' #33 (2014)</ref>\n\n==Powers and abilities==\nGlorious Godfrey retains several attributes of a native of Apokolips, such as a limited level of superhuman strength, endurance and invulnerability. In addition, Godfrey has extended lifespan which allows him to exist indefinitely and he has an advanced immune system. However, Glorious Godfrey is a sub-par athlete and hand-to-hand combatant, whose greatest gifts are his overwhelming speaking voice and his extraordinary powers of persuasion. Whether these are natural gifts or have been augmented by the power of Darkseid has yet to be determined. Godfrey employs a private army called the Justifiers, composed of Earthmen who believe Godfrey's rhetoric and have had their perceptions completely contorted by Godfrey's words. The special helmets worn by the Justifiers allow Glorious Godfrey to control his soldiers even when they are not in his presence.\n\n==Inspiration==\nJack Kirby biographer [[Mark Evanier]] states that Glorious Godfrey was based on evangelist [[Billy Graham]]:\n\"A lesser villain who toiled in the service of Darkseid was inspired more directly by evangelist Billy Graham, who was then rather difficult to avoid on TV. Kirby was appalled at some of Graham's apocalyptic sermons which — to Jack — were more calculated to instill fear than faith, and to stampede people into service of Graham's causes. Jack called the foe Glorious Godfrey, the name being a Kirbyesque pun. The comic book evangelist was \"god-free\" and also had some of the traits of TV pitchman Arthur Godfrey, though the main reference and the visual came from Billy Graham. Not evident in on the pages he drew was Jack's belief — which he expressed on several occasions — that Graham and the president he counseled were both virulent anti-Semites\".<ref>{{Cite news|url=https://www.newsfromme.com/2002/03/07/master-villains/|title=Master Villains - News From ME|date=2002-03-07|work=News From ME|access-date=2018-02-22|language=en-US}}</ref>\n\n==In other media==\n===Television===\n* \"Glorious\" G. Gordon Godfrey appears in the ''[[Justice League (animated series)|Justice League]]'' two-part episode \"Eclipsed\", voiced by [[Enrico Colantoni]]. This version is the blonde host of a [[sensationalist]] talk show that he uses to attack the [[Justice League]]'s credibility with hypocritical questions and unrelated topics. After the Justice League foil [[Eclipso]]'s plot to destroy the sun, Godfrey's sponsors drop him while his network moves his show to four o'clock in the morning.\n* Gordon Godfrey appears in the [[Smallville (season 10)|tenth season]] of ''[[Smallville]]'', portrayed by [[Michael Daingerfield]]. This version is a human [[shock jock]] who attacks vigilantes, superheroes, and illegal aliens. After being possessed by [[Darkseid]], he writes a best-selling anti-heroes book in the hopes of sowing mistrust and doubt through Earth's people's hearts and make them lose faith in their heroes. [[Lois Lane (Smallville)|Lois Lane]] tries to expose Godfrey and Darkseid, but the latter fully takes over the former's body and tortures her to lure [[Clark Kent (Smallville)|Clark Kent]] to him. Darkseid later meets with [[Granny Goodness]], [[Desaad]], and a brainwashed [[Oliver Queen (Smallville)|Oliver Queen]] to formulate a plan to remove Kent's powers with a Gold [[Kryptonite]] wedding ring. However, [[Chloe Sullivan]] rescues Kent, who in turn frees Queen from Darkseid's control. Queen eventually confronts and kills Godfrey, Goodness, and Desaad.\n* G. Gordon Godfrey appears in ''[[Young Justice (TV series)|Young Justice]]'', voiced by [[Tim Curry]]<ref>{{cite web|url=http://www.ksitetv.com/young-justice/young-justice-interview-greg-weisman-brandon-vietti-talk-saturdays-season-premiere/13884|title=Young Justice Interview: Greg Weisman & Brandon Vietti Talk Saturday's Season Premiere - KSiteTV|author=Craig Byrne, Editor-In-Chief|work=ksitetv.com|date=26 April 2012 }}</ref> in season two and by [[James Arnold Taylor]] in [[Young Justice: Outsiders|season three]]. This version is an associate of Darkseid's who operates as a news show host with a xenophobic and anti-alien agenda. Throughout season two, he sows fears about the Justice League's alien members and use of alien technology, gradually gaining followers in the process. After the [[Reach (comics)|Reach]] arrive on Earth with an apparent desire for peace, Godfrey showers them with praise until they are forced to reveal their hidden armada. In season three, he criticizes [[Granny Goodness|Gretchen Goode]]'s VR Goggles and her efforts to stop metahuman trafficking and clashes with [[Lex Luthor]] over who can slander the [[Outsiders (comics)|Outsiders]] more effectively.\n\n===Film===\nG. Gordon Godfrey appears in ''[[Reign of the Supermen (film)|Reign of the Supermen]]'', voiced by [[Trevor Devall]]. This version is an editorialist who wrote an article on how Earth's people need to be their own heroes instead of relying on metahumans.\n\n==External links==\n* [http://www.dcuguide.com/who.php?name=gloriousgodfrey Glorious Godfrey] {{Webarchive|url=https://web.archive.org/web/20100202181027/http://dcuguide.com/who.php?name=gloriousgodfrey |date=2010-02-02}} at the Guide to the DC Universe\n\n==References==\n{{reflist}}\n\n{{New Gods}}\n{{Jack Kirby}}\n\n[[Category:Characters created by Jack Kirby]]\n[[Category:Comics characters introduced in 1971]]\n[[Category:New Gods of Apokolips]]\n[[Category:Fictional television personalities]]\n[[Category:Fictional radio personalities]]\n[[Category:Fictional writers]]\n[[Category:DC Comics aliens]]\n[[Category:DC Comics characters with superhuman strength]]\n[[Category:DC Comics deities]]\n[[Category:DC Comics demons]]\n[[Category:DC Comics characters who have mental powers]]"}]}}}}