{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes. Use [[Special:ApiFeatureUsage]] to see usage of deprecated features by your application."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"normalized": [{"from": "Gregory_Herd", "to": "Gregory Herd"}], "pages": {"3087896": {"pageid": 3087896, "ns": 0, "title": "Gregory Herd", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Infobox comics character <!--Wikipedia:WikiProject Comics-->\n|image= Gregory Herd Shadrac.JPG\n|imagesize= 150\n|caption= Gregory Herd as Shadrac. Art by [[John Romita, Jr.]]\n|character_name=Gregory Herd\n|real_name=Gregory Herd\n|publisher=[[Marvel Comics]]\n|debut=''[[The Spectacular Scarlet Spider]]'' #1 (November, 1995)<br>\n''[[The Amazing Spider-Man]]'' vol. 2 #2 (as Shadrac)\n|creators=[[Todd Dezago]], [[Sal Buscema]], [[Jimmy Palmiotti]]\n|alliances= \n|aliases=Override, Shadrac\n|powers= '''(As Override)'''<br>Cybernetically enhanced costume grants:<br>Ability to remotely control or override any and all electronic devices<br>'''(As Shadrac)'''<br>Mystical burning flames<br>Ability to override emotions \n}}\n\n'''Dr. Gregory Herd''' is a [[fictional character]], a [[supervillain]] appearing in [[American comic book]]s published by [[Marvel Comics]]. His [[first appearance]] was in ''[[The Spectacular Scarlet Spider]]'' #1. He originally operated as the villain '''Override''' and worked with his wife, who operated as Aura. He becomes the fiery villain '''Shadrac''' in ''[[The Amazing Spider-Man]]'' vol. 2 #2.\n\n==Fictional character biography==\nTogether with his wife (who operated under the name Aura), Dr. Gregory Herd worked as a mercenary for hire as Override. During the \"Spider-Hunt\" storyline, in which a massive bounty is placed on Spider-Man's head, Herd's wife is gravely injured and left in medical care.<ref>''[[The Sensational Spider-Man]]'' #25</ref> To cover her steadily mounting medical expenses, Override goes to work as one of [[Norman Osborn]]'s costumed employees.<ref>''The Spectacular Spider-Man'' #255</ref>\n\n[[Image:OverrideMarvel.jpg|left|Gregory Herd as Override and wife Annie as Aura.|thumb]]\n\nDesperate for some way to save his wife, Herd asks to join Osborn's \"[[The Gathering of Five and The Final Chapter|Gathering of Five]]\" ceremony in order to gain one of five \"gifts\".<ref>''The Sensational Spider-Man'' #32</ref> However, Herd is the recipient of death, which gives Herd new powers while steadily destroying him over time. He falls under the thumb of a man named Dolman, who owned one of the five artifacts used in the Gathering ceremony before it was stolen by Osborn. Dolman intends to use Herd as a tool to regain what Osborn had stolen. Herd assaults Osborn Industries but runs into the current [[Spider-Man]], [[Spider-Woman (Mattie Franklin)|Mattie Franklin]].<ref>''The Amazing Spider-Man'' vol. 2 #2 (Feb. 1999)</ref> Herd dismisses Franklin with little effort but is later forced to battle the original Spider-Man and [[Iceman (comics)|Iceman]] while trying to tell officials that Dolman was tampering with his mind. He convinces Iceman to freeze him entirely in an attempt to stay alive.<ref>''The Amazing Spider-Man'' vol. 2 #3 (Mar. 1999)</ref>\n\nThough temporarily frozen, Shadrac is still dying albeit in a less painful manner. Later pursuing Dolman, Shadrac, Iceman, and Spider-Man team up to capture him. After Dolman merges with the Spindle and gains powers, Shadrac \"overrides\" him and possesses his body in a last-ditch effort to stop Dolman and save himself.<ref>''Peter Parker: Spider-Man'' vol. 2 #3 (April 1999)</ref>\n\n===Civil War===\nSomehow separated from both Shadrac and Dolman, with Aura restored to human form, and back in his original costume, Herd joins [[Hammerhead (comics)|Hammerhead]]'s \"villain army\" that was captured by [[Iron Man]] and [[S.H.I.E.L.D.]] agents.<ref>''Civil War: War Crimes'' (Feb. 2007)</ref>\n\n==Powers and abilities==\n\n===As Override===\nDr. Gregory Herd wore a cybernetically enhanced costume that allowed him to control, or \"override\", any other electronic device (including but by no means limited to Spider-Man's web-shooters).\n\n===As Shadrac===\nDue to the Gathering of the Five ceremony, Herd has internalized the powers of his cybernetic suit as well as gaining the ability to override emotions. In addition, his entire body is constantly wreathed in mystical flames which, in addition to slowly killing him, he can manipulate in the form of blasts from his hands or an aura he can expand at will. While the maximum temperature of these flames is unknown, Shadrac can melt metal with a touch.\n\n==Other versions==\n\n===MC2===\nIn the [[Marvel Comics 2|MC2]] universe Gregory Herd is shown as a participant in The Gathering of Five, which was interrupted in this continuity.<ref>''Spider-Girl #49''</ref> A prior story revealed that Mattie Franklin and [[Madame Web]] eventually gained the gifts (power and immortality) they had in the mainstream continuity,<ref>''Spider-Girl'' #39</ref> but what became of Herd after the first attempt was not shown.\n\n==References==\n{{reflist|2}}\n\n==External links==\n*{{comicbookdb|type=character|id=18939|title=\"Override (Marvel)\"}}\n\n{{DEFAULTSORT:Herd, Gregory}}\n[[Category:Characters created by Todd DeZago]]\n[[Category:Characters created by Sal Buscema]]\n[[Category:Comics characters introduced in 1995]]\n[[Category:Marvel Comics supervillains]]\n[[Category:Spider-Man characters]]"}]}}}}