{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes. Use [[Special:ApiFeatureUsage]] to see usage of deprecated features by your application."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"normalized": [{"from": "Grog_(Marvel_Comics)", "to": "Grog (Marvel Comics)"}], "pages": {"7926644": {"pageid": 7926644, "ns": 0, "title": "Grog (Marvel Comics)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Infobox comics character <!--Wikipedia:WikiProject Comics--> \n|image=Grog (Earth-616) from Official Handbook of the Marvel Universe Vol 3 3 0001.jpg\n|caption=\n|character_name=Grog\n|real_name=\n|species=\n|publisher=[[Marvel Comics]]\n|debut=''[[Thor (Marvel Comics)|Thor]]'' #390 (April 1988)\n|creators=[[Tom DeFalco]] and [[Ron Frenz]]\n|alliances=\n|partners=[[Seth (Marvel Comics)|Seth]]\n|aliases=The God-Slayer, Grog the God-Crusher\n|powers=\n}}\n\n'''Grog the God-Slayer''' is a fictional character appearing in [[American comic book]]s published by [[Marvel Comics]]. The character is depicted as a member of the [[Heliopolis (comics)|Heliopolitan]] race of gods.\n\n==Publication history==\nGrog first appeared in ''[[Thor (Marvel Comics)|Thor]]'' #390 (April 1988), and was created by [[Tom DeFalco]] and [[Ron Frenz]].\n\nThe character subsequently appears in ''Thor'' #396-400 (Oct. 1988-Feb. 1989). His final appearance was in ''Thor'' vol. 3 Annual #1 (1990).\n\nGrog the God-Slayer received an entry in the ''[[Official Handbook of the Marvel Universe|Official Handbook of the Marvel Universe Update '89]]'' #3.\n\n==Fictional character biography==\nA loyal follower of the Egyptian God of death, [[Seth (Marvel Comics)|Seth]], Grog led his armies to assassinate the [[Asgard (comics)|Asgardian]] God of Thunder, [[Thor (Marvel Comics)|Thor]] after his return to Earth. On the [[Avengers (comics)|Avengers]]' floating headquarters called [[Hydro-Base]], Grog, and a horde of soldiers, made their first strike. Thor was aided by his comrades, the [[Captain America|Captain]] and the [[Black Knight (Dane Whitman)|Black Knight]], and the three of them managed to defeat Grog and all of Seth's men. Grog was carted off to the [[Vault (Marvel Comics)|Vault]] by the Black Knight, but he would soon be free again.{{Issue|date=April 2010}}\n\nAfter a second attempt, by Seth, to take the life of Thor by creating a group of super humans called [[Earth Force (Marvel Comics)|Earth Force]], Thor went to the Vault to question Grog of his master's whereabouts.{{Issue|date=April 2010}}\nNot alone, Thor traveled with fellow [[Asgardians (Marvel Universe)|Asgardian]] [[Hogun]], the Grim, the Black Knight, and the reformed Earth Force, but Grog was not intimidated by the forces that massed against him. Once freed from his shackles, Grog summoned a portal back to the territory of Seth and escaped his foes. Thor had planned on Grog's escape in order to follow him into the realm of death so he could face the Death god, but Grog had been ready for Thor and his allies by having a welcoming party ready to greet his enemies once they were through the portal. The heroes fought valiantly, but were ultimately overwhelmed by Seth's troops. Thor, too, fell before his enemies when [[Balder (comics)|Balder]], the Brave, summoned Thor's powers back to Asgard to help defend the Golden City against another wave of Seth's unrelenting attack. Grog reveled in his triumph over the Thunder god.{{Issue|date=April 2010}}\n\nThe victory was short-lived, however, because with the seeming death of Balder came the return of Thor's powers. Thor wasted no time in dispatching his foe and damaging the stronghold of Seth, the Black Pyramid. Grog, now bound and at the mercy of his captors, knew the fortress better than his enemies and got away using a secret door in the pyramid's corridors. However, he soon returned with reinforcements to crush Thor once and for all. His strategy did not go as planned for the combined might of the Asgardians, Earth Force, the Black Knight, and the other Egyptian gods proved to be too much for Grog and his men. Unwilling to admit defeat, Grog resurfaced for the final time as [[Surtur (Marvel Comics)|Surtur]], the fire demon, battled Thor. He shouted boasts of his recovery and his opponents’ inevitable defeat, but it was he who met his demise when Surtur used the remains of the Black Pyramid as a weapon against the mighty Thor. Throwing the citadel at Thor, the Black Pyramid was destroyed by Thor's mallet, [[Mjolnir (comics)|Mjolnir]], leaving Grog and his remaining forces to be crushed inside.{{Issue|date=April 2010}}\n\nGrog was later sent to Earth by Seth with Gog, Magog and Scarab to hunt down an emotionally battered Thor, who just killed his grandfather [[Borr]]. The villains were supposed to report the location of Thor, but Grog thought he could take advantage of the weakened Thor. Thor was able to defeat Grog and as punishment Seth severed Grog's hand.<ref>''Thor'' vol. 3 Annual #1</ref>\n\n==References==\n{{reflist}}\n\n==External links==\n* [http://www.marvel.com/universe/Grog Grog] at the Marvel Comics wiki\n\n[[Category:Characters created by Ron Frenz]]\n[[Category:Characters created by Tom DeFalco]]\n[[Category:Comics characters introduced in 1988]]\n[[Category:Marvel Comics deities]]\n[[Category:Marvel Comics supervillains]]\n[[Category:Mythology in Marvel Comics]]"}]}}}}