{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes. Use [[Special:ApiFeatureUsage]] to see usage of deprecated features by your application."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"normalized": [{"from": "Hauptmann_Deutschland", "to": "Hauptmann Deutschland"}], "pages": {"4030912": {"pageid": 4030912, "ns": 0, "title": "Hauptmann Deutschland", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{multiple issues|\n{{more citations needed|article about a fictional comic book character|date=June 2018}}\n{{notability|date=June 2018}}\n}}\n{{Infobox comics character <!--Wikipedia:WikiProject Comics-->\n| image = Hauptmann Deutschland.jpg\n| caption = \n| character_name = Hauptmann Deutschland\n| real_name = Markus Ettlinger\n| publisher = [[Marvel comics]]\n| debut = ''[[Captain America (comic book)|Captain America]]'' #387\n| creators = [[Mark Gruenwald]]<br/>[[Rik Levins]]\n| status = \n| alliances = [[Schutz Heiliggruppe]]\n| previous_alliances = \n| aliases = Vormund, Captain Germany, Guardian\n| relatives = \n| powers = Ability to absorb and redirect kinetic energy\n}}\n\n'''Hauptmann Deutschland''' ([[German language|German]] for '''Captain Germany'''), also known as '''Vormund''', is a fictional character appearing in [[American comic book]]s published by [[Marvel Comics]].\n\n==Fictional character biography==\nHauptmann Deutschland is part of a team called the Schutz Heiliggruppe, which was a national superteam protecting Germany. He first appeared in a backup story in ''[[Captain America (comic book)|Captain America]]'' where the Schutz Heiliggruppe captured the [[Red Skull]] and abducted him back to [[Germany]] in an attempt to put him on trial for [[war crime]]s. Although they captured the Skull and subsequently his Skeleton Crew, they later surrendered the Skull to a false [[Thor (Marvel Comics)|Thor]], [[Iron Man]] and [[Captain America]], who were actually shapeshifting \"bioplastoid\" androids created by the Skull's lackey [[Arnim Zola]].<ref>''Captain America'' #393</ref>\n\nRealizing the deception, Hauptmann Deutschland followed the Skull back to America. After a brawl with Captain America, the heroes teamed up to track the Skull. They concluded the hunt when confronted with a false corpse of the Red Skull. The false Skull had been shot through the head and appeared to have been killed by the [[Scourge of the Underworld]], who left his trademark \"Justice is Served\" scrawled on the wall. <ref>''Captain America'' #393</ref>\n\nVormund's next appearance was in a somewhat convoluted tale where he set out with Zeitgeist, another member of the Schutz Heiliggruppe, in order to investigate the slaying of their partner [[Blitzkrieg (Marvel Comics)|Blitzkrieger]], who had been slain while investigating the murders of multiple South American local superheroes. Although Vormund was framed for the murders, it was eventually discovered that Zeitgeist was actually a somewhat obscure American villain known as [[Everyman (Marvel Comics)|Everyman]]. While fleeing Captain America, Zeitgeist tried to stab Vormund with his sword. Vormund redirected the force of Zeitgeist/Everyman's stab and killed him.<ref>''Captain America'' #442</ref>\n\nHauptman Deutschland is later seen aiding [[Blue Marvel (Marvel Comics)|Blue Marvel]] against the organization The Terror-Hives of W.E.S.P.E.<ref>''The Mighty Avengers'' vol. 2 #4</ref>\n\n==Naming controversy==\nWhen the issues of ''[[Captain America (comic book)|Captain America]]'' containing Hauptmann Deutschland and the rest of the Schutz Heiliggruppe were to be published in Germany by licensee [[Condor Interpart]], the names of the team were changed in accordance with the German taboos on references to Nazism, despite the team being distinctly anti-Nazi in behavior and the fact that Hauptmann Deutschland's name (literal translation: \"Captain Germany\") contains no actual reference to Nazism. In Germany, Hauptmann Deutschland was renamed Freiheitskämpfer (Freedom Fighter).\n\nDue to a lack of coordination, when Hauptmann Deutschland next appeared in American comics, he was renamed Vormund, which means \"legal guardian\", \"warden\" or \"custodian\". Per Markus Raymond, a submitter to ''The Appendix to [[The Official Handbook of the Marvel Universe]]'', ''Vormund'' actually should be used only in reference to a \"legal guardian for a child or somebody else who can't talk legally for himself\".<ref>{{cite web| url= http://www.marvunapp.com/Appendix/schutzheiligruppe.htm| title= Schutz Heiliggruppe| website= marvunapp.com| publisher= | date= February 25, 2011 | access-date= January 11, 2022}}</ref>\n\n==Powers and abilities==\nHauptmann Deutschland has the power to absorb and redirect [[kinetic energy]]. He can project this energy into an opponent, use it to repel attacks, or increase his own strength and endurance. The origin of these powers is unknown. He is also a highly trained soldier and hand-to-hand combatant. He is also known to carry a variety of tactical gadgets in his belt, such as nets, oiled ball bearings, and a cable gun.\n\n==References==\n{{reflist}}\n\n== External links ==\n*{{Marvunapp|http://www.marvunapp.com/Appendix/vormundcap.htm|Hauptmann Deutschland, aka Vormund}}\n\n[[Category:Fictional characters with energy-manipulation abilities]]\n[[Category:Fictional German people]]\n[[Category:Marvel Comics mutates]]\n[[Category:Marvel Comics superheroes]]\n[[Category:National personifications in comic books]]"}]}}}}