{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes. Use [[Special:ApiFeatureUsage]] to see usage of deprecated features by your application."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"normalized": [{"from": "Janus_(Marvel_Comics)", "to": "Janus (Marvel Comics)"}], "pages": {"13199930": {"pageid": 13199930, "ns": 0, "title": "Janus (Marvel Comics)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Infobox comics character| <!--Wikipedia:WikiProject Comics-->\nimage=\n|caption=\n|character_name=Janus\n|real_name= Janus Tepes\n|species=\n|publisher=[[Marvel Comics]]\n|debut=(the seeming angel) ''The [[Tomb of Dracula]] #51''<br>(birth of Janus) ''The [[Tomb of Dracula]] #54'' (Mar 1977)<br>(Janus possessed by seeming angel) ''The [[Tomb of Dracula]] #61''\n|creators=[[Marv Wolfman]] and [[Gene Colan]]\n|status=\n|alliances=\n|previous_alliances=\n|aliases=The Golden Angel, Son of Dracula\n|relatives=\n|powers=\n}}\n\n'''Janus''' is a [[fictional character|fictional]] character appearing in [[American comic book]]s published by [[Marvel Comics]].\n\n==Fictional character biography==\nThe Golden Angel was a possessing spirit who claimed to be an angel, a messenger and warrior of God. This angel was revealed to have appeared to [[Dracula (Marvel Comics)|Dracula]] and thwarted his will in the past. As an angel, he battled Dracula and predicted his death, although he was then slain by Dracula.<ref>''The Tomb of Dracula'' #52</ref>\n\nDracula and his wife Domini later conceived through mystical means via a spell of Anton Lupeski. An infant was born to them in [[Boston, Massachusetts]], and they named this baby Janus. Dracula sired this child as part of a plan to use the Church of Satan to fulfill his plans for world domination.<ref>''The Tomb of Dracula'' #54</ref> The baby was accidentally shot and killed by Lupeski during an attack by [[Quincy Harker]], [[Rachel van Helsing]], [[Frank Drake (comics)|Frank Drake]], and [[Harold H. Harold]] on Dracula.<ref>''The Tomb of Dracula'' #59</ref> Domini resurrected Janus by merging him with the same seeming Golden Angel Dracula had encountered years earlier, returning Janus to life as an adult.<ref>''The Tomb of Dracula'' #61</ref> Janus became Dracula's opponent however, and battled Dracula to prevent his victims from becoming vampires.<ref>''The Tomb of Dracula'' #62</ref> Alongside Dracula, Frank Drake, and [[Topaz (Marvel Comics)|Topaz]], Janus also battled a demonic creature.<ref>''The Tomb of Dracula'' #63</ref> During the \"Star Waaugh\" incident, Janus teamed with [[Lectronn]] and [[Crimebuster (Marvel Comics)#Frank Moore|Crimebuster]] (Moore) to deal with mystical debris related to the incident.<ref>''Civil War: Battle Damage Report''</ref>\n\nWhen Quincy Harker had temporarily destroyed Dracula, the possessing Golden Angel abandoned Janus' body.  Janus immediately returned to Domini in human form, as a living baby.<ref>''The Tomb of Dracula'' #70</ref>\n\nYears later, Janus was kidnapped at the order of the vampire lord [[Varnae]].<ref>''[[Nightstalkers (comics)|Nightstalkers]]'' #16-18 (Feb.-April 1994)</ref>\n\nDuring the \"[[Curse of the Mutants]]\" storyline, Janus is betrayed by the Claw Sect and handed over to his brother Xarus (who has usurped his father Dracula's title of Lord of the Vampires). The Siren Sect leader Alyssa secretly hands him a light-deflecting pendant when he escapes.<ref>''Death of Dracula'' #1</ref>\n\n==Powers and abilities==\nAs an angel sent by the forces of Heaven to Earth, Janus possessed superhuman strength, weather-controlling powers and immunity to [[Dracula (Marvel Comics)|Dracula]]'s vampiric hypnotic powers, as well as being able to break his hypnotic hold over others. Janus could fire beams of concussive force from his eyes and to absorb and repel energies hurled against him, radiate blinding light, place people in temporal stasis, teleport himself and others at least thousands of miles across the face of the Earth, create illusory images, and transform into a golden eagle, retaining wings in humanoid form if desired. Janus could cause Dracula pain with a mere glance; he appeared able to survive physical death in astral form before incarnating in a new body. What special attributes the infant Janus might possess as a result of his vampire parentage remain unrevealed.\n\n==References==\n{{reflist}}\n\n==External links==\n* [http://marvel.wikia.com/Janus_Tepes_%28Earth-616%29 Janus] at Marvel Wiki\n\n{{Dracula}}\n\n[[Category:Fictional characters from Boston]]\n[[Category:Marvel Comics characters with superhuman strength]]"}]}}}}