{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes. Use [[Special:ApiFeatureUsage]] to see usage of deprecated features by your application."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"normalized": [{"from": "Libra_(Marvel_Comics)", "to": "Libra (Marvel Comics)"}], "pages": {"7141039": {"pageid": 7141039, "ns": 0, "title": "Libra (Marvel Comics)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Primary sources|date=December 2016}}\n{{For|the DC Comics character|Libra (DC Comics)}}\n'''Libra''' is the name of different fictional characters appearing in [[American comic book]]s published by [[Marvel Comics]].\n\n==Publication history==\nThe original Libra first appeared in ''[[The Avengers (comic book)|Avengers]]'' #72 (Jan. 1970), and was created by [[Roy Thomas]] and [[Sal Buscema]].\n\nThe character subsequently appears in:\n* ''The Avengers'' #80–82 (Sept.–Nov. 1970),\n* ''Daredevil'' #69 (Oct. 1970),\n* ''Iron Man'' #33–36 (Jan.–April 1971),\n* ''Daredevil'' #73 (Feb. 1971),\n* ''The Avengers'' #120–125 (Feb.–July 1974), #130–134 (Dec. 1974–April 1975),\n* ''Giant-Size Avengers'' #3 (Feb. 1975),\n* ''The Avengers'' #135 (May 1975),\n* ''Giant-Size Avengers'' #4 (June 1975),\n* ''Iron Man'' #184–185 (July–Aug. 1984),\n* ''The West Coast Avengers'' vol. 2 #26 (Nov. 1987),\n* ''[[Avengers Forever]]'' #1–12 (Dec. 1998–Feb. 2000).\n\nLibra appeared as part of the \"Zodiac\" entry in ''The [[Official Handbook of the Marvel Universe|Official Handbook of the Marvel Universe Deluxe Edition]]'' #20.\n\n==Fictional character biography==\n\n===Gustav Brandt===\n{{Infobox comics character|\nimage=<!--  Commented out because image was deleted: [[Image:LibraComics.jpg|125px]] -->\n|caption=Libra, art by [[Rob Liefeld]]\n|character_name=Libra\n|real_name=Gustav Brandt\n|publisher=[[Marvel Comics]]\n|debut=''[[The Avengers (comic book)|The Avengers]]''  #72 (Jan. 1970)\n|creators=[[Roy Thomas]]<br>[[Sal Buscema]]\n|alliances=[[Zodiac (comics)|The Zodiac]]<br/>[[Avengers (comics)|The Avengers]]\n|aliases=Master of the Balance, Lloyd Willoughby\n|powers=Psychic senses; teleportation into the Between.\n}}\n[[Germany|German]] soldier Gustav Brandt served with the [[France|French]] forces during the [[Vietnam War]]. While in [[Saigon]], he met and fell in love with a [[Vietnamese people|Vietnamese]] woman named Lua, and eventually had a daughter with her. However, Lua's brother Khruul was enraged with the [[interracial couple|interracial coupling]] of his sister and a [[European ethnic groups|European]] man. He and his men attacked Gustav and his family with flamethrowers. Lua was killed in the ensuing battle, and Gustav lost his eyesight. He and his daughter took shelter in Pama, where he was trained by the priests, but was forbidden to communicate with his daughter.\n\nJoining the [[Zodiac (comics)|Zodiac Cartel]], Gustav adopted the codename Libra, and served as a terrorist. The Zodiac was infiltrated by Nick Fury, posing as Scorpio; the Zodiac fought the [[Avengers (comics)|Avengers]] and escaped.<ref>''The Avengers'' #72</ref> Led by Taurus, the Zodiac later attempted to kill all Manhattan residents born under the sign of Gemini as a show of power, but were thwarted by the Avengers. Taurus's faction attempted to kill the Zodiac dissident faction, but all twelve leaders were captured by the Avengers.<ref>''The Avengers'' #120–122</ref> Battling the [[Avengers (comics)|Avengers]] on several occasions, he eventually discovered that [[Mantis (Marvel Comics)|Mantis]] was the daughter he had left in Pama, and turned himself in to the authorities.{{Issue|date=July 2009}} He then vanished mysteriously, later turning up in [[Ho Chi Minh City]], where the [[Swordsman (comics)|Swordsman]] revealed to everyone Mantis' transformation into the Celestial Madonna.{{Issue|date=July 2009}} Libra then witnessed the marriage of Mantis and the Swordsman, and returned to prison shortly after.{{Issue|date=July 2009}} He did not stay in prison long, though, as he escaped and committed illegal acts alongside the Zodiac once more.{{Issue|date=July 2009}} A new android version of the Zodiac later appeared, led by Scorpio in a new android body, massacred the human Zodiac, and took over their criminal operations.<ref>''The West Coast Avengers'' vol. 2 #26</ref>\n\nAfter the Zodiac's death at the hands of a [[Life Model Decoy]], Libra – now defining himself by his interest in the balance rather than continuing his criminal past – served alongside the Avengers briefly as they battled [[Kang (comics)|Kang]] and [[Immortus]] in the [[Avengers Forever|Destiny War]]. His ability to sense the 'balance' of the universe helped [[Rick Jones (comics)|Rick Jones]] use the [[Destiny Force]] to summon seven Avengers from different points in the team's history who would be crucial to their victory in the current crisis; these included Captain America from his battle with the Secret Empire, Yellowjacket while unbalanced and amnesic, Hawkeye just after the Kree-Skrull War, Giant-Man and Wasp of the present, Genis-Vell of a few months in the future, and Songbird from an alternate universe. Although they appeared strange choices, each Avenger was selected from these particular moments in time thanks to Libra's subconscious awareness of the universal balance and the necessity of their future actions even when he was unaware of their roles, comparing his subconscious decision to being able to balance on a tightrope without being able to explain how to do so. He realised the purpose behind their selection in the final confrontation, even acknowledging that Hawkeye's presence affected his own decisions as he decided to participate in the final fight rather than just watch from the sidelines.<ref>''Avengers Forever'' #1-#12</ref>\n\n===Android Zodiac===\nScorpio (Jake Fury) constructed the android Zodiac members, although his plan was thwarted by the [[Defenders (comics)|Defenders]].<ref>''The Defenders'' #48–50</ref> The androids Libra and Sagittarius employed costumed criminals posing as the Defenders to create chaos in New York City.<ref>''The Defenders'' #63–65</ref> [[Quicksilver (comics)|Quicksilver]] employed the android Zodiac to attack the [[West Coast Avengers]], but the Avengers defeated the Zodiac.<ref>''The West Coast Avengers'' Annual #1</ref>\n\nLed by Scorpio in a new android body, the android Zodiac massacred the human Zodiac, and took over their criminal operations. They battled the West Coast Avengers, but were rendered inert when they were transported to the dimension of the Brotherhood of the Ankh.<ref>''The West Coast Avengers'' vol. 2 #26–28</ref>\n\n===Thanos' Libra===\nThe third Libra is an unnamed female that [[Thanos]] recruited to join his incarnation of the Zodiac.<ref>''Avengers Assemble'' vol. 2 #1</ref> She and the other Zodiac members perish when Thanos abandons them on the self-destructing Helicarrier where [[John King (comics)|Cancer]] was the only survivor.<ref>''Avengers Assemble'' vol. 2 #4</ref>\n\n==Powers and abilities==\nLibra is physically blind, but possesses psychic senses, and is also a skilled martial artist. He has the ability to shift into the Place Between Places, a mystical dimension that is untraceable to most life-forms.\n\nThe Android Libra can fly and become intangible. In its second form, Libra can still fly but demonstrated no other powers.\n\nEcliptic's Libra wielded a staff and an energy-charged sword. It is unknown if she possesses other abilities, but she possesses the Zodiac teleportation device.\n\n==In other media==\nLibra appears in ''[[The Avengers: United They Stand]]'' animated television series.{{cn|date=April 2021}} This version is a female alien who wields a weighing scale-like weapon and serves as a member of [[Zodiac (comics)|Zodiac]].\n\n==References==\n{{Reflist}}\n\n==External links==\n* {{Marvunapp|http://www.marvunapp.com/Appendix2/librabrandt.htm|Libra}}\n* {{Marvunapp|http://www.marvunapp.com/Appendix2/libralmd.htm|Android Libra}}\n\n[[Category:Characters created by Roy Thomas]]\n[[Category:Characters created by Sal Buscema]]\n[[Category:Comics characters introduced in 1970]]\n[[Category:Fictional blind characters]]\n[[Category:Fictional henchmen]]\n[[Category:Fictional Vietnam War veterans]]\n[[Category:Marvel Comics martial artists]]\n[[Category:Marvel Comics supervillains]]"}]}}}}