{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes. Use [[Special:ApiFeatureUsage]] to see usage of deprecated features by your application."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"normalized": [{"from": "Loa_(comics)", "to": "Loa (comics)"}], "pages": {"3644811": {"pageid": 3644811, "ns": 0, "title": "Loa (comics)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Short description|Character from Marvel Comics}}\n{{Infobox comics character| <!--Wikipedia:WikiProject Comics-->\nimage=[[Image:Loa skottieyoung.jpg|150px]] \n|caption=Loa by [[Skottie Young]]\n|character_name=Loa\n|real_name=Alani Ryan\n|species=[[Mutant (Marvel Comics)|Human Mutant]]\n|publisher=[[Marvel Comics]]\n|debut=''The New Mutants'' vol. 2 #11 (June, 2004)\n|creators=[[Michael Ryan (artist)|Michael Ryan]]\n|alliances=[[Alpha Squadron (comics)|Alpha Squadron training squad]]<br/>[[Defenders (comics)|Defenders]]<br/>[[X-Mansion|Xavier Institute]]<br/>[[List of X-Men members#X-Men-In-Training (2006–present)|X-Men-In-Training]]<br/>[[Avengers Academy]]\n|aliases=\n|powers=Ability to \"phase\" through solid matter causing it to crumble afterwards<br>Underwater adaptation via Atlantean pendant\n|}}\n\n'''Loa''' ('''Alani Ryan''') is a [[fictional character]] appearing in [[American comic book]]s published by [[Marvel Comics]]. A [[Mutant (Marvel Comics)|mutant]], Loa is a student at the [[X-Mansion|Xavier Institute]]. She made her debut in ''The New Mutants'' vol. 2 #11.\n\n==Fictional character biography==\n\n===Before Xavier's===\nBorn in [[Maui]], Hawaii of mixed Native Hawaiian and Caucasian ancestry, '''Alani Ryan''' quickly developed a talent for surfing. One day whilst surfing, she and her father wind up in the middle of an ambush by the villain Great White and a pack of trained [[shark]]s as he lays claim to the area. Alani's mutant ability is activated in this heated situation and she uses her ability to kill some of the sharks and save her father. In the nick of time, [[Namor]] arrives and saves the day by defeating Great White. Following the battle, Alani's grandmother Alice Ryan is revealed to be a former acquaintance of Namor's from the 1940s and a close friend of Namor's former lover Betty Dean.<ref name=\"Namor5\">''Namor: The First Mutant'' #5</ref>\n\n===Alpha Squadron===\nAfter arriving at the [[X-Mansion|Xavier Institute]] as a student, she adopts the codename Loa (named for a type of worm that moves the same way she does when she uses her powers), and along with fellow students [[Anole (comics)|Anole]], [[Rubbermaid (comics)|Rubbermaid]], Kidogo, [[Network (comics)|Network]], and [[Indra (comics)|Indra]], is assigned to [[Alpha Squadron (comics)|Alpha Squadron]], the training squad advised by former [[Alpha Flight]] member [[Northstar (Marvel Comics)|Northstar]].   When Northstar is apparently killed by Wolverine, advising duties for Alpha Squadron are taken over by [[Karma (comics)|Karma]].{{Issue|date=April 2010}} Of her classes at the Institute, she dislikes chemistry the most and is voted \"Most Laid Back\" in the ''New X-Men: Academy X Yearbook Special'' (2005).\n\n===Post M-Day===\nAfter the [[Decimation (comics)|Decimation]], Alani was one of the 27 students to retain her powers. She was also one of the students whom [[Emma Frost]] placed in the fateful all-out brawl to determine who would become the new X-Men trainees; Alani was among those who lost. Before the fight, she was seen threatening to \"crumble\" [[Anole (comics)|Anole]]'s tongue if he touched her with it. Despite this, Loa is close friends with Anole, as well as Rockslide.{{Issue|date=April 2010}}\n\nShe is seen as one of the students listening to [[Blindfold (comics)|Blindfold]]'s tale about [[Magik (comics)|Illyana Rasputin (Magik)]] and is sucked down into [[Otherplace|Limbo]] along with many of the other students. After the students land on a rocky outcrop, they are soon attacked by a huge number of demons, and Loa is, for the first time, shown using her powers. A demon attempts to punch her in the stomach, and his hand goes straight through, but it is sliced to ribbons on the other side. She then moves to protect Anole as Magik decides she needs to take one of their souls to make a new [[Soulsword]]. When Magik goes to confront Pixie, Alani jumps to attack her, but Magik blasts her to the ground with her powers.{{Issue|date=April 2010}}\n\nShe participated in the final fight against [[Belasco (comics)|Belasco]], and afterwards returned to the school with the rest of the students.{{Issue|date=April 2010}}\n\nIn the aftermath of Quest for Magik, and overcome with stress, Loa has shown an interest in [[Elixir (comics)|Elixir]] and successfully initiates a physical relationship with him.<ref>''New X-Men'' #43 (October 2007)</ref>\n\n===Manifest Destiny & Utopia===\nAlani relocated to [[San Francisco]] along with other former students.<ref>''X-Men: Manifest Destiny #2</ref> She is later seen trying to help cheer up Colossus who is still trying to come to terms with his loss of Shadowcat.<ref>''X-Men: Manifest Destiny #3</ref>  It was confirmed in [[X-Force]] that she and Elixir are still romantically involved as well.{{Issue|date=April 2010}}\n\nLoa, along with fellow students [[Mercury (Marvel Comics)|Mercury]] and [[Onyxx (comics)|Onyxx]], was tasked with keeping peace at the riots on [[Telegraph Hill, San Francisco|Telegraph Hill]] after the mutant-hate group \"Humanity Now!\" marched from [[Sacramento]] to San Francisco to promote \"Proposition X,\" displeasing many citizens of San Francisco, mutant and non-mutant alike.<ref>''Dark Avengers / Uncanny X-Men: Utopia #1''</ref>\n\n===Nation X===\nWhilst living on the island of Utopia, Magneto accompanies Anole, Loa and Rockslide as they search for Mercury, who claim has been captured by a ghost in the tunnels. They find Mercury, and Magneto deals with the ghost - a hologram recording of himself when he was younger.{{Issue|date=December 2010}} Loa is also a victim of the [[Stepford Cuckoos]] boredom as they trap her in a psychic illusion where she is hanging on to an edge of a cliff, where her fingers are 'tap danced' on until she plunges off a cliff into the churning waters of the cold [[Pacific Ocean|Pacific]].{{Issue|date=December 2010}}\n\nLater Loa teams up with Match and Rockside to steal some food from Warpath, who is on guard duty. After Warpath takes out Rockslide and Match, Loa puts him in his place by declaring ‘I came here for [[ice cream]]. I’ll leave when I get it’ as well as threatening to dissolve Warpath's chest. Warpath realizes she is not bluffing until Rockslide points out Warpath has been sneaking food as he had food in his mouth throughout the whole ordeal.{{Issue|date=December 2010}}\n\n===Necrosha===\nDuring the attack of [[Selene (comics)|Selene]]'s undead force on Utopia, Alani was attacked by three reanimated [[Acolytes (comics)|Acolytes]]: [[Fabian Cortez|Cortez]], [[Seamus Mellencamp|Mellencamp]], and [[Marco Delgado (comics)|Delgado]]. She was saved by [[Deadpool]], who was in her room playing with her toys and reading her diary when he heard her screams. Discovering that the former Acolytes would revive and reform after any injury, Deadpool spent 20 minutes \"subduing them with lethal force\" until he ran out of bullets. Finally, he was about to be eviscerated by Mellencamp, when Loa dove through the reanimated mutant, disintegrating him in the process. Seeing that Mellencamp did not reform, Deadpool threw Loa at the remaining Acolytes, forcing her to disintegrate them as well.<ref>''X-Force'' vol. 3 Annual #1</ref>\n\n===Collision===\nLoa joins Rogue, Magneto, Indra and Anole  on a trip to Mumbai due to Indra's family summoning him home. The group, minus Indra, venture into the city to see the sites. While roaming the streets the group experience a bizarre storm which causes lightning to bombard the city. Loa appears unharmed and the group encounter a strange girl called Luisa, who appears out of nowhere. The group is then attacked by three Sentinels.<ref>''X-Men: Legacy'' #238</ref> Loa takes down a Sentinel on her own by phasing through its head, something which impresses Rogue who says how proud of Alani she is. When they return to Indra's home, Indra reveals to them that he is to be married against his will. Loa and Anole try to talk him out of it, although it does not seem to change his mind as he plans to go through with the marriage.  \n \nBut before the marriage can happen, the Children of the Vault attack with the intention of reclaiming their \"sister\" Luisa, who reveals her name is actually Luz and they make quick work of Loa, Anole, Indra, Magneto and Rogue. After kidnapping Magneto, Rogue and Luz back to their city, Quitado, Indra, Anole and Loa are determined to rescue them. However Indra's father refuses to allow his son to leave before he is to be married. Indra then decides to marry Vaipala first that afternoon so they may rescue their teachers.<ref>''X-Men: Legacy'' #239</ref>\n\nAs the wedding goes on it is revealed that Vaipala and Luz switched places and that the Children of the Vault have Vaipala instead.<ref>''X-Men: Legacy'' #240</ref> Loa threatens Luz for information on the way to Quitado and after forming a plan, they sneak into the city. After rescuing Rogue, Magneto and Vaipala, Loa and Magneto work together in sending Quitado back to the reality where it came from.<ref>''X-Men: Legacy'' #241</ref>\n\n===The Curse of the Mutants===\nLoa accompanies Emma Frost underwater to present Namor with data from Dr. Nemesis about the Atlantean vampires, the Aqueos. During the trip she reveals she would not only like to see New Atlantis for herself but she is well educated in Atlantean history, mythology and culture.<ref>''Namor: The First Mutant'' #3</ref>\n  \nDuring the final assault on the Aqueos city, Loa shows up with Logomancer as backup. They arrive with a spell that weakens the Aqueos but during the process an Aqueos breaks her diving helmet. A pendant she is wearing begins to glow, giving Loa the ability to breathe underwater. Loa then begins to proceed in destroying several of the Aqueos.<ref>''Namor: The First Mutant'' #4</ref>\n\n===Fear Itself===\nDuring the ''[[Fear Itself (comics)|Fear Itself]]'' storyline, Loa joins up with Namor, [[Doctor Strange]], [[She-Hulk (Lyra)|Lyra]], and [[Silver Surfer]] to form another version of the [[Defenders (comics)|Defenders]] to help fight [[Attuma]], who was transformed into Nerkodd: Breaker of Oceans. She was then forced to kill Aradnea to save the life of Doctor Strange.<ref>''Fear Itself: The Deep'' #1-4</ref>\n\n===Avengers vs. X-Men===\nDuring the ''[[Avengers vs. X-Men]]'' storyline, the X-Students temporarily stay at [[Avengers Academy]]. After the war, while most of the X-Students decided to leave, Loa decides to stay behind and become a student.<ref>''Avengers Academy'' #29-31</ref>\n\n===Death and Rebirth===\n\nLoa is later killed during a mutant retaliation.<ref>''The Uncanny X-Men'' vol. 5 #11</ref>\n\nDuring the \"[[Empyre]]\" storyline, Loa is among the revived mutants living on [[Krakoa]]. She, Anole, and Rockslide go to Arrako Point on Krakoa and meet with the High Summoner of Arrako where he teaches them the game of weakness which gets interrupted when a [[Cotati (comics)|Cotati]] fleet approaches Krakoa.<ref>''X-Men'' vol. 5 #11. Marvel Comics.</ref>\n\n==Powers and abilities==\n[[Image:Loapower.jpg|thumb|left|250px|Loa demonstrates her power]] \nLoa possesses a [[molecule|molecular]] distortion power that allows her to move through solid [[matter]] by disabling binding forces. This causes the matter to crumble, or break down around as she passes through it. The markings on her body are physical signs of her mutation, and not tattoos.<ref name=\"Namor5\"/>\n\nLoa is very reluctant to use her powers unless absolutely necessary. This stems from the destructive nature of her powers and past experiences.<ref>''X-Force'' vol. 3 Annual #1</ref>\n\nDespite having very little field experience and never being sent on any X-Men missions, Loa has proven herself capable in battle, surviving the Purifiers assault on the Xavier Institute, defending herself against demons when sucked into Limbo, combating the reanimated dead during Necrosha alongside Deadpool, holding her own against Nimrod Sentinels, and single-handedly defeating a full-sized Sentinel in combat.\n\nShe wears an Atlantean pendant that keeps her alive underwater.\n\n==References==\n{{Reflist}}\n\n{{Avengers Academy}}\n{{Defenders}}\n\n==External links==\n{{Portal|Speculative fiction|Comics}}\n*[https://web.archive.org/web/20120716193912/http://uncannyxmen.net/db/article/showquestion.asp?faq=4&fldAuto=229&page=3 Yearbook Entry on Alpha Squadron] at uncannyxmen.net\n\n{{DEFAULTSORT:Loa (Comics)}}\n[[Category:Comics characters introduced in 2004]]\n[[Category:Fictional bisexual females]]\n[[Category:Fictional surfers]]\n[[Category:Fictional characters from Hawaii]]\n[[Category:Fictional indigenous peoples of Polynesia]]\n[[Category:Fictional characters who can turn intangible]]\n[[Category:Marvel Comics mutants]]\n[[Category:Marvel Comics female superheroes]]\n[[Category:Marvel Comics LGBT superheroes]]"}]}}}}