{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes. Use [[Special:ApiFeatureUsage]] to see usage of deprecated features by your application."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"normalized": [{"from": "Overmind_(comics)", "to": "Overmind (comics)"}], "pages": {"6432858": {"pageid": 6432858, "ns": 0, "title": "Overmind (comics)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{short description|Villain in the Marvel Comics universe}}\n{{Infobox comics character \n| character_name = Overmind\n| image          =\n| caption        = Overmind\n| real_name      = Grom\n| publisher      = [[Marvel Comics]]\n| debut          = ''[[Fantastic Four (comic book)|Fantastic Four]]''  #113 (August 1971)\n| creators       = [[Stan Lee]] (writer)<br>[[John Buscema]] (artist)\n| alliances      = [[Thunderbolts (comics)|Thunderbolts]]<br/>Eternals<br/>the Psychics<br/>[[Defenders (comics)|Defenders]]\n| aliases        = Champion of Champions\n| powers         = Transform psionic energy<br>Superhuman strength\n| cat            = super\n| subcat         = Marvel Comics\n| villain        = y\n| sortkey        = Overmind\n}}\nThe '''Overmind''' (originally the '''Over-Mind''') is a [[fiction]]al [[Character (arts)|character]] appearing in [[American comic book]]s published by [[Marvel Comics]].\n\n==Publication history==\n{{expand-section|date=June 2020}}\nThe character first appeared in ''[[Fantastic Four (comic book)|Fantastic Four]]'' #113 (Aug 1971).<ref>{{cite book |last1=DeFalco |first1=Tom |last2=Sanderson |first2=Peter |last3=Brevoort |first3=Tom |last4=Teitelbaum |first4=Michael |last5=Wallace |first5=Daniel |last6=Darling |first6=Andrew |last7=Forbeck |first7=Matt |last8=Cowsill |first8=Alan |last9=Bray |first9=Adam |title=The Marvel Encyclopedia |date=2019 |publisher=DK Publishing |isbn=978-1-4654-7890-0 |page=263}}</ref>\n\n==Fictional character biography==\nThe Overmind is an alien belonging to the [[Eternals (comics)|Eternals]] of Eyung. He was born uncounted millennia ago on the planet Eyung (\"Eternus\") as Grom.<ref>{{cite book |last =Rovin |first =Jeff |title =The Encyclopedia of Supervillains |publisher =Facts on File |date =1987 |location =New York |isbn = 0-8160-1356-X |page=256}}</ref> Acting as one of their warlords, he led massacres of entire species. He was also the reigning champion in their gladiatorial arenas. When his race had engaged the Gigantians in a war about to lead to mutual absolute destruction, Grom was chosen for his physical prowess as the receptacle for their entire population of several hundred million minds. He was launched in a protective capsule, unconscious for thousands of years while assimilating them into one single mind.\n\nIn recent years he awoke and piloted his ship to the nearest inhabited planet, Earth. There he came into contact with the [[Fantastic Four]], who had been warned by [[Uatu the Watcher]]. The Overmind took over the mind of [[Mister Fantastic]], and battled the Fantastic Four and [[Doctor Doom]], who proved unable to stop him until the [[Stranger (comics)|Stranger]] intervened and shrank the Overmind into a subatomic [[microverse]] on a dust mote, where he was left completely isolated with no available conquests, and went mad from the strain.<ref>''Fantastic Four'' #113–116</ref>\n\nHe was later discovered by another collective consciousness known as Null the Living Darkness. In his current broken state Null took control of him and sent him on a campaign against a [[Parallel universe (fiction)|parallel universe]], [[Earth-712|Earth]], inhabited by the [[Squadron Supreme]]. The Overmind mentally enslaved both the Squadron and that Earth's leaders while posing as the U.S. president [[Nighthawk (Marvel Comics)|Kyle Richmond]], and began construction of an interstellar armada to invade other worlds. When [[Hyperion (Marvel Comics)|Hyperion]] brought the [[Defenders (comics)|Defenders]] to assist him, they freed the Squadron. Meanwhile, Null had leeched away the Overmind's mental energies, but yet another psychic composite entity of seven human telepaths empowered by the assembled heroes, defeated him and inhabited the weakened Grom.<ref>''The Defenders'' #112–115</ref>\n\nThe Overmind returned with the Defenders to their Earth.<ref>''The Defenders'' #115</ref> For a while this entity was welcomed into the Defenders' ranks, and the loose ends of the seven psychics' old lives were tied up.<ref>''The Defenders'' #117</ref> He assisted the Defenders in the rescue of [[Daimon Hellstrom]] from the [[Miracle Man]].<ref>''The Defenders'' #120–121</ref> The Overmind grew uncomfortable and eventually left the Defenders, and made them forget he was ever one of them. He tried to find a purpose by attempting to help Millwood, New Hampshire, a town of 800 people dying of chemical poisoning, by controlling their minds to foster the illusion that they were well. The Overmind was convinced to cancel the illusion and allow them to live in reality.<ref>''Marvel Comics Presents'' #40</ref>\n\nWhen the Squadron transferred to this Earth, the Overmind's original psyche was stirred into awareness and absorbed the telepaths into his own billion-wide whole. His psychic powers were replenished and his true mind reasserted itself. He once more mind-controlled and kidnapped the Squadron to take revenge against the Stranger by organizing a raid against the latter's laboratory world.<ref>''Quasar'' #13</ref> He freed many of the Stranger's superhuman captives to fuel his enslaved ranks. He locked the Stranger in a stalemated mental battle. When several [[Watcher (comics)|Watchers]] arrived on an unrelated business the Overmind was wrought by paranoia, believing the Stranger to have summoned them for assistance, inducing psychosis, and enabling the Stranger to capture him as a subject of study.<ref>''Quasar'' #16</ref>\n\nThe Overmind's future counterpart travels back in time to present-day Squadron-Earth to aid the [[Kang the Conqueror|Scarlet Centurion]] in repulsing the expanding [[Nth Man]]. His head explodes from the effort and he dies.<ref>''Squadron Supreme Graphic Novel''</ref>\n\nHe later apparently managed to escape and declined participation in the [[Mad Thinker]]'s quest for vengeance against the Fantastic Four.\n\n===Civil War===\nShortly afterwards Grom was affected by the [[Purple Man]]'s mind-controlling pheromones, and used to both monitor New York's population, as the latter's chemicals spread in the water supply, as well as control potential threats like the [[Avengers (comics)|Avengers]], but disappeared after the Purple Man's defeat. He was eventually located by [[Baron Zemo]] and his Thunderbolts, during the [[Civil War (comic book)|Civil War]] event, and coerced to join the group or face jail time.\n\n==Powers and abilities==\nThe Overmind possesses vast psychic powers derived from the synthesized intellects of the billion Eternals of Eyung composing his essence, including telepathy, telekinesis, or illusion-casting, and can use them over great distances. The Overmind can scan the thoughts of others and project his thoughts into others' minds within an unrevealed radius. His victims are completely unaware of his influence unless he allows them. Even when severely weakened, with his mind comatose and his body under the influence of the 7 telepaths, whose assembled might was likened to a drop in the ocean compared to his own, he was able to control the minds of 800 people, and at full power he managed to push the [[Stranger (comics)|Stranger]], a cosmic entity rivaling [[Galactus]] in scope, to his mental limits. He possesses psychokinetic ability enabling him to lift psychokinetically approximately what he can physically lift. He can project psychokinetic concussion blasts capable of deforming steel at {{convert|10|ft|m}}.\n\nHis sole weaknesses are his inability to control Eternals of any race, and his [[schizoid]] composition can make his abilities weaken immensely when sufficiently stressed. The Overmind is susceptible to magic, the imposition of superior intellects and powers, and fatigue. Twice he suffered mental breakdowns, rendering him mentally vulnerable.\n\nAs a result of his alien physiognomy and metabolism, he possesses great superhuman physical strength, magnified sevenfold through psionic augmentation; and even more impressive speed, stamina, and durability. He is an experienced veteran of many wars, with considerable fighting skills.\n\n==Reception==\n* In 2021, ''[[CBR.com]]'' ranked Grom/The Over-Mind 14th in their \"15 Most Powerful Eternals\" list.<ref>{{Cite web |last=Lealos |first=Shawn S. |date=2019-07-27 |title=The 15 Most Powerful Eternals, Ranked |url=https://www.cbr.com/most-powerful-eternals-ranked/ |access-date=2022-10-14 |website=CBR |language=en-US}}</ref>\n* In 2021, ''[[Screen Rant]]'' ranked The Over-Mind 9th in their \"10 Most Powerful Members Of The Eternals\" list<ref>{{Cite web |last=Harn |first=Darby |date=2021-05-27 |title=10 Most Powerful Members Of The Eternals |url=https://screenrant.com/marvel-eternals-strongest-members/ |access-date=2022-08-30 |website=ScreenRant |language=en-US}}</ref>\n\n==Notes==\n{{reflist}}\n\n==References==\n{{refbegin}}\n*{{Marvunapp|http://www.marvunapp.com/Appendix3/overmindgrom.htm|Overmind}}\n*{{gcdb|type=character|search=over-mind|title=Over-Mind}}\n*{{gcdb|type=character|search=overmind|title=Overmind}}\n*{{comicbookdb|type=character|id=5595|title=Overmind}}\n{{refend}}\n\n==External links==\n*[http://marvel.com/universe/Overmind Overmind] at the Marvel Universe\n\n{{Eternals}}\n{{Defenders}}\n{{Fantastic Four}}\n{{Stan Lee}}\n\n[[Category:Characters created by John Buscema]]\n[[Category:Characters created by Stan Lee]]\n[[Category:Comics characters introduced in 1971]]\n[[Category:Marvel Comics characters with superhuman strength]]\n[[Category:Marvel Comics telepaths]]"}]}}}}