{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes. Use [[Special:ApiFeatureUsage]] to see usage of deprecated features by your application."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"normalized": [{"from": "Sentinel_(comics)", "to": "Sentinel (comics)"}], "pages": {"29530": {"pageid": 29530, "ns": 0, "title": "Sentinel (comics)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Short description|Mutant-hunting robot in Marvel Comics}}\n{{About||the comic book|Sentinel (comic book)|the DC Comics superhero|Alan Scott|the fictional imprint label|Sentinels of the Multiverse#Concept and development{{!}}Sentinel Comics}}\n{{Infobox comics organization <!--Wikipedia:WikiProject Comics-->\n|image=Sentinels (Marvel Annotated 2).jpg\n|imagesize= <!-- default 250 -->\n|caption=Art by Alex Ross\n|name=Sentinels\n|publisher=[[Marvel Comics]]\n|debut=''[[Uncanny X-Men|The X-Men]]'' #14 (Nov. 1965)\n|creators=[[Stan Lee]]<br>[[Jack Kirby]]\n|members=Sentinel Squad [[Office of National Emergency|O*N*E]]<br>[[Nimrod (comics)|Nimrod]]<br/>[[Master Mold]]<br>[[Bastion (comics)|Bastion]]<br>[[Prime Sentinel]]s\n|base=Sentinel Headquarters, [[New York City|New York]]\n|subcat=\n|hero=\n|villain=\n}}\nThe '''Sentinels''' are a [[fiction]]al variety of [[Mutant (Marvel Comics)|mutant]]-hunting [[robot]]s appearing in [[American comic book]]s published by [[Marvel Comics]]. They are typically depicted as [[antagonist]]s to the [[X-Men]].\n\nThe Sentinels played a large role in the 1990s [[X-Men: The Animated Series|''X-Men'' animated series]] and have been featured in several X-Men [[video game]]s. The Sentinels are featured prominently in the 2014 film ''[[X-Men: Days of Future Past]]'' while [[Danger Room|simulated versions]] made brief appearances in the 2006 film ''[[X-Men: The Last Stand]]'' and the 2016 film ''[[X-Men: Apocalypse]]''. In 2009, the Sentinels were ranked as ''[[IGN]]''{{'}}s 38th Greatest Comic Book Villain of All Time.<ref>{{cite web|title=The Top 100 Comic Book Villains|url=http://www.ign.com/top/comic-book-villains/38.html|website=[[IGN]]|access-date=4 November 2017|language=en}}</ref>\n\n==Publication history==\n[[File:The X-Men (Uncanny X-Men)-vol.1-14 (November 1965).jpg|thumb|upright|Sentinels' debut ''[[Uncanny X-Men|The X-Men]]'' #14 (November 1965). Art by [[Jack Kirby]].]]\nCreated by [[Stan Lee]] and [[Jack Kirby]], they first appeared in ''[[Uncanny X-Men|The X-Men]]'' #14 (Nov. 1965).<ref>{{cite book |last1=DeFalco |first1=Tom |last2=Sanderson |first2=Peter |last3=Brevoort |first3=Tom |last4=Teitelbaum |first4=Michael |last5=Wallace |first5=Daniel |last6=Darling |first6=Andrew |last7=Forbeck |first7=Matt |last8=Cowsill |first8=Alan |last9=Bray |first9=Adam |title=The Marvel Encyclopedia |date=2019 |publisher=DK Publishing |isbn=978-1-4654-7890-0 |page=318}}</ref>\n\nSentinels are programmed to locate [[Mutant (Marvel Comics)|mutants]] and capture or kill them. Though several types of Sentinels have been introduced, the typical Sentinel is three stories tall, is capable of [[flight]], projects energy blasts, and can detect mutants.<ref>{{cite book |last1=Brevoort |first1=Tom |last2=DeFalco |first2=Tom |last3=Manning |first3=Matthew K. |last4=Sanderson |first4=Peter |last5=Wiacek |first5=Win |title=Marvel Year By Year: A Visual History |date=2017 |publisher=DK Publishing |isbn=978-1465455505 |page=110}}</ref> Pursuing genocide as the means of dealing with a threat has made the Sentinels an analogy for racial hatred and other negative types of [[fanaticism]] in Marvel stories,<ref>{{cite book |last1=Wells |first1=John |title=American Comic Book Chronicles: 1965-1969 |date=2014 |publisher=TwoMorrows Publishing |isbn=978-1605490557 |page=45}}</ref> represent the horrific consequences of humanity's actions based on hate and ignorance, along with a caution of the risks of [[AI takeover]].\n\n==Characteristics==\n{{Expand section|date=January 2011}}\n\nSentinels are designed to hunt [[Mutant (Marvel Comics)|mutants]].{{r|xmenv3no19to23}} While many are capable of [[tactic (method)|tactical thought]], only a handful are [[self-awareness|self-aware]].\n\nSentinels are technologically advanced, and have exhibited a wide variety of abilities. They are armed (primarily with [[Directed-energy weapon|energy weapons]] and restraining devices), capable of flight, and can detect mutants at long range. They possess vast physical strength, and their bodies are highly resistant to damage.{{r|xmenv3no19to23}} Some are able to alter their physical forms or re-assemble and reactivate themselves after they have been destroyed.\n\nSome Sentinel variants have the ability to learn from their experiences, developing their defenses during an engagement. Several groups of Sentinels have been created and/or led by a single massive Sentinel called [[Master Mold]]. Some Sentinels are also equipped with an inconspicuous logic loop in case they should go rogue to convince them that they are mutants as demonstrated in the Tri-Sentinel.\n\nBecause of their power, sophistication, and high mass production, Sentinels are sold on the black market.<ref name=modokheadcasesv1no2>''M.O.D.O.K.: Head Cases'' #2. Marvel Comics.</ref> Entities obtain them—often in poor condition—for their own purposes (not necessarily mutant-related).<ref name=xmenv3no19to23>''X-Men'' (vol. 3) #19-22. Marvel Comics.</ref><ref name=\"avengerschildrenscrusadevol1no9\">''Avengers: The Children's Crusade'' #9 (May 2012). Marvel Comics.</ref>\n\nDuring the \"[[Iron Man 2020 (event)|Iron Man 2020]]\" event, a Sentinel appears as a member of the [[A.I. Army]].<ref>''Iron Man 2020'' vol. 2 #1. Marvel Comics.</ref>\n\n==Types of Sentinels==\n{{Trivia|section=y|date=July 2018}}\n[[File:Sentinel - Evolution (Marvel Comics).jpg|thumb|upright|Evolution of the Sentinel. Art by [[Ardian Syaf]].]]\nThere are different types of Sentinels that appear in the comics:\n* '''Mark I''' and '''Master Mold''' - Created by [[Bolivar Trask]]. First appeared in ''X-Men'' #14. Bolivar Trask sacrificed himself to destroy the Master Mold.\n* '''Mark II''' - Created by [[Larry Trask (comics)|Larry Trask]]. This model was capable of adapting to and counteracting superpowers almost instantly. First appeared in ''X-Men'' #57.\n**'''No.2''', the robotic leader of Larry's Sentinels, later \"mutated\" with the capability of creating space warps.<ref>''The Avengers'' #102-104. Marvel Comics.</ref>\n* '''Composite''' - Created by merging the remaining portions of five Sentinels destroyed by the X-Men and came under control of Ashley Martin. It was destroyed by her when it rebelled against her.\n* '''Mark III''' - Created by [[Steven Lang (comics)|Stephen Lang]] and Project: Armageddon, secretly funded by [[Edward Buckman]] and the [[Hellfire Club (comics)|Council of the Chosen]]. Based on incomplete notes of Trask and inferior to Mark II. First appeared in ''X-Men'' #98.\n** '''X-Sentinels''' - Created by Stephen Lang. They are [[Android (robot)|android]]s who were duplicates of the original X-Men. First appeared in ''X-Men'' #99.\n* '''Mark IV''' - Created by [[Sebastian Shaw (comics)|Sebastian Shaw]]. First appeared in ''The Uncanny X-Men'' #151.\n* '''Mark V''' - Created by Sebastian Shaw for U.S. government's Project Wideawake. First appeared in ''The New Mutants'' #2.\n* '''Mark VI''' - Created by Shaw Industries for Project Wideawake and used by [[Onslaught (Marvel Comics)|Onslaught]]. Also incorporated parts of Project Nimrod.\n* '''Mark VII''' - Created by Shaw Industries. They were experimental and remote controlled.\n* '''[[Nimrod (comics)|Nimrod]]''' (later [[Bastion (comics)|Bastion]]) - A prototype Super Sentinel that arrived from the \"[[Days of Future Past]]\" timeline and was later reactivated by Reverend [[William Stryker]].\n** '''Project Nimrod''' - Created by an offshoot of Project Wideawake and was in the experimental stage, Project Nimrod was actually a self-awareness program that Nimrod implanted before its demise into the base's military computer cybernet, the program served as a sleeper virus that awaited the opportunity to access a Sentinel development program so it could use it to re-create Nimrod itself. Cancelled after [[X-Force]] interfered. \n* '''[[Prime Sentinel]]s''' - Created by [[Bastion (comics)|Bastion]] and ''[[Operation: Zero Tolerance]]''. They were at first disabled humans infected with Nano-Sentinel technology at Prospero Clinic under the believe that they were being equipped with cybernetic nanotech implants to replace their lost limbs. Unbeknownst to many of them, they became sleeper agents for Operation: Zero Tolerance, as they would, upon activation by a mutant attack or near the presence of one, transformed into armored beings with powerful weapons systems.\n[[File:Sentinel Marvels Vol 1 2.png|thumbnail|250px|Sentinels in ''Marvels'' #2 (February 1994). Art by Alex Ross.]]\n** '''Omega Prime Sentinels''' - The second generation of Prime Sentinels. Often simply called Omega Sentinels, their nanotechnology is far afield's in advancement to their brethren. Omega's have an 8 step cycle of transformation they undergo before transmuting from full organic to complete machine entities; which are Infection, Nesting, Replication, Dormancy, Activation, Union, Adaptation and finally Omega.<ref>''House of X'' #3. Marvel Comics.</ref> [[Karima Shapandar]] is one of them.\n* '''Wild Sentinels''' - Built in secret by a new Master Mold in Ecuador, activated by Donald Trask III and used by [[Cassandra Nova]]. New units are produced based on the currently available resources – salvaged parts, weapons and sometimes even entire vehicles – which give this particular type of Sentinel a very diverse, rag-tag appearance. Due to both this and their design flexibility, a wide variety of different shapes and forms have been observed. The Mega-Sentinels used to destroy [[Genosha]] and Nanosentinels both belong to this kind of Sentinel. The technology used in Nano-Sentinels is also employed by [[Weapon Plus]] for their artificial evolution experiments and the creation of their Super-Sentinels.\n* '''Mark VIII''' - Sentinel Squad [[Office of National Emergency|O*N*E]], designed by [[Iron Man|Stark Enterprises]]. Unlike other Sentinels, the Mark VIII requires a human pilot.\n** '''T.O. Sentinels''' - An intended upgrade to the Squad O*N*E sentinels conceived of by director Robert Callahan, who sought to use techno-organic substance to increase the effectiveness of his Sentinel program.<ref>''Astonishing X-Men'' vol. 3 #9-10. Marvel Comics.</ref> Failing in his first attempt he would get a second chance after obtaining the Warlock infected New Mutants to use as experimental fodder for further technoforming augmentation to his Sentinel Squad Armor unit.<ref>''New Mutants: Dead Souls'' #6. Marvel Comics.</ref><ref>''Uncanny X-Men'' vol. 5 #19. Marvel Comics.</ref>\n* '''Bio-Sentinels''' - Human mutant corpse infected by a technological virus created by Kaga,<ref>''Astonishing X-Men'' vol. 3 #31. Marvel Comics.</ref> They come with the innate capacity of weaponizing bio-technological apparati such as Brood designed missiles as a means of offense.<ref>''Astonishing X-Men'' vol. 3 #32. Marvel Comics.</ref>\n* '''Stark Sentinels''' - The Stark Sentinels debuted during the ''[[AXIS (comics)|AXIS]]'' storyline. Under the influence of the [[Red Skull]] (who also had erased from him any memory of their construction), [[Iron Man|Tony Stark]] created a model of Adamantium constructed Sentinels outfitted with Pym Particle technology with databases withholding knowledge of different super heroes he acquired after the 1st ''[[Civil War (comics)|Civil War]]'' storyline.<ref>''Avengers & X-Men: AXIS'' #1. Marvel Comics.</ref> When Red Skull became the Red Onslaught, and the Avengers arrived to Genosha to stop him, he deployed the Stark Sentinels.<ref>''Avengers & X-Men: AXIS'' #3. Marvel Comics.</ref>\n* '''Mother Mold''' - A self-aware and capable of adaptation Master Mold variant head designed to create \"Master Molds\" which in turn create Sentinels. Built in secrecy near the sun by a human group called Project Orchis which is made up of various members of human organizations such as A.I.M., S.H.I.E.L.D., Hydra, Alpha Flight and others, once coming online, Mother Mold will lead directly to the creation of Nimrod, the ultimate nanotechnological Sentinel form.<ref>''Powers of X'' #2. Marvel Comics.</ref>\n** '''[[Nimrod (comics)|Nimrod the Hunter]]''' - Created in the modern era solely from contemporary technology and independent of its time-travelling counterparts by Dr. Alia Gregor on Orchis's Mother Mold\n\n===Related mutant-hunting creations===\n[[File:Sentinel X-Men Schism Vol 1 1.png|thumbnail|250px|The X-Men battle Sentinels in ''X-Men: Schism'' #1 (July 2011). Art by Carlos Pacheco and Cam Smith.]]\n* '''Tri-Sentinel''' - A giant-sized, six-armed, three-faced combination of three fairly standard Sentinels (created by Shaw Industries) bonded together by [[Loki (Marvel Comics)|Loki]] as retribution for losing the \"[[Acts of Vengeance]]\" ploy, and defeated by [[Spider-Man]] at the peak of his cosmic ([[Captain Universe]]) powers. Later revived by The Life Foundation, only to be destroyed again by Spider-Man and [[Nova (Richard Rider)|Nova]]. [[Mendel Stromm]] later obtained another one from the bunker of the bankrupt Life Foundation and was later approached by a [[Kindred (Marvel Comics)|mysterious benefactor]] who prepared to give him a Master Mold that specializes in creating Tri-Sentinels.\n* '''Soviet Sentinels''' - Created by the Soviet Union and later purchased by Cuban government officials.''<ref>''Mystique'' #3-6. Marvel Comics.</ref>{{Full citation needed|date=July 2018}}\n* '''Super-Sentinels''' - Using [[Nanotechnology|Nano-Sentinel technology]], [[Weapon Plus]] created artificially evolved superhumans at ''[[Weapon Plus#The World|The World]]''. Three of the creations were chosen to form the mutant-hunting Super-Sentinels: Huntsman, [[Fantomex]] and Ultimaton, who were intended to be presented to the public as superheroes to make the extermination of mutantkind look \"like a Saturday morning cartoon\".\n* '''Colcord's Sentinels''' - Some of the Boxbots created by [[Madison Jeffries]] (aka Box) to serve the [[Weapon X]] Program, run by [[Malcolm Colcord]]. In one variation of the ''[[Days of Future Past]]'' timeline seen in the ''Weapon X: Days of Future Now'' limited series, one of the Boxbots evolves into a new Master Mold and a new breed of Sentinels.\n* '''Hardaway''' - A cyborg created at Camp Hayden, killed by the [[Mutant Liberation Front]], who called himself a Bio-Sentinel.\n* '''X-51 ([[Machine Man]])''' - Captured by Bastion and \"infected\" with Prime Sentinel nano-bots which reconfigured and reconstructed his systems thereby giving him similar capabilities to Nimrod,<ref>''Cable and Machine Man'' Annual 1998</ref><ref>''Machine Man & Bastion'' Annual 1998 #3</ref> such as adapting to almost any situation and programming that at times forced him to attack mutants.<ref>''X-51'' #1-2 (1999). Marvel Comics.</ref> \n* '''[[Juston Seyfert]]'s Sentinel''': First appearing in ''[[Sentinel (comic book)|Sentinel]]'' #1, this is a rebuilt Sentinel (likely a Mark V or Mark VI), reprogrammed to obey Juston Seyfert. Initially, Seyfert controlled the Sentinel by riding on its shoulder; he now has built a cockpit into it. Seyfert and his Sentinel are former members of [[Avengers Academy]] and featured in ''[[Avengers Arena]]''.\n* '''Sentinaughts''' - One of the types of sentient robots who live in the free robot city of The Core,<ref>''Secret Avengers'' #26</ref>{{Full citation needed|date=July 2018}} Sentinaughts are apparently based on the Sentinel design. They vary in size from roughly human to the large stature of traditional Sentinels.\n* '''Nano-Sentinel''' - Microscopic sentinel type of tech created by [[Cassandra Nova]] and implemented in various ways by other users.<ref>''New X-Men #123</ref> Moving within the body and attaching themselves to the brains of humans and mutants alike, turning them into mutant-hating assault drones with no self control. Ready to take down any mutant who so much as looks at them.<ref>''X-Men: Red'' #5</ref>\n** An unknown form of human made sentinels created by Simon Trask using a nanite based Sentinel Tech virus. The victims become anti-mutant activists who later, at Trask's command, are fully transformed into lifeless robotic Sentinels mindlessly following Trask's orders.<ref>''The Uncanny X-Men'' #500. Marvel Comics.</ref>\n* '''Adamantium Cyborgs''' - Near-fully mechanical mutant hunter killers refitted by Weapon X with the titular metal as an endoskeleton using sentinel based nanotech. Coming in numerous alphabetical categorical batches, these bionic weapons can shed their skin revealing a murderous automaton with the abilities of various X-Men heroes & villains integrated into them.<ref>''Weapon X'' vol. 3 #1. Marvel Comics.</ref>\n* '''Core/Central Command''' - A biotech Master Mold variant behind the design parameters of the new Prime Sentinel's.<ref>''The Uncanny X-Men'' vol. 4 #15. Marvel Comics.</ref>\n\n==Other versions==\nThe following are alternative versions of the Sentinels, which appear outside of regular [[Marvel Universe|Marvel canon]].\n\n===Age of Apocalypse===\nIn the \"[[Age of Apocalypse]]\" timeline, Bolivar Trask created the Sentinels with his wife [[Moira MacTaggert|Moira]]. These Sentinels are equipped with several body-mounted gun turrets, and their primary directive is to protect humans rather than to hunt mutants.{{Citation needed|date=December 2017}} They are capable of cooperating with mutants to further this mission.<ref>''Amazing X-Men'' #2. Marvel Comics.</ref>{{Full citation needed|date=July 2018}} Later, the Sentinels are adapted by Weapon Omega to serve a reverse purpose, and now aid in the hunting of the human race.<ref>''Uncanny X-Force'' #11. Marvel Comics.</ref>{{Full citation needed|date=July 2018}}\n\n===Days of Future Past===\nIn the \"[[Days of Future Past]]\" timeline, which takes place in an alternate future, the \"Omega Sentinels\" have advanced technologically and become the ''de facto'' rulers of the [[United States]]. The most powerful among them is [[Nimrod (comics)|Nimrod]].{{issue|date=December 2012}}\n\n===Hembeck===\nIn the joke comic ''[[Fred Hembeck]] Destroys the Marvel Universe'', the X-Men are killed by silent, black, man-sized \"[[Ninja]] Sentinels\".\n\n===Here Comes Tomorrow===\nIn the \"[[Here Comes Tomorrow]]\" future timeline, a Sentinel named '''Rover''' is [[Sentinel (comic book)|Tom Skylark's]] companion and protector. After more than 150 years of being active, Rover has become self-aware and, possibly, capable of emotion.{{issue|date=December 2012}}\n\n===House of M===\nIn the ''[[House of M]]'' storyline, [[Magneto (Marvel Comics)|Magneto]] is victorious in a mutant/human war. The Sentinels are adapted by [[Sebastian Shaw (comics)|Sebastian Shaw]], now the director of [[S.H.I.E.L.D.]], to serve a reverse purpose, and now aid in the hunting of sapien rebels.{{issue|date=December 2012}}\n\n===MC2===\nIn the [[Marvel Comics 2|MC2]] timeline, [[Wild Thing (comics)|Wild Thing]] encounters a Prime Sentinel that has accidentally been activated by a faulty microwave.{{issue|date=December 2012}}\n\n===Ronin===\nIn the alternate reality of ''X-Men: Ronin'', the story is played out in Japan. A police unit called \"Sentinel Force\" designs, builds and pilots the robots. These are aesthetically similar to regular Sentinels, but each is subtly different from the others.{{issue|date=December 2012}}\n\n===Star Trek===\nIn the comic crossover ''[[X-Men]]/[[Star Trek]]: Second Contact'', the X-Men work with the crew of the [[USS Enterprise (NCC-1701-E)|''Enterprise''-E]] to battle [[Kang the Conqueror]]. An [[away team (Star Trek term)|away team]] composed of [[Jean-Luc Picard|Captain Picard]], [[Deanna Troi]], [[Nightcrawler (comics)|Nightcrawler]] and [[Colossus (comics)|Colossus]] encounter an approximation of the \"[[Days of Future Past]]\" timeline, in which the Sentinels have merged with the [[Borg (Star Trek)|Borg]].{{issue|date=December 2012}}\n\n===Ultimate Marvel===\nThe [[Ultimate Marvel]] version of Sentinels were created by Bolivar Trask, were already in action in the ''[[Ultimate X-Men]]'' story arc, hunting down and killing mutants on the streets, in a program apparently openly and publicly acknowledged by the U.S. government. Later on, there were also the '''New Sentinels''' that were sixty of S.H.I.E.L.D.'s top agents in Sentinel [[powered exoskeleton|battle armor]] and they were described to have enough hardware to take on a fleet of the old Sentinel models. A new breed of Sentinel robots, created by Trask under the [[Fenris (comics)|Fenris]] twins' orders, was later created. After the events of the [[Ultimatum Wave]], Nimrod Sentinels was deployed to hunt, capture or kill mutants that refused to turn themselves in. [[Jason Stryker|William Stryker, Jr.]], using Sentinel tech, later displayed an ability to summon a fleet of Sentinels after being attacked by the [[Shroud (comics)|Shroud]].<ref>''Ultimate Comics: X-Men'' #3-4</ref>{{Full citation needed|date=July 2018}}\n\n===What If?===\n* In ''[[What If (comics)|What If]]''... Starring [[Cannonball (comics)|Cannonball]]'s little brother Josh—and his pet Sentinel\", shows Josh (who would, in normal continuity, later become [[Icarus (comics)|Icarus]]) finding and adopting a Sentinel.<ref>''What If?'' vol. 2 #92</ref>{{Full citation needed|date=July 2018}}\n* In \"What if... Starring Secret Wars: 25 Years Later\", the children of Marvel heroes are teleported back to Earth where, sometime in the last 25 years, a variation of \"Days of Future Past\" is shown when the group is attacked by Sentinels.<ref>''What If?'' vol. 2 #114. Marvel Comics.</ref>{{Full citation needed|date=July 2018}}\n* In \"What if... Starring Juggernaut: The Kingdom of Cain\", [[Juggernaut (comics)|Juggernaut]] has killed the X-Men, and as a result there is no one to oppose the Sentinels, so the world is ravaged by them until they are destroyed by Juggernaut.<ref>''What If?'' vol. 2 #94. Marvel Comics.</ref>\n\n==In other media==\n{{In popular culture|section|date=November 2017}}\n{{See also|Master Mold#In other media}}\n\n===Television===\n* A Sentinel appears in a flashback depicted in the ''[[Spider-Man and His Amazing Friends (1981 TV series)|Spider-Man and His Amazing Friends]]'' episode \"A Firestar Is Born\".\n* The Sentinels appear in ''[[X-Men: The Animated Series]]'', voiced by [[David Fox (actor)|David Fox]]. Introduced in season one, this version of the Sentinel program is controlled by [[Bolivar Trask]] and [[Henry Peter Gyrich]] and was cancelled before being transferred to [[Genosha]], with [[Master Mold]] being constructed as the Sentinels' leader/mass-production unit. While the Sentinels were seemingly destroyed by [[Storm (Marvel Comics)|Storm]], a possible future depicts them as having taken over the world and successfully putting mutants on the verge of extinction. In the season one finale, Master Mold takes over the Sentinels from Trask and Gyrich's secret U.S. facility in an attempt to kidnap world leaders and replace their brains with computers to bring them under its control. However, [[Professor X]] and [[Magneto (Marvel Comics)|Magneto]] join forces to seemingly destroy Master Mold. Following this, the Sentinels and Master Mold make sporadic minor appearances in season four.\n* The Sentinels appear in the ''[[Spider-Man (1994 TV series)|Spider-Man]]'' episode \"The Mutant Agenda\" as a [[Danger Room]] simulation.\n* The Sentinels appear in ''[[X-Men: Evolution]]''.{{Citation needed|date=April 2009}} These versions are much more powerful and heavily armed than their comic book counterparts. A prototype that Trask created and Magneto used to attack the X-Men and reveal mutant existence to the media appears first, followed by three upgraded models that [[S.H.I.E.L.D.]] use against [[Apocalypse (character)|Apocalypse]]. Additionally, [[Nimrod (comics)|Nimrod]] and a fleet of Sentinels appear in a vision of the future depicted in the series finale.\n* The Sentinels appear in ''[[Wolverine and the X-Men (TV series)|Wolverine and the X-Men]]'', voiced by [[Jim Ward (voice actor)|Jim Ward]]. This version of the Sentinel program consists of [[Spider-Slayer|Sentinel Prowler]]s, Mark I Sentinels, unnamed futuristic Sentinels, and Sentinel Hounds, all controlled by Master Mold. Additionally, a reprogrammed Sentinel nicknamed \"Rover\" appears in a self-titled episode as an associate of the future X-Men.\n* The Sentinels appear in ''[[The Super Hero Squad Show]]'' episode \"Days, Nights and Weekends of Future Past! (Six Against Infinity Part 2)\", voiced by [[Tom Kenny]].<ref name=\"btva\">{{cite web|title=Sentinel Voice - X-Men franchise <nowiki>|</nowiki> Behind The Voice Actors|url=https://www.behindthevoiceactors.com/characters/X-Men/Sentinel/|website=behindthevoiceactors.com|date=December 19, 2019|postscript=. Check mark indicates role has been confirmed using screenshots of closing credits and other reliable sources.}}</ref> These versions were created in a possible future where the [[Scarlet Witch]] became a dictator to defend Super Hero City.\n* A Sentinel appears in ''[[Marvel Anime|Marvel Anime: X-Men]]'' as a Danger Room simulation.\n* A Sentinel appears in the ''[[Ultimate Spider-Man (TV series)|Ultimate Spider-Man]]'' episode \"Game Over\" as a part of [[Arcade (Marvel Comics)|Arcade]]'s Madland.\n* A Sentinel appears in ''[[Marvel Disk Wars: The Avengers]]''.\n* The Sentinels appear in ''[[The Gifted (U.S. TV series)|The Gifted]]''.<ref>{{cite web|last1=Schwartz|first1=Terri|title=Legion: X-Men Producer on How Professor X Fits In and Future TV Plans|url=http://www.ign.com/articles/2017/01/16/legion-x-men-producer-on-how-xavier-fits-in-and-future-tv-plans|website=IGN|access-date=5 November 2017|date=16 January 2017}}</ref> These versions are small spider-like robots created by Trask Industries to withstand various forms of hazardous environments and attacks as well as adapt quickly to damage taken. Additionally, a similarly named government agency called '''Sentinel Services''' appears throughout the series.\n\n===Films===\n{{main article|X-Men (film series)}}\n\n[[File:X-Men Days of Future Past - Sentinels.jpg|right|200px|thumb|The Sentinels as they appear in ''[[X-Men: Days of Future Past]]'' (2014); the Mark I model in 1973 (left) and the Mark X model in 2023 (right)]]\n* The Sentinels were originally meant to appear in ''[[X-Men (film)|X-Men]]'' (2000). In an early draft written by [[Andrew Kevin Walker]] and turned in during June 1994, [[Henry Peter Gyrich|Henry Gyrich]] and [[Bolivar Trask]] use three 8 feet (2.4 m) tall Sentinels to attack the [[X-Men]].<ref>{{cite news |first=Andrew Kevin |last=Walker |author-link=Andrew Kevin Walker |title=X-Men First Draft |url=http://www.dailyscript.com/scripts/x-men_walker3.html |website=Daily Scripts |access-date=July 13, 2007 |archive-url=https://web.archive.org/web/20190726144619/http://www.dailyscript.com/scripts/x-men_walker3.html |archive-date=July 26, 2019 |date=June 7, 1994 |url-status=live}}</ref> Following several rewrites and new scripts, the Sentinels were eventually dropped from the film.<ref>{{cite web |last1=Kendall |first1=Gene |title=15 Rejected X-Men Movie Ideas That Almost Happened |url=https://www.cbr.com/x-men-movie-moments-that-almost-happened/ |website=[[Comic Book Resources]] |publisher=Valnet Inc. |access-date=July 26, 2019 |archive-url=https://web.archive.org/web/20190726150301/https://www.cbr.com/x-men-movie-moments-that-almost-happened/ |archive-date=July 26, 2019 |date=March 10, 2017 |url-status=live}}</ref>\n* A Sentinel appears in ''[[X-Men: The Last Stand]]'' (2006) as a Danger Room simulation.\n* Two variations of the Sentinels appear in ''[[X-Men: Days of Future Past]]'' (2014).<ref>{{cite web|author1=CS|title=Mark Millar Talks X-Men: Days of Future Past and Kick-Ass 3|url=http://www.comingsoon.net/news/movienews.php?id=99760|website=ComingSoon.net|access-date=5 November 2017|date=1 February 2013}}</ref><ref>{{cite web|url=http://www.fxguide.com/featured/future-threat-x-men-days-of-future-past/|title=Future threat – X-Men: Days of Future Past|publisher=Fxguide|first=Ian|last=Failes|date=May 27, 2014|access-date=October 16, 2014}}</ref><ref>{{cite AV media|title=Sentinels: For a Secure Future|location=''X-Men: Days of Future Past'' Blu-ray|year=2014|publisher=20th Century Fox Home Entertainment}}</ref><ref>{{cite video|title=Sentinels: For a Secure Future|location=''X-Men: Days of Future Past'' Blu-ray|year=2014|publisher=20th Century Fox Home Entertainment|format=Featurette}}</ref> The prototype Mark I Sentinels were designed by [[Legacy Effects]] with [[Digital Domain]] building digital models based on a full-scale practical model while the future Mark X variants were computer graphics made by [[Moving Picture Company]]. In the film, the prototypes are said to be built using space-age polymers and are equipped with chest-mounted vent-like structures that grant flight capabilities as well as arm-mounted Gatling guns while the future Sentinels have become smaller, sleeker, and built with adaptive mechanical scales and hands that can reform into blades. This version of the Sentinel program was originally created in the 1970s, with Bolivar Trask experimenting on mutants to accelerate his research, though he found little success in gaining support for his project. After [[Mystique (character)|Mystique]] assassinated Trask in 1973, the U.S. government approved the Sentinel program, captured Mystique, and experimented on her to give the Sentinels the ability to adapt and utilize mutant powers. However, they subsequently target humans due to their potential for having mutant descendants, culminating in a dystopian future where most of humanity and mutantkind are nearly extinct by 2023. Using [[Kitty Pryde]]'s new ability to project the minds of others into their past selves, the surviving X-Men project [[Logan (film character)|Logan]]'s mind back into his 1973 self to rally [[Charles Xavier (film character)|Charles Xavier]] and [[Magneto (film character)|Erik Lehnsherr]]'s younger selves and avert Trask's assassination. Mystique defeats Lehnsherr, but Xavier and [[Hank McCoy]] convince her not to kill Trask, causing the U.S. government to realize that not all mutants are a threat to humanity and abandon the Sentinel program.\n* The 1973 Sentinels from ''X-Men: Days of Future Past'' make a cameo appearance in ''[[X-Men: Apocalypse]]'' (2016) as Danger Room simulations.\n\n===Video games===\n[[File:Xm-coa.png|right|200px|thumb|Sentinel (right) fighting [[Wolverine (character)|Wolverine]] in ''[[X-Men: Children of the Atom (video game)|X-Men: Children of the Atom]]''.]]\n* The Sentinels appear in the ''[[X-Men (arcade game)|X-Men]]'' arcade game.\n* The Sentinels appear in ''[[Spider-Man/X-Men: Arcade's Revenge]]'' as part of [[Cyclops (Marvel Comics)|Cyclops]]'s levels.\n* The Sentinels appear as [[boss (video games)|bosses]] in ''[[X-Men: Mutant Apocalypse]]'' as part of the [[Genosha]] stage.\n* The Sentinels appear in ''[[X-Men 2: Clone Wars]]''.\n* A non-standard 10' tall Sentinel appears as a [[player character|playable character]] in ''[[X-Men: Children of the Atom (video game)|X-Men: Children of the Atom]]''.\n* A non-standard 10' tall Sentinel appears as a secret assist character in ''[[Marvel vs. Capcom: Clash of Super Heroes]]''.\n* A non-standard 10' tall Sentinel appears as a playable character in ''[[Marvel vs. Capcom 2: New Age of Heroes]]''.\n* The Sentinels appear in ''[[X-Men: Mutant Academy]]'' as part of Cyclops's intro.\n* The Sentinels appear as background characters in ''[[X-Men: Mutant Academy 2]]''.\n* The Sentinels appear in ''[[X-Men: Next Dimension]]'', with a male and female Prime Sentinel available as playable characters.\n* The Sentinels appear in ''[[X-Men Legends]]'' , voiced by [[Scott MacDonald (actor)|Scott MacDonald]].<ref name=\"btva\"/> This version of the Sentinel program includes regular Sentinels, Sentinel Alpha, a Sentinel Controller, a Sentinel Weapons Platform, and a Sentinel Advanced.\n* The Sentinels appear in ''[[X-Men Legends II: Rise of Apocalypse]]''.\n* The Sentinels appear in ''[[X-Men: The Official Game]]''. This version of the Sentinel program includes a small flight-capable model and a walking behemoth.\n* The Sentinels appear in ''[[X-Men Origins: Wolverine (video game)|X-Men Origins: Wolverine]]'', with a Mark I model appearing as a boss.\n* A non-standard 10' tall Sentinel appears as an unlockable playable character in ''[[Marvel vs. Capcom 3: Fate of Two Worlds]]'' and ''[[Ultimate Marvel vs Capcom 3]]'', voiced again by Jim Ward. In its arcade mode ending, it uploads [[Master Mold]]'s program into [[Galactus]]'s warship with the intention of killing mutants and humanity via Galactus-inspired Sentinels.\n* The Sentinels appear in ''[[X-Men Destiny]]''.\n* The Sentinels appear in ''[[Marvel: Avengers Alliance]]''. This version of the Sentinel program includes several Sentinel models named after the [[Titans]]. Additionally, the [[Brotherhood of Mutants]] employ M-Series Sentinels while the [[Hellfire Club (comics)|Hellfire Club]] hired the [[Crimson Dynamo]] to build Sentinels loyal to them.\n* The Sentinels appear in ''[[Marvel Heroes (video game)|Marvel Heroes]]''.\n* The Sentinels appear in ''[[Deadpool (video game)|Deadpool]]''.\n* The Sentinels appear in ''[[Lego Marvel Super Heroes]]'', voiced by [[Stephen Stanton]].<ref>{{cite tweet|user=JoeMooreDesign|author=Joe Moore|number=358357245752385536|date=19 July 2013|title=Sentinels in #LEGO #Marvel Super Heroes! @arthur_parsons just said so! ^_^|access-date=5 November 2017}}</ref> Additionally, a Mini-Sentinel appears an unlockable playable character.\n* A Sentinel appears as a playable character in ''[[Marvel: Future Fight]]''.\n* The Sentinels appear as playable and non-playable characters in ''[[Marvel Contest of Champions]]''.\n* The Sentinels appear in ''[[Marvel Ultimate Alliance 3: The Black Order]]'', with a [[Infinity Gems|Power Stone]]-enhanced variant known as the '''Infinity Sentinel''' serving as a boss.<ref>[https://www.polygon.com/2019/5/23/18637577/marvel-ultimate-alliance-3-xmen-trailer-nintendo-switch no info] given</ref><ref>{{Cite web | url=https://www.polygon.com/2019/5/23/18637577/marvel-ultimate-alliance-3-xmen-trailer-nintendo-switch |title = X-Men get some love in the new Marvel Ultimate Alliance 3 trailer|website = [[Polygon (website)|Polygon]]|date = 2019-05-23}}</ref> [[Ultron]] utilizes them to steal the Infinity Stones from the [[Avengers (comics)|Avengers]] and the X-Men until the Sentinels are destroyed by the heroes.\n* The Sentinels appear as an unnamed landmark in ''[[Fortnite Battle Royale]]''.\n\n===Toys===\n* A 10\" Sentinel figure was released in Toybiz's [[X-Men Classics]] line.\n* A Sentinel \"Build-A-Figure\" based on the \"[[Here Comes Tomorrow]]\" incarnation was released in wave ten of the ''[[Marvel Legends]]'' line.\n* In 2010, Hasbro released a large Sentinel figure that was available in two color schemes as part of the Marvel Universe line.\n* [[Minimates]] released a statue and two Sentinel figures, with the figure figure depicting it fighting [[Rachel Summers]] as either Phoenix or Marvel Girl and the second, which is based on its appearance in ''[[Marvel vs. Capcom 3: Fate of Two Worlds]]'', fighting [[Ryu (Street Fighter)|Ryu]].\n* In 2014, Lego released the \"X-Men vs. the Sentinel\" set, which features a Sentinel as a buildable figure.\n* In July 2020, Hasbro announced a twenty-six inch Sentinel as part of their HasLab crowdfunding releases.\n\n===Parodies===\n* In the ''[[Robot Chicken]]'' episode \"Sausage Fest\", a Sentinel kills the X-Men, leading to Professor X recruiting the cast of the ''[[Police Academy (film series)|Police Academy]]'' films as replacements. After the Sentinel defeats them, it and Professor part ways on good terms, agreeing to another fight next week.\n* The ''[[Codename: Kids Next Door]]'' episode \"Operation S.A.F.E.T.Y.\" features giant Safety-bots built by Senator Safely to prevent children from playing harmful games. However, the main robot captures adults as well because of their potential for harming kids and attempts to take over the world, only to be forced to self-destruct by Numbah 4, who believed the robot had injured his little brother despite its protocols and called it out on it.\n* ''[[Mad (magazine)|MAD Magazine]]''{{'}}s parody of the X-Men, the \"ECH!-Men\", features a Sentinel parody called the \"Sentinent\".\n\n==References==\n{{Reflist}}\n\n==External links==\n*{{Marveldatabase|Sentinels (Earth-616)|Sentinels}}\n*[https://www.marvel.com/teams-and-groups/sentinels Sentinels] at Marvel.com\n{{X-Men characters}}\n{{Ultimate X-Men}}\n{{New Mutants}}\n{{X-Comics}}\n{{Stan Lee}}\n{{Jack Kirby}}\n\n{{DEFAULTSORT:Sentinel (Comics)}}\n[[Category:Villains in animated television series]]\n[[Category:Characters created by Jack Kirby]]\n[[Category:Characters created by Stan Lee]]\n[[Category:Comics characters introduced in 1965]]\n[[Category:Fictional private military members]]\n[[Category:Marvel Comics characters with superhuman strength]]\n[[Category:Marvel Comics film characters]]\n[[Category:Marvel Comics robots]]\n[[Category:Marvel Comics supervillains]]\n[[Category:X-Men supporting characters]]"}]}}}}