{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes. Use [[Special:ApiFeatureUsage]] to see usage of deprecated features by your application."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"normalized": [{"from": "Shepard_(comics)", "to": "Shepard (comics)"}], "pages": {"6425865": {"pageid": 6425865, "ns": 0, "title": "Shepard (comics)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Unreferenced|date=December 2009}}\n{{Infobox comics character| <!--Wikipedia:WikiProject Comics-->\nimage=Francis Leighton (Earth-616) from Mystique Vol 1 20.png\n|caption=\n|character_name=Shepard\n|real_name=Francis Leighton\n|species=[[Mutant (Marvel Comics)|Human Mutant]]\n|publisher=[[Marvel Comics]]\n|debut=''Mystique'' #6 (Nov. 2003)\n|creators=[[Brian K. Vaughan]]<br>[[Jorge Lucas]]\n|alliances=[[X-Corporation]]\n|powers=Project concussive ''black bile'' from his eyes. Unconfirmed regenerative powers\n}}\n\n'''Shepard''' ('''Francis Leighton''') is a fictional [[Mutant (Marvel Comics)|mutant]] villain appearing in [[American comic book]]s published by [[Marvel Comics]]. His first appearance was in ''Mystique'' #6.\n\n==Fictional character biography==\nShepard first approached [[Mystique (comics)|Mystique]] in [[Cuba]] and tried to convince her to turn against [[Professor X|Charles Xavier]], that he and his employer could give her protection. Shepard gave her a necklace to contact him with and vanished. He continuously appeared and reappeared, always knowing where she was, stirring up trouble for Xavier's newest agent. It was later revealed he was helping Shortpack to track down the murderer of [[Prudence (comics)|Prudence Leighton]], an arms dealer called [[Steinbeck]] and had insight into all Mystique's missions to some degree.{{issue|date=December 2012}}\n\nShepard reported back to The Quiet Man (whom he referred to as \"beloved\") and tried to manipulate Mystique at every turn, finally succeeding at one point. Shepard believed he had totally duped Mystique and even bore witness to her murdering [[Fantomex]] and [[Fantomex|E.V.A]] on a beach apparently to protect their secret.{{issue|date=December 2012}}\n\nShepard eventually saw Mystique as no longer useful when her cloaking device was turned off so he held Shortpack hostage having lured the little mutant to the Quiet Man's lair. Mystique failed but somehow fled [[Genosha]] at supersonic speed. When Shepard tracked her down to New York he pulled a gun on her to finish the job, believing she was disguised as Fantomex.{{issue|date=December 2012}}\n\nActually Mystique had duped Shepard, and had communicated a plan to Fantomex on a sub-aural level that he could hear but others could not - by morphing her vocal cords. She and Fantomex grabbed Shepard and Fantomex revealed that Shepard was in fact Prudence's brother, who had joined hIS sister, who now inhabited the body of Steinbeck and had taken on the ''Quiet Man'' identity. Mystique chopped off Shepard's hand to get at his teleporter watch and went to deal with The Quiet Man.{{issue|date=December 2012}}\n\nThe revelation of Prudence being the Quiet Man and being referred by Shepard as beloved hints a past incestuous relationship between the two.{{Citation needed|date=December 2012}}\n\n==Powers and abilities==\nProjects \"black bile\" as a concussive effect from his eyes. It is possible that he also had hyper-regeneration powers, as his hand was chopped but he later appeared with said hand, though it remains possible it was a simple mistake from the artists.\n\n==References==\n{{reflist}}\n\n{{DEFAULTSORT:Shepard (Comics)}}\n[[Category:Characters created by Brian K. Vaughan]]\n[[Category:Fictional secret agents and spies]]\n[[Category:Marvel Comics mutants]]\n[[Category:Marvel Comics supervillains]]"}]}}}}