{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes. Use [[Special:ApiFeatureUsage]] to see usage of deprecated features by your application."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"pages": {"2177806": {"pageid": 2177806, "ns": 0, "title": "Silvermane", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Short description|Marvel Comics fictional character}}\n{{Infobox comics character| <!--Wikipedia:WikiProject Comics-->\n| image = Silvermane-head.jpg\n| caption = Silvermane's disembodied head.<br />Art by Al Milgrom.\n| character_name = Silvermane\n| publisher = [[Marvel Comics]]\n| debut = ''[[The Amazing Spider-Man]]'' #73 (June 1969)\n| creators = [[Stan Lee]] (writer)<br>[[John Buscema]] (artist)\n| real_name = Silvio Manfredi\n| alliances =[[Maggia (comics)|The Maggia]]<br>[[Hydra (comics)|HYDRA]]\n| aliases =Supreme Hydra\n| powers =Superb hand to hand combatant<br>Excellent marksman<br>Brilliant strategist and organizer<br>Superhuman strength and senses via cyborg body<br>Use of various handguns \n}}\n'''Silvermane''' ('''Silvio Manfredi''') is a <!--Do not add \"fictional\" as it is tautological; supervillains (and characters in general) are by definition implied to be fictionalized to some extent.-->[[supervillain]] appearing in [[American comic book]]s published by [[Marvel Comics]]. A notorious [[crime boss]] and prominent figure in the [[Maggia (comics)|Maggia]], a fictional [[organized crime]] syndicate, he is usually depicted as an adversary of the [[superhero]] [[Spider-Man]] and the father of [[Blackwing (character)|Joseph Manfredi]].<ref>{{cite book |last =Rovin |first =Jeff |title =The Encyclopedia of Supervillains |publisher =Facts on File |date =1987 |location =New York |isbn = 0-8160-1356-X |page=316}}</ref> Silvermane later became a [[cyborg]] in an attempt to extend his lifespan.\n\nThe character has made appearances in several forms of media outside of comics, including animated series and video games.\n\n==Publication history==\nHe first appeared in ''[[The Amazing Spider-Man]]'' #73<ref>{{cite book|last = Manning|first = Matthew K.|last2= Gilbert|first2= Laura, ed.|chapter= 1960s|title = Spider-Man Chronicle Celebrating 50 Years of Web-Slinging|publisher = [[Dorling Kindersley]]|year = 2012|page = 48|isbn = 978-0756692360|quote= [Man Mountain Marko] wasn't the biggest threat the web-slinger would face in this issue. That honor went to Silvermane, an elderly crime boss intent on regaining his youth.}}</ref> and was created by [[Stan Lee]] and [[John Buscema]].\n\nThe character's original storyline was about a mysterious stone tablet coveted by several ''Spider-Man'' villains. The \"Tablet Saga\" proved popular, although artist [[John Romita, Sr.]] said that it was not originally intended as an arc: \"We never even thought up Silvermane until the seventh issue [of the story arc], let alone a 'socko' ending.\"<ref>{{cite book |last1=Wells |first1=John |title=American Comic Book Chronicles: 1965-1969 |date=2014 |publisher=TwoMorrows Publishing |isbn=978-1605490557 |page=270}}</ref>\n\n==Fictional character biography==\nSilvio Manfredi, nicknamed \"Silvermane\" for his near-white hair, is a professional [[criminal]] originally from [[Corleone]], [[Sicily]] that started his criminal career as a racketeer in the [[Maggia (comics)|Maggia]], eventually forming his own crime family and becoming a powerful Maggia Don.\n\nIn his first appearance, an elderly Silvermane forced [[Lizard (comics)|Dr. Curt Connors]] to make a potion from an ancient clay tablet in order to grant himself immortality. He first crossed paths with Connors' alter-ego, the Lizard, and [[Spider-Man]] during this scheme. Drinking the serum made Silvermane younger, but its effects caused him to de-age further and further until he was a infant before completely disappearing.<ref>''[[The Amazing Spider-Man]]'' #73-75. marvel Comics.</ref> Silvermane eventually reappeared, revealing that he had mystically aged to his forties. He started a new career and again quickly rose through the Maggia's ranks until he regained control of his family, the sought to form an alliance with [[Hydra (comics)|Hydra]], determined to take over the world as their leader, the Supreme Hydra. He was defeated by [[Daredevil (Marvel Comics character)|Daredevil]], [[Nick Fury]] and [[S.H.I.E.L.D.]]<ref>''Daredevil'' #121-123. Marvel Comics.</ref> Silvermane reappeared in New York in an attempt to unite all of New York's gangs under his leadership and take over the criminal underworld, but his plans were complicated by the [[Green Goblin#Bart Hamilton|Green Goblin]], who opposed him. During a confrontation between the Goblin, Silvermane and Spider-Man, Silvermane fell from a great height but survived.<ref>''The Amazing Spider-Man'' #176-180. Marvel Comics.</ref>\n\nSilvermane has worked with many super-villains, such as [[Hammerhead (comics)|Hammerhead]], and he has also been known to be a rival of the [[Kingpin (comics)|Kingpin]], even once trying to assassinate the crime lord while he was suffering from amnesia.<ref>''The Amazing Spider-Man'' #197. Marvel Comics.</ref> His former partner, Dominic Tyrone, assumed the identity of the [[Rapier (comics)|Rapier]] and sought vengeance against Silvermane for betraying him by attempting to take his life.<ref>''[[The Spectacular Spider-Man]] Annual'' #2. Marvel Comics.</ref> A flashback one-shot focused heavily on Silvermane's lifetime of corruption and crime, going back to his early career in Italy. The framework was reporter [[Ben Urich]] investigating the background of the Maggia. He learned that Silvermane was a legendary criminal figure for decades; mothers would even warn their children to behave or \"One-Eye\" would get them.<ref>''Spider-Man: Made Men'' #1 (August 1998). Marvel Comics.</ref>\n\nIn his old age, Silvermane's injuries caused his youth serum to wear off, rendering him an invalid. Though bedridden, he continued to run his criminal empire until [[Cloak and Dagger (comics)|Dagger]] nearly killed him. Silvermane attempted to prolong his life by transforming himself into a [[cyborg]].<ref>''The Spectacular Spider-Man'' #69-70. Marvel Comics.</ref> Kingpin gained control of his cyborg body until Dagger restored his life energy to him.<ref>''The Spectacular Spider-Man'' #94-96. Marvel Comics.</ref> His cyborg body was badly damaged by the first [[Jack O'Lantern (Marvel Comics)|Jack O'Lantern]] during a gang war between Hammerhead and the Kingpin.<ref>''The Amazing Spider-Man'' #284. Marvel Comics.</ref> Silvermane used a remote-controlled android doppelganger to battle Spider-Man. This was part of an attempt to boost the power of his remaining organic parts by harvesting new ones from Spider-Man's body. He attempted to drain his nemesis's radioactive blood to power a new, much stronger cyborg body.<ref>''Web of Spider-Man'' #79-80. Marvel Comics.</ref> Silvermane also confronted [[Deathlok]] and the [[Punisher]] while setting up a major drug operation outside a grammar school.<ref>''Deathlok'' #8-9. Marvel Comics.</ref> Even though he is no longer technically human, he has continued to remain active in the Maggia.\n\nSilvermane attempted to take part in a meetup of various criminal warlords, during a time when Wilson Fisk had fallen from power. The meeting's goal was to divide up Fisk's territory and assets, but it did not go well. Silvermane was caught in the crossfire between the [[Secret Empire (organization)|Secret Empire]]'s forces and the Punisher. This was purely by coincidence as he was simply staying at the same motel as Punisher was. Silvermane used the resources of his personal semi-trailer and the cyborg bodies stored within to battle his way through the attackers and escape.<ref>''Punisher War Journal'' #46-48. Marvel Comics.</ref>\n\nIt was revealed some time later that Silvermane was killed during a shootout with [[Owl (Marvel Comics)|Owl]]'s gang at a New York City scrap yard. He was picked up by a magnet and dropped into a garbage compactor, crushing him to death and leaving his already weakened criminal syndicate without a leader. Months later, he apparently returns along with other deceased members of his gang during the Maggia's losing battle with the forces of [[Mister Negative]]. However, this is later revealed to be a ruse orchestrated by a mobster named Carmine: \"Silvermane\" is actually a lifelike robotic duplicate controlled by a hired [[Mysterio]] to give Carmine more influence within the Maggia and position him to take over. The tables are turned on Carmine when Mysterio uses the duplicate to murder him, seemingly as a plot to take over the Maggia himself.<ref>''The Amazing Spider-Man'' #618-620. Marvel Comics.</ref>\n\nSilvermane's head is shown to still be alive as it was found by a young boy when he traveled into the scrap yard, before then being stolen by the [[Shocker (comics)|Shocker]].<ref>''The Superior Foes of Spider-Man'' #3. Marvel Comics.</ref> The head is used as leverage by [[The Superior Foes of Spider-Man]] to take control of the Maggia, but the team members turn on each other when it comes time to decide who will actually be in charge. Shocker protects Silvermane from the [[Punisher]]. In return, the crime boss nominates him as his successor to head the Maggia.<ref>''The Superior Foes of Spider-Man'' #17. Marvel Comics.</ref>\n\nSilvermane is among the crime lords competing with Mister Negative in obtaining the Tablet of Life and Destiny in order to win the favor of Mayor Wilson Fisk.<ref>''The Amazing Spider-Man'' vol. 5 #59. Marvel Comics.</ref>\n\n==Powers and abilities==\nSilvermane is considered one of the Maggia's most legendary bosses. He was a superb hand-to-hand combatant, an excellent marksman, and a brilliant strategist and organizer. The use of magical potions temporarily granted him a form of immortality, allowing him to appear as a man in his early-to-mid 40s. His preferred weapons included various handguns and the Thompson .45 caliber machine gun. Later, Silvermane's brain, vital organs, and head were transplanted into a cyborg body, increasing his physical abilities and granting him superhuman strength and senses. However, Silvermane's remaining organic body parts are those of an elderly man, and thus extremely vulnerable.\n\n==Other versions==\n===Ultimate Marvel===\nThe [[Ultimate Marvel]] version of Silvermane had a brief cameo. With [[Kingpin (character)|Wilson Fisk]] lying low due to legal problems, Silvermane, his chief rival, decided to work with fellow mobster [[Hammerhead (comics)|Hammerhead]] to remove the Kingpin from power. He told Hammerhead that all he needed was a little \"up here\" (referring to his intelligence). Hammerhead, however, wasn't interested in sharing power, breaking Silvermane's neck while saying \"I think I got enough up here already.\"<ref name=\"auto\">''Ultimate Spider-Man'' #79. Marvel Comics.</ref> Silvermane was also mentioned as a leader of a mob family which included Hammerhead and that he owed a debt to [[Mister Sinister|Nathaniel Essex]].<ref>''Ultimate X-Men'' #14 (March 2002). Marvel Comics.</ref> The Ultimate incarnation's real name is shown in the ''Daily Bugle'' as '''Allan Silvermane''', though this is likely an alias as he is also referred to as Silvio Manfredi.<ref name=\"auto\"/>\n\n===House of M===\nSilvermane appeared in the ''[[House of M]]'' reality, portrayed as a younger crime boss and one of dozens of mobsters captured by the NYPD's elite [[Brotherhood of Mutants|Brotherhood]] unit.<ref>''House of M: Avengers'' #3. Marvel Comics.</ref>\n\n==In other media==\n===Television===\n[[File:Spidermanep25.jpg|right|thumb|Silvermane (left) and [[Tombstone (comics)|Tombstone]] in ''[[Spider-Man (1994 TV series)|Spider-Man: The Animated Series]]''.]]\n* Silvermane appeared in the 1980s ''[[Spider-Man (1981 TV series)|Spider-Man]]'' series episode \"Wrath of the Sub-Mariner\", voiced by [[Paul Winchell]].<ref name=\"BTVA\">{{Cite web|url=https://www.behindthevoiceactors.com/characters/Spider-Man/Silvermane/|title=Silvermane Voices (Spider-Man)|website=Behind The Voice Actors}}</ref>\n* Silvermane appeared in the 1990s ''[[Spider-Man (1994 TV series)|Spider-Man]]'' series, voiced by [[Jeff Corey]] as an old man,<ref name=\"BTVA\"/> [[Townsend Coleman]] as a young man,<ref>{{Cite web|url=https://www.behindthevoiceactors.com/tv-shows/Spider-Man-1994/Silvermane-Young/|title=Silvermane (Young)|website=Behind The Voice Actors}}</ref> Matthew McCurley as a child,<ref>{{Cite web|url=https://www.behindthevoiceactors.com/tv-shows/Spider-Man-1994/Silvermane-Boy/|title=Silvermane (Boy)|website=Behind The Voice Actors}}</ref> and Cannon Young as a baby.<ref>{{Cite web|url=https://www.behindthevoiceactors.com/tv-shows/Spider-Man-1994/Silvermane-Child/|title=Silvermane (Child)|website=Behind The Voice Actors}}</ref> This version is an enemy of Spider-Man and the Kingpin, the latter of whom serves as his rival in New York's criminal underworld, and is the father of Alisa Silver (voiced by [[Leigh-Allyn Baker]]). Following minor appearances in the episodes \"The Insidious Six\" and \"Battle of the Insidious Six\", Silvermane spends the episodes \"Tablet of Time\" and \"Ravages of Time\" obsessively locating the titular tablet, an artifact capable of rejuvenating an individual's youth, so he can achieve immortality due to his irregular childhood. After locating it, he arranges for [[Tombstone (character)|Tombstone]] to steal it, kidnap Dr. [[Lizard (character)|Curt Connors]] to decipher it, and take the scientist's family hostage to ensure his complicity. Though Spider-Man saves the Connorses and in spite of Dr. Connors' warning of the tablet's instability, Silvermane uses it to make himself a young man before he becomes a child and a baby, while [[Hammerhead (comics)|Hammerhead]] steals the Tablet on Kingpin's behalf. In the episode \"Partners\", due to being a baby despite retaining his adult intellect, Silvermane has Alisa help him persuade [[Alistair Smythe]] to kidnap the [[Black Cat (Marvel Comics)|Black Cat]] and blackmail Spider-Man into apprehending the [[Mac Gargan|Scorpion]] so Silvermane can use [[Neogenic (comics)|neogenic]] technology to switch bodies with the web-slinger. During the procedure however, the [[Vulture (Marvel Comics)|Vulture]] intervenes and takes Spider-Man's place, allowing the web-slinger, Black Cat, and Scorpion to escape. Following this, the Vulture becomes a young man while Silvermane returns to his original age.\n* Silvermane appears in ''[[The Spectacular Spider-Man (TV series)|The Spectacular Spider-Man]]'', voiced by [[Miguel Ferrer]].<ref name=\"BTVA\"/> This version is a rival crime lord to Tombstone and the father of [[Silver Sable|Sable Manfredi]]. The episode \"Accomplices\" revealed that he was arrested and jailed 12 years prior to the series after [[Frederick Foswell]] exposed his criminal activities to the [[FBI]]. Tombstone subsequently took his territory while Sable ran his empire's remnants in her father's absence. In the episode \"Gangland\", Silvermane joins a summit between him, Tombstone, and [[Doctor Octopus]]. After the meeting goes sideways and Spider-Man gets involved, Silvermane uses a hidden hydraulic exoskeleton to combat the web-slinger and the other crime bosses, only to be defeated by Spider-Man and apprehended by the police. As of the episode \"Opening Night\", Silvermane was remanded to the [[Vault (Marvel Comics)|Vault]]. Though he is released by the [[Norman Osborn|Green Goblin]] to kill Spider-Man while the web-slinger was there to test the prison's security system, [[Walter Hardy]] releases sleeping gas to subdue the prisoners.\n* Silvermane appears in the 2010s ''[[Spider-Man (2017 TV series)|Spider-Man]]'' series, voiced by [[Nolan North]].<ref name=\"BTVA\"/><ref>{{cite episode|title=Bring On the Bad Guys Pt. 3|series=Spider-Man|network=Disney XD|season=2|number=35|airdate=August 6, 2018}}</ref> Similarly to past depictions, this version is a notorious, elderly crime boss who sports an exoskeleton. In his most notable appearance, Silvermane became the leader of the Goblin Nation's Cyber Goblins before he is defeated by Spider-Man and the [[Harry Osborn|Hobgoblin]].\n\n===Video games===\n* Silvermane appears in the [[SNES]] and [[Sega Genesis]] beta versions of the 1995 ''[[Spider-Man (1995 video game)|Spider-Man]]'' video game. However, he was replaced with a robot in the final versions.\n* Silvermane appears in the [[Nintendo DS]] version of ''[[Spider-Man: Shattered Dimensions]]'', voiced by [[Steve Blum]].<ref name=\"BTVA\"/> Having survived to the year [[Marvel 2099|2099]] due to his cybernetic body, he attempts to use a fragment of the Tablet of Order and Chaos to become immortal, only to be defeated by [[Spider-Man 2099]].\n* Silvermane appears as a playable character in ''[[Lego Marvel Super Heroes 2]]'', as part of the \"[[Cloak and Dagger (comics)|Cloak and Dagger]]\" [[Downloadable content|DLC]].<ref>{{Cite news|url=https://www.cbr.com/lego-marvel-super-heroes-2-cloak-and-dagger-dlc/|title=Cloak & Dagger Join LEGO Marvel Super Heroes 2|date=20 March 2018|work=CBR|access-date=21 April 2018|language=en-US}}</ref>\n\n===Novels===\nSilvermane appears in the novel ''Spider-Man: Forever Young'', written by [[Stefan Petrucha]].{{citation needed|date=July 2017}} The details of the tablet story are retold, with some elements being updated or changed, such as Silvermane displaying a disdain for personal electronic devices due to their lack of security as well as the Kingpin being left in a coma due to the shock of learning that his son was the masked criminal, the Schemer. The novel picks up two years after the original storyline, with Silvermane now randomly aging from childhood to adulthood as he attempts to force Curt Connors and Spider-Man to retrieve the tablet and stabilize his condition. Even after Connors's research asserts that the tablet essentially cycles someone through their reincarnations in one lifetime to try to achieve true [[karma]], Silvermane refuses to accept this and attempts to blackmail Spider-Man to help him after deducing his true identity. Spider-Man eventually confronts Silvermane in the latter's church hideout. The ensuing battle ends with an enraged Silvermane burning the church down to try to kill Spider-Man, though his ultimate fate is left unclear.\n\n==References==\n{{Reflist}}\n\n==External links==\n* [http://marvel.com/universe/Silvermane Silvermane] at Marvel.com\n* [http://www.spiderfan.org/characters/silvermane.html Silvermane's entry at Spiderfan.org]\n*{{Marvunapp|http://www.marvunapp.com/Appendix8/silvermane_manfredism.htm|Silvermane}}\n\n{{Spider-Man characters}}\n{{Cloak and Dagger}}\n{{Stan Lee}}\n{{DEFAULTSORT:Silvermane (Comics)}}\n[[Category:Characters created by John Buscema]]\n[[Category:Characters created by Stan Lee]]\n[[Category:Comics characters introduced in 1969]]\n[[Category:Fictional crime bosses]]\n[[Category:Fictional gangsters]]\n[[Category:Fictional Italian American people]]\n[[Category:Fictional Sicilian people]]\n[[Category:Hydra (comics) agents]]\n[[Category:Marvel Comics characters with superhuman strength]]\n[[Category:Marvel Comics cyborgs]]\n[[Category:Marvel Comics male supervillains]]\n[[Category:Marvel Comics supervillains]]\n[[Category:Spider-Man characters]]"}]}}}}