{"batchcomplete": "", "warnings": {"main": {"*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes. Use [[Special:ApiFeatureUsage]] to see usage of deprecated features by your application."}, "revisions": {"*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."}}, "query": {"normalized": [{"from": "Venus_(Marvel_Comics)", "to": "Venus (Marvel Comics)"}], "pages": {"3590421": {"pageid": 3590421, "ns": 0, "title": "Venus (Marvel Comics)", "revisions": [{"contentformat": "text/x-wiki", "contentmodel": "wikitext", "*": "{{Short description|Fictional characters appearing in Marvel Comics}}\n'''Venus''' is the name of two [[fictional character]]s appearing in [[American comic book]]s published by [[Marvel Comics]]. [[#Venus|The first]], originally based on the goddess [[Venus (mythology)|Venus]] ([[Aphrodite]]) from [[Roman mythology|Roman]] and [[Greek mythology]], was [[Retroactive continuity|retconned]] to actually be a [[Siren (mythology)|siren]] that only resembles the goddess. [[#Aphrodite|The second]] is stated to be the true goddess, who now wishes only to be referred to by her Greek name, Aphrodite. The similarities between the two characters are a point of conflict in the comics.\n\n==Venus==\n{{Infobox comics character<!--Wikipedia:WikiProject Comics-->\n|image= [[File:Venus-comics-leonardkirk.jpg|250px]]\n|caption=Venus, from ''[[Agents of Atlas]]'' #5. Pencils by [[Leonard Kirk]].\n|character_name=Venus\n|real_name=\n|publisher=[[Marvel Comics]]\n|debut=''[[Venus (comic book)|Venus]]'' #1 (Aug. 1948)\n|creators= [[Stan Lee]] (writer)<br/>[[Ken Bald]] (artist)\n|species= [[Siren (mythology)|Siren]]\n|homeworld=\n|status=\n|alliances=[[Agents of Atlas]]<br>G-Men<br>[[God Squad (comics)|God Squad]]\n|aliases=\"V\"<br/>\"Goddess\"<br/>\"Aphrodite\"<br/>Victoria Nutley Starr\n|powers=\n*Immortality\n*Shapeshifting\n*Hypnotic voice\n*Illusion casting\n*Aquatic adaption\n|}}\n\n'''Venus''' is a [[fictional character]] in the [[Marvel Comics]] [[Marvel Universe|universe]], originally based on the goddess [[Venus (mythology)|Venus]] ([[Aphrodite]]) from [[Greek mythology|Greek]] and [[Roman mythology]]; however, it is later revealed that she is a [[Siren (mythology)|Siren]] and not the true goddess. The Marvel version of the character first appeared in ''[[Venus (comic book)|Venus]]'' #1 (August 1948).<ref>{{cite book |last1=DeFalco |first1=Tom |last2=Sanderson |first2=Peter |last3=Brevoort |first3=Tom |last4=Teitelbaum |first4=Michael |last5=Wallace |first5=Daniel |last6=Darling |first6=Andrew |last7=Forbeck |first7=Matt |last8=Cowsill |first8=Alan |last9=Bray |first9=Adam |title=The Marvel Encyclopedia |date=2019 |publisher=DK Publishing |isbn=978-1-4654-7890-0 |page=393}}</ref>\n\n===Publication history===\nIn the original 1940s ''Venus'' series, Venus dwelled on the planet [[Venus]] with her [[handmaiden|female companions]]. She traveled to Earth and took on the human identity of Victoria \"Vicki\" Nutley Starr, a journalist and editor for ''Beauty'' magazine.<ref>{{cite book |last1=Brevoort |first1=Tom |last2=DeFalco |first2=Tom |last3=Manning |first3=Matthew K. |last4=Sanderson |first4=Peter |last5=Wiacek |first5=Win |title=Marvel Year By Year: A Visual History |date=2017 |publisher=DK Publishing |isbn=978-1465455505 |page=39}}</ref> She developed a romantic relationship with ''Beauty'' editor Whitney Hammond; he and Venus' rival, Della Mason, were among the few people to meet Venus who did not believe her when she claimed that she was a goddess. She helps people repair their broken relationships.<ref>{{cite book |last1=Nevins |first1=Jess |title=Encyclopedia of Golden Age Superheroes |date=2013 |publisher=High Rock Press |isbn=978-1-61318-023-5 |page=285}}</ref>\n\nThe series began as a light-hearted humor/fantasy series, but as the series continued, its focus shifted towards darker fantasy and horror themes. Through the course of the series, the Marvel Comics interpretations of several mythological figures appeared, including [[Hercules (Marvel Comics)|Hercules]], [[Zeus (Marvel Comics)|Zeus]], various other Olympians, [[Satan (Marvel Comics)|Satan]], and, in their first Marvel appearance, the Norse gods [[Thor (Marvel Comics)|Thor]] and [[Loki (Marvel Comics)|Loki]]. ''Venus'' was canceled with issue #19.\n\nThe character drifted into obscurity after her series ended, and Venus did not reappear for 20 years, when she resurfaced in ''[[Sub-Mariner]]'' #57 (Jan. 1973). Venus manipulated Namor into defeating [[Ares (Marvel Comics)|Ares]], who was attempting to [[rape|force her to love him]].<ref name=\"Sub-Mariner #57\">''Sub-Mariner'' #57</ref> Venus was now a guide for young [[activist]]s such as [[Namorita]], searching for ways to promote peace, and [[anti-war|to end modern warfare]]. At this time, she wore only a [[swimsuit]] or a [[toga|revealing white gown]].\n\n===Fictional character biography===\nVenus was born an immortal siren, one of the daughters of the river god Achelous and the divine muse of dance Terpsichore.<ref name=\"ReferenceA\">''Thor & Hercules: Encyclopaedia Mythologica'' #1. Marvel Comics</ref> The sirens lived on the Sirenum scopuli islands and eventually fell into the service of the ocean elemental Phorcys, who used their \"siren song\" to lure mortal sailors to watery deaths.<ref name=\"ReferenceA\"/><ref name=\"ReferenceB\">''Agents of Atlas'' #5. Marvel Comics</ref> In the late 19th century AD, two ships from Asia encountered one of these sirens while on a voyage to Morocco. The first ship's crew became mesmerized by the siren's song and crashed their vessel on the rocks, but the [[Ancient One|Sorcerer Supreme Yao]] saved the second ship from a similar fate by mystically imbuing the siren with a soul. Horrified at her past behavior, the repentant siren fled and lived at a convent for years.<ref name=\"ReferenceB\"/> At some point in the distant past, this siren had a relationship with the Shinto god Susanoo.<ref>''Chaos War: God Squad'' #1. Marvel Comics</ref>\n\nIn the mid-20th century, the siren, still ashamed of her past, adopted the name \"Venus\" and impersonated the Olympian goddess of love and beauty [[#Aphrodite|Aphrodite]], claiming to have sacrificed many of her divine powers so she could walk among mortals and teach them to love.<ref name=\"ReferenceA\"/> In recent decades, she has used the secret identity on Earth of humanities professor Victoria N. Starr as a cover for her activities as an adventurer.\n\nThe series ''[[Marvel: The Lost Generation]]'' revealed that Venus and several other heroes who had been active in the 1950s briefly banded together, but did not remain as a team. This team has recently re-banded in [[Agents of Atlas]] and Venus has rejoined the team.\n\nVenus' true origins were revealed by Namora: this Venus was actually a soulless [[Siren (mythology)|Siren]] that lured sailing ships to her with her voice and fed on the sailors. To prevent his ship and his crew from being feed on, the captain of a merchant ship hired a mystic to kill her. The mystic instead gave her a soul. The Siren then took the form of a beautiful woman (forbidding herself to speak again) and was taken in by a nunnery, where she lived for decades and believed herself a mute servant girl, until she joined a chorus, filling the visiting clergy with lust. She was then expelled from the nunnery. Learning how to use her voice for good, she blocked out all memories of her previous life and assumed that she was Venus reborn, based on the legends she had heard about a beautiful, immortal girl wandering the world as a goddess in a human body and winning her battles with the power of \"love\". 'Venus' resurfaced in the 1940s and acted as a superhero. Learning the truth about her past, Venus fell into despair and nearly destroyed her companions with her song. [[Jimmy Woo]] resisted her song and reminded her of all the good she had done, restoring her belief in herself, which allowed her to reverse the effects on the others.<ref>''Agents of Atlas'' #5</ref>\n\nShe had since elected to stay with the ''Agents of Atlas'', using her restored powers to soothe and calm her opponents, while traveling around the world in Marvel Boy's ship, along with her teammates, shutting down the villainous branch of the former ''Atlas Foundation''.<ref>''Agents of Atlas'' #6</ref> She eventually came up with the idea to alter [[Spider-Man]]'s perception of a common fight, leaving him with false memories of having helped someone else instead of [[mindwiping]] him.<ref>''Spider-Man Family'' Vol 2 #4</ref>\n\nSubsequently, she was abducted by the true Olympian goddess [[#Aphrodite|Aphrodite]], angry at her for assuming her name and guise.<ref name=\"X-Men vs. Agents of Atlas #1\">''X-Men vs. Agents of Atlas'' #1</ref> Rescued by the group, they have further battles with Aphrodite, until in a climactic battle of song, the goddess decides to appoint Venus in her place, recognizing that she has not been truly dedicated to love since [[Troy]].<ref>''The Incredible Hercules'' #138–141</ref> \n\nAfter Hercules' death, she and Namora roam the world, bringing his financial affairs in order. She uses her gifts to comfort many who are devastated by his loss.<ref>''Hercules: Fall of Avenger'' #1–2 (2010)</ref>\n\n===Powers and abilities===\nVenus has the power to project images or illusions of herself and to control the emotions of others, as well as the ability to fly at high speeds, shield herself from mortal sight, and shift her physical form into other beings. Before the retcon, she was considered to be an Olympian goddess, and thought to possess the enhanced physical characteristics typical of Olympian gods in the Marvel Universe, including superhuman stamina, durability, agility, and reflexes, extraordinary vitality, and virtual immortality.<ref>''Thor & Hercules: Encyclopaedia Mythologica'' #1</ref>\n\nAfter her memories were restored, Venus realized her empathic abilities were really derived from a powerful \"siren song\" — she is able to heal and restore, curing people's souls by giving them a moment of true bliss in which they can live their most prized fantasy. Her voice is mystically empowered with advanced mind-control abilities, related to her mood: when she speaks in joy, she fills her listeners with bliss and fanatical love for her; when she cries in sadness, her listeners drown in despair too. Her power was strong enough to immediately subdue the [[Sentry (Robert Reynolds)|Sentry]] into helping her find [[Norman Osborn]] during \"[[Dark Reign (comics)|Dark Reign]].\" Like many characters with vocal-based abilities, it has been shown that Venus' siren song can be disabled if she is gagged.<ref name=\"X-Men vs. Agents of Atlas #1\"/>\n\n===Other versions===\n\n====''What if?''====\n''[[What If (comics)|What If]]'' #9 showed Venus as a member of a 1950s [[Avengers (comics)|Avengers]] team called the G-Men which assembled to defeat the [[Yellow Claw (comics)|Yellow Claw]].<ref>''[[What If (comics)|What If]]'' #9</ref> \n\n==Aphrodite==\n{{Infobox comics character <!--Part of Wikipedia:WikiProject Comics-->\n|image          = [[File:Aphrodite (Marvel Comics).jpg|250px]]\n|caption        = Aphrodite in ''[[The Incredible Hercules]]'' #140 (Jan. 2010). Art by [[Gabriel Hardman]].\n|character_name = Aphrodite\n|full name      = Aphrodite Pandemos\n|publisher      = [[Marvel Comics]]\n|debut          = ''X-Men vs. Agents of Atlas'' #2 (Nov. 2009)\n|creators       = [[Jeff Parker (comics)|Jeff Parker]] (Writer)<br>[[Carlo Pagulayan]] (Artist)\n|species        = [[Olympians (Marvel Comics)|Olympian]]\n|homeworld      = [[Olympus (Marvel Comics)|Olympus]]\n|alliances      =\n|aliases        = Venus\n|supports       =\n|powers         = *[[Superhuman strength]], speed, durability, stamina, agility, reflexes, and [[immortality]]\n*Regenerative healing factor\n*Energy manipulation\n*Love manipulation\n*Skilled in the art of love and sexual passion}}\n\n'''Aphrodite''' is a fictional character in the comic book, ''[[The Incredible Hercules]]'' published by [[Marvel Comics]]. Aphrodite is an [[Olympians (Marvel Comics)|Olympian]] based on the goddess of the [[Aphrodite|same name]] from [[Greek Mythology]] first appearing in ''X-Men vs. Agents of Atlas'' #2 (Nov. 2009) by [[Jeff Parker (comics)|Jeff Parker]] and [[Carlo Pagulayan]].\n\n===Fictional character biography===\nVenus is the [[Olympians (Marvel Comics)|Olympian]] goddess of love and beauty who is [[Zeus (Marvel Comics)|Zeus]]' daughter by the oracular goddess Dione.<ref name=\"ReferenceA\"/> She was born off the coast of the Isle of Kythira and grew to become the most beautiful and desired of the Olympian goddesses.<ref name=\"ReferenceA\"/> Venus wears an enchanted girdle called the Cestus which enables her to arouse love and passion in others at will and to transform weapons into objects that can be used for peaceful purposes.\n\nAphrodite later became the wife of [[Hephaestus (Marvel Comics)|Hephaestus]], whom she was given to by [[Hera (Marvel Comics)|Hera]] in order to make amends for casting him out of Olympus when he was just a child. However, Aphrodite never loved Hephaestus who she found to be hideous due to his physical handicap and instead desired Hephaestus' brother, [[Ares (Marvel Comics)|Ares]]. The marriage was ended after Hephaestus caught the lovers in bed together, and with a net made of adamantine brought them before [[Zeus (Marvel Comics)|Zeus]] for retribution.<ref name=\"oneforty\">''[[The Incredible Hercules]]'' #140 (Jan. 2010)</ref> However, the union between Aphrodite and Ares produced the cherubic god of lust Cupid, known as \"Eros\" to the Greeks.<ref name=\"ReferenceA\"/>\n\n====X-Men Vs. Agents of Atlas====\nWith the help of Hera, Aphrodite locates [[#Venus|Venus]], whom she views as an imposter and sends one of her [[centaur]]s to kidnap her. Venus is bound and [[gag]]ged and brought back to Aphrodite's temple where she is chained, branded with a [[fire iron|poker]] and put before a statue of Aphrodite. Through the statue Aphrodite expresses her outrage that Venus has stolen her name and form. The [[Agents of Atlas]], with the help of the [[X-Men]], track Venus using [[Cerebro]] and rescues her from the temple.<ref>''X-Men Vs. Agents of Atlas'' #1–2 (2009)</ref> Aphrodite, still angered, sends [[Phorcys]], Venus' creator to reclaim her but is halted by the Agents of Atlas.<ref name=\"onethirtyeight\" />\n\n====Assault on New Olympus====\nAfter the destruction of [[Olympus (Marvel Comics)|Olympus]] and the death and rebirth of Zeus, Hera takes control of the Olympus Group, a corporation that handles the Olympians' Earthly enterprises, and uses her power to create a product that would bring about mankind's extinction. In order to stop her, [[Athena (Marvel Comics)|Athena]] and [[Amadeus Cho]] devise a plan which first involves seeking Aphrodite's help.<ref name=\"prologue\">''Assault on New Olympus Prologue'' #1 (Nov. 2009)</ref> Aphrodite agrees to stall Ares from defending the Olympus Group by sleeping with him and in turn Athena agreed to aid Aphrodite in confronting Venus.<ref name=\"onethirtyeight\">''[[The Incredible Hercules]]'' #138 (Nov. 2009)</ref>\n\nWhile The [[The New Avengers (comics)|New Avengers]], the [[The Mighty Avengers|Mighty Avengers]] and Athena stage a frontal assault on the Olympus Group, the Agents of Atlas try to infiltrate the corporation from underground. They are stopped by Aphrodite who confronts Venus.<ref name=\"oneforty\" /> During the ensuing battle, Aphrodite comes to the realization that she hasn't felt love in centuries, since the Trojan War. Aphrodite then passes the title of 'goddess of love' and the girdle Cestus to Venus.<ref>''[[The Incredible Hercules]]'' #141 (February 2010)</ref>\n\n===Powers and abilities===\nAphrodite possesses the typical powers of an [[Olympians (Marvel Comics)|Olympian]], including [[superhuman strength]], speed, durability, and reflexes, and virtual [[immortality]].<ref name=\":0\">{{Cite web |last=O'Brien |first=Megan Nicole |date=2020-11-08 |title=Marvel: 10 Best Golden Age Heroines, Ranked |url=https://www.cbr.com/marvel-best-golden-age-heroines/ |access-date=2022-10-24 |website=CBR |language=en-US}}</ref> Like all Olympians she has some resistance to magic and is immune to all terrestrial diseases, aging and poisons. As the goddess of love, Aphrodite has more power to sense, inspire and control the emotions of love and sexual desire than any other god. Her powers have been demonstrated to be powerful enough to influence Zeus himself. The only known beings who were immune to her influence were her half-sisters, Athena and Artemis and her aunt, Hestia. She also possesses the range of abilities endemic to most Olympian gods. Aphrodite can teleport between Olympus and Earth.<ref>''Venus'' #1</ref> She can fly/levitate.<ref>''Venus'' #1</ref><ref>''Incredible Hercules'' #141</ref> She can change her own shape and appearance and that of others. Aphrodite can turn invisible (demonstrated when she saved the Trojan prince Paris from his Greek rival Menelaus in the Trojan War). She is able to use telekinesis.<ref>''X-Men vs. Agents of Atlas'' #1</ref> The goddess can generate fields of defensive energy (force fields) as when she similarly saved her son Aeneas from the Greek Diomedes. Like other gods, she also possesses some localized control over weather, the elements and animals. Aphrodite is the original owner of the Cestus, a magical girdle created by Hephaestus which enhances even further her already formidable powers over love and desire. It also enables her to transform weapons into objects that can be used for peaceful purposes.\n\n== Reception ==\n\n=== Accolades ===\n\n* In 2011, ''[[Comics Buyer's Guide]]'' ranked Venus/Aphrodite was ranked 8th in their \"100 Sexiest Women in Comics\" list.<ref>{{cite book |last=Frankenhoff |first=Brent |title=Comics Buyer's Guide Presents: 100 Sexiest Women in Comics |publisher=[[Krause Publications]] |year=2011 |isbn=978-1-4402-2988-6 |page=15 |author-link=Brent Frankenhoff}}</ref>\n* In 2019, ''[[CBR.com]]'' ranked Venus/Aphrodite 10th in their \"Marvel Comics: The 10 Most Powerful Olympians\" list.<ref>{{Cite web |last=Chrysostomou |first=George |date=2019-10-14 |title=Marvel Comics: The 10 Most Powerful Olympians, Ranked |url=https://www.cbr.com/marvel-comics-most-powerful-plympians/ |access-date=2022-10-24 |website=CBR |language=en-US}}</ref>\n* In 2020, ''[[CBR.com]]'' ranked Venus/Aphrodite 4th in their \"Marvel: 10 Best Golden Age Heroines\" list.<ref name=\":0\" />\n* In 2021, ''[[CBR.com]]'' ranked Venus/Aphrodite 10th in their \"Marvel: 10 Most Powerful Olympians\" list.<ref>{{Cite web |last=O'Brien |first=Megan Nicole |date=2021-05-06 |title=Marvel: 10 Most Powerful Olympians, Ranked |url=https://www.cbr.com/marvel-most-powerful-olympians/ |access-date=2022-10-24 |website=CBR |language=en-US}}</ref>\n* In 2022, ''[[Sportskeeda]]'' ranked Venus/Aphrodite 2nd in their \"10 best Greek gods from Marvel comics \" list.<ref>{{Cite web |last=Hill |first=Brad |title=Exploring 10 best Greek gods from Marvel comics amid MCU debut of Olympians in Thor: Love and Thunder |url=https://www.sportskeeda.com/comics/10-best-olympians-marvel-comics-amid-mcu-debut |access-date=2022-10-24 |website=www.sportskeeda.com |language=en-us}}</ref>\n\n==References==\n{{Reflist}}\n\n==External links==\n* [http://www.marvel.com/universe/Venus_%28Aphrodite%29 Venus (Aphrodite)] at Marvel.com\n* [http://www.marvel.com/universe/Venus_%28siren%29 Venus (siren)] at Marvel.com\n* [http://www.toonopedia.com/articles/venus.htm Toonopedia Entry]{{dead link|date=July 2016 |bot=InternetArchiveBot |fix-attempted=yes }} for Venus\n* {{Marvunapp|http://www.marvunapp.com/Appendix/venusaph.htm|Venus}}\n\n{{Agents of Atlas}}\n{{Hercules}}\n{{Marvel Comics deities}}\n{{GoldenAge}}\n{{Stan Lee}}\n[[Category:1948 comics debuts]]\n[[Category:Articles about multiple fictional characters]]\n[[Category:Comics characters introduced in 1948]]\n[[Category:Comics characters introduced in 2009]]\n[[Category:Fictional activists]]\n[[Category:Fictional goddesses]]\n[[Category:Fictional models]]\n[[Category:Golden Age superheroes]]\n[[Category:Classical mythology in Marvel Comics]]\n[[Category:Greek and Roman deities in fiction]]\n[[Category:Marvel Comics female superheroes]]\n[[Category:Marvel Comics titles]]\n[[Category:Sirens (mythology)]]\n[[Category:Timely Comics characters]]\n[[Category:Venus in art]]"}]}}}}